{"title": "Cape, Safari & Falls", "link": "https://www.tucantravel.com/tour/cape-safari-and-falls/acv/", "dates": {"2021-01-09": "USD 400.00", "2021-01-30": "USD 400.00", "2021-02-20": "USD 400.00", "2021-03-20": "USD 400.00", "2021-04-03": "USD 400.00", "2021-04-10": "USD 400.00", "2021-04-24": "USD 400.00", "2021-05-01": "USD 400.00", "2021-05-15": "USD 400.00", "2021-05-22": "USD 400.00", "2021-06-05": "USD 400.00", "2021-06-12": "USD 400.00", "2021-06-26": "USD 400.00", "2021-07-03": "USD 400.00", "2021-07-17": "USD 400.00", "2021-07-24": "USD 400.00", "2021-08-07": "USD 400.00", "2021-08-14": "USD 400.00", "2021-08-28": "USD 400.00", "2021-09-04": "USD 400.00", "2021-09-18": "USD 400.00", "2021-10-09": "USD 400.00", "2021-10-30": "USD 400.00", "2021-11-20": "USD 400.00", "2021-12-11": "USD 400.00"}, "days": "9", "description": "T We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Cape Town and the start of your tour. You are free to arrive today at your leisure – please note that there will be a pre departure meeting tonight at 6pm to meet your tour leader and group.Cape Town, located on the coast of South Africa, is considered one of the most beautiful cities on the continent. Walk around the V&A Waterfront, take in the views of Table Mountain or dine in one of many delicious local restaurants.Included today is a Cape Town City Orientation Tour, visit to Table Mountain and a visit to Robben Island, where former South African President and Nobel Laureate Nelson Mandela was incarcerated among other political prisoners. Once a blight on the nation's history, the island is now seen as a national symbol of triumph over adversity and has been recognised by UNESCO as a World Heritage Site. Excursions to the island are weather dependent.Table Mountain is one of the New 7 Wonders of Nature and a highlight of any trip to South Africa.This morning you will be transferred to Cape Point, passing the scenic Atlantic coastal road on route. Pass the pristine beaches of Clifton and Camps Bay with their contrasting crystal blue waters and fresh white sand. With the Atlantic Ocean on one side and the alluring twelve Apostles mountain range to your other, this drive offers truly fantastic scenery of South Africa. After this, we will visit Boulders Beach where you will witness a colony of African penguins.Finally, enjoy a wine and cheese tasting sampling some of South Africa’s finest produce before returning to Cape Town to enjoy the final evening.After breakfast we will head to the airport and fly to Johannesburg – our gateway to Kruger National Park. After arrival you will have the remainder of the day free.We have an early morning start to get to Kruger National Park where we search for the big five. The journey will take around six hours. Upon arrival we will immediately enjoy an afternoon game drive to start viewing the animals that call the reserve home.Kruger National Park is South Africa's premier game reserve, regarded as one of the finest in Africa. Here you'll have the chance to experience the vast diversity of wildlife as we explore some of the two million hectares of the park. The big five game animals of Africa are richly represented here – lion, leopard, African buffalo, African elephant and the white rhino in large numbers.This morning you will enjoy another game drive spotting more animal action in the national park. Learn all about the history of the park and animals and why conservation of these fantastic creatures is so important.We will depart Kruger National Park and take a flight to one of Africa’s greatest attractions and one of the most spectacular waterfalls in the world. With a length of over one kilometre and a height of over one hundred metres this magnificent natural wonder of cascading water defines the border separating Zimbabwe & Zambia. Depending on the wind direction you can hear the roar from the falls up to 4km away as it surges into Africa’s fourth biggest river, the mighty Zambezi.Tonight we will stay close to the action in the town of ‘Victoria Falls’You have a full free day to enjoy Victoria Falls and its activities.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/south_africa_154/south_africa_cape_town_20161111_1323935873.jpg", "countries": "South Africa, Zimbabwe"}