{"title": "Safari, Gorillas & Beach", "link": "https://www.tucantravel.com/tour/safari-gorillas-and-beach/afsg/", "dates": {"2020-04-11": "USD 1580.00", "2020-05-16": "USD 1580.00", "2020-05-30": "USD 1580.00", "2020-06-20": "USD 1580.00", "2020-07-04": "USD 1580.00", "2020-07-25": "USD 1580.00", "2020-08-08": "USD 1580.00", "2020-08-29": "USD 1580.00", "2020-10-03": "USD 1580.00", "2020-11-07": "USD 1580.00", "2020-12-12": "USD 1580.00", "2021-01-16": "USD 1650.00"}, "days": "22", "description": "An extensive journey through east Africa, head straight to Rwanda to learn about the country’s recent history and the lengths it has gone to to implement change. From Uganda, spend an hour with the endangered mountain gorillas and relax on the banks of the River Nile in Jinja. In Kenya, enjoy safari drives through the famous Masai Mara and in Tanzania, after more safaris and wildlife viewing opportunities, sink your feet into the sand on Zanzibar Island. We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Nairobi and the start of your adventure! Kenya’s capital city is a hub for business and culture with an inner population of around 3.5 million.You are free to arrive today at your leisure. If you wish to go exploring, we recommend seeking local advice from the hotel about where is safe to walk. Petty theft is unfortunately common in Nairobi and you should remain vigilant at all times.There will be a pre departure meeting tonight to meet your tour leader and fellow travellers. Please look out for information on reception.After breakfast this morning we transfer to Nairobi Airport to take our flight to Kigali, Rwanda’s capital. Kigali is the largest city of Rwanda, and is a large cultural and commercial hub.Kigali has had a turbulent past and was the scene of the Rwandan Genocide which you will learn more about tomorrow. In recent years, it has transformed and is now one of the most attractive cities in Africa with pretty boulevards, tasty restaurants and a lively atmosphere. On arrival the rest of your afternoon / evening is free to relax.After breakfast you will be collected from your hotel and taken on a private guided tour to visit the Kigali Genocide Memorial Centre where you will learn about the recent history of the Rwandan Genocide and the mass execution of the Tutsi population.We will make a brief stop for lunch before leaving the capital. We will pass through lush countryside, and rolling plantations, seeing many locals go about their daily lives before crossing the border into Uganda, where we will then be transferred to Lake Bunyonyi, arriving late afternoon.Lake Bunyonyi is our base for the next few days and will be the start point for our excursion to see endangered mountain gorillas in the Bwindi Impenetrable Forest. There are believed to be less than 800 mountain gorillas remaining in the world, and about half of that population live in this forest. To watch them in their natural habitat is a heart-stirring experience.Please note: A yellow fever vaccination is required if you are travelling to/from countries with risk of yellow fever transmission in Africa; this includes transiting through a yellow fever risk country. The Majority of our tours in Africa require a yellow fever certificate therefore we highly recommend that you obtain this prior to travel. Please make sure that on arrival you have a valid yellow fever certificate ready for inspection by local customs or health authorities, otherwise you could be refused entry or quarantined.Today can be quite a long day so make sure you pack enough water in your day bag to keep hydrated on your trek. To reach the trekking starting point, we will be picked up early in the morning to head for the national park. Expect to trek for up to eight hours today as specialist guides go ahead of you, early in the morning and track the gorilla spoor and look for signs of the gorillas last movements. The distance you trek is unpredictable and varies depending on how active the gorillas are. Some will not move far from where the trackers left them the day before while others will travel long distances in the search for food.Bwindi Impenetrable Forest is a series of rolling hills with heavy foliage and trekking to the gorillas can often involve steep uphill or downhill climbs, sometimes on uneven and wet terrain. Hiking boots are important and you can rent walking sticks at an extra cost to stabilise your feet. The altitude in the forest is varied, with the highest point being 2607m above sea level and 60% of it being over 2000m. With this in mind, you might find hiking through the terrain slightly more difficult than at sea level. Your guides will keep you give you a detailed safety briefing before you depart on the hike and will reiterate key points shortly before getting close to the gorillas.Your time with the gorillas is restricted to one hour. This is to safeguard the gorilla families and prevent excessive human contact. You can admire the animals and take photos so make sure your batteries are charged and your memory cards empty. Once your hour is up, you will begin the climb out of the forest. Your guides will take you to the nearest road where a 4WD should be waiting to take you back to camp.You can read more about the gorilla trek here.Today you will have a free morning to relax and recuperate after your trek. Alternatively if you wish to explore the area a little more, then you can opt to visit some of the nearby villages, take a swim in the lake or walk up to some of the amazing viewpoints which overlook the area.Lake Bunyonyi is around 29 kilometres long and 7 kilometres wide, dotted by 29 islands. Look out for Uganda's national bird, the crested crane, among the 200 other bird species in the area.After experiencing the beautiful scenery, spectacular wildlife and welcoming local communities of Lake Bunyonyi, we will be transported to meet our custom built overland expedition vehicle in the town of Kabale. From here we will make our way to Uganda’s capital, Kampala. En route to Kampala we will be passing townships and local markets and will also make a stop at the equator to get that all essential picture of you with one foot in the Southern and one foot in the Northern Hemisphere! The equator has some of the best opportunities to purchase souvenirs in all of East Africa.After breakfast we head towards the source of the mighty Nile River.Jinja is known for being the adventure sports hub of Uganda and offers world-class white water rafting on the Nile River as well as quad biking and mountain biking. There is plenty to entertain you in this buzzing town!!Today you are free to explore Jinja.For those who want a more relaxing experience you will have the opportunity to go for a refreshing swim in the Nile, take a walk through the local villages or visit the markets - depending on the day of the week.Today we head to Lake Naivasha where we will spend two nights. Here you will have a full free day to explore the area and choose from many of the optional activities on offer.Due to our location at Lake Naivasha you may awake to some unusual sound effects in the morning as the wildlife roam.Explore the nearby Hell's Gate National Park on foot or by bicycle on a half day tour. With no predators present this is one of the few parks in Africa where you can enter on foot and walk beside wildlife such as giraffe, zebra, gazelle and warthogs to mention a few while taking in the amazing scenery that surrounds you. Don’t miss a walk through the beautiful and impressive Hell’s Gate Gorge and see why it inspired the stampede scene in Disney’s Lion King.You can also visit Elsamere, the former home of the late Joy Adamson, who became famous for her relationship with the lioness Elsa in the film Born Free.We depart Naivasha early, after breakfast and drive to our lunch spot where we will exchange our expedition truck for 4WD safari van before continuing on to the Masai Mara Nature Reserve. On arrival we get straight into our first game drive in one of the world's most famous and expansive wildlife reserves.Covering over 1,500 square kilometres and providing habitat for thousands of animals, the Masai Mara Nature Reserve is deservedly one of Kenya’s most popular safari spots. Animals present in the reserve include the big five (lions, elephants, Cape buffaloes, leopards and rhinoceros), various grazing mammals which attract carnivores such as cheetahs, hyenas and jackals, and over 500 recorded species of birds. We stay just outside the park in permanent tents, enjoying a buffet dinner in the evening.This morning we leave camp early for a second game drive, visiting the mighty Mara River. During the annual Great Migration, this is the setting for the thunderous display of thousands of wildebeest crossing the river while canny crocodiles lie in wait. At any time of year, the river is vitally important to the ecosystem and a good spot to view animals. You will also have the opportunity to visit a local Masai village, learning about the vibrant, semi-nomadic herders’ way of life and join them in a local dance.Today we leave the incredible Masai Mara behind and head back to Nairobi where you have the rest of the day free at your leisure.Today we visit the elephant orphanage and experience the feeding before making our way to the Giraffe centre. Spend time learning more about the wildlife at the educational centre and take snaps of these magnificent creatures. We will then arrive back mid-late afternoon and you have the evening free to relax.Crossing the border into Tanzania, we make our way to Arusha. It is here that we will prepare to enter the Serengeti National Park and Ngorongoro Crater. You will stay here for the night, leaving your belongings with the truck and taking only an overnight bag on your included excursion to the Serengeti NP and Ngorongoro Crater tomorrow.A place that needs no introduction, the Serengeti National Park is the most famous safari destination in Africa. We’re picked up after breakfast and taken by 4WD to the national park. The afternoon is spent game driving to our lodge, located inside the national park to maximise our time and wildlife viewing opportunities.Before we reach the Serengeti plains, we’ll stop for a stunning vista overlooking the Ngorongoro Crater, the largest unbroken, unflooded caldera in the world. The vast 300 square kilometre crater stretches out in front of you in a kaleidoscope of blues and greens and it’s not until you spot the barely discernible grey speck of an elephant that you truly grasp its scale.Our second day in the park is a full day of game driving, trying to spot the more elusive members of the animal kingdom before heading to our lodge just outside the Ngorongoro Crater.Every safari is unique and you will never know what’s in store for you until you arrive. Among the hundreds of species in the park, you may encounter zebra, giraffe, wildebeest, buffalo, lion, cheetah, leopard, hippopotamus, hyena, elephant, vulture, monkey, warthog, gazelle and impala. Each season offers a different highlight.Our final morning game driving is spent inside the crater itself - a good place to spot black rhinoceros, elephant and lions.This afternoon, we return to stay in Arusha and reunite with the overland truck.Today we are bound for the enigmatic, intoxicating Isles of Zanzibar. We will transfer to Arusha Airport to take our flight to the paradise island. Arriving in Zanzibar we head to Stone Town where we will spend our first night on the Island.On arrival at our hotel in Stone Town you are free to explore the labyrinth of walled streets, winding alleys, bustling markets and grand crumbling architecture. This UNESCO-listed Stone Town has changed little over the past 200 years. If you enjoy shopping then there are plenty of crafts and colourful souvenirs to be purchased here. Admire the intriguingly decorated elephant-proof doors before sitting down to watch the sun set with a fresh juice, cold beer or cocktail. If the thought of fresh seafood gets the taste buds tingling, make sure you check out the excellent night market on the promenade which serves a feast not to be missed!Today we head to Nungwi Beach. On the way we will stop at one of the many spice plantations where we can discover the abundant plants that flourish in this verdant, tropical environment and sample spices picked straight from the source. We will also visit a small village, having the chance to interact with the locals and experience their kind hospitality; here we will enjoy a traditional lunch cooked by community.We arrive in Nungwi early afternoon and start enjoying this sun kissed paradise. Indulge in a cocktail or two while we watch the sunset over the crystal clear Indian Ocean.Today you are free to relax on the white coral sands or enjoy one of the many water based activities on the island. Snorkel with colourful marine life or simply kick back and soak up the sun. This beautiful setting will certainly provide you with a chance to relax and unwind!With a host of bars and fresh seafood restaurants dotted along the beach there is plenty for every taste.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your tour will end here on Nungwi Beach. If you would like to pre-book a transfer back to Stone Town please contact your Adventure Specialist.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/kenya_125/kenya_truck_20161111_1650136983.jpg", "countries": "Rwanda, Uganda, Kenya, Tanzania"}