{"title": "Gorilla and Chimpanzee Experience", "link": "https://www.tucantravel.com/tour/gorilla-and-chimpanzee-experience/akk/", "dates": {"2021-01-13": "USD 400.00", "2021-02-03": "USD 400.00", "2021-03-03": "USD 400.00", "2021-03-17": "USD 400.00", "2021-03-24": "USD 400.00", "2021-04-07": "USD 400.00", "2021-04-14": "USD 400.00", "2021-04-28": "USD 400.00", "2021-05-05": "USD 400.00", "2021-05-19": "USD 400.00", "2021-05-26": "USD 400.00", "2021-06-09": "USD 400.00", "2021-06-16": "USD 400.00", "2021-06-30": "USD 400.00", "2021-07-07": "USD 400.00", "2021-07-21": "USD 400.00", "2021-07-28": "USD 400.00", "2021-08-11": "USD 400.00", "2021-08-18": "USD 400.00", "2021-09-01": "USD 400.00", "2021-09-22": "USD 400.00", "2021-10-13": "USD 400.00", "2021-11-03": "USD 400.00", "2021-11-24": "USD 400.00", "2021-12-15": "USD 400.00"}, "days": "8", "description": "E We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Kigali and the start of your African adventure! Kigali is the capital city of Rwanda and the main cultural and commercial hub.You are free to arrive today at your leisure - there will be a pre-departure meeting tonight at 6pm so we do ask that you arrive in time for this. Please look out for information on reception.Kigali has a turbulent past and was the scene of the Rwandan Genocide in 1994. You will learn more about this tomorrow with a visit to the Genocide Museum and Peacekeepers Memorial. The city has been slowly transforming over the years and now houses delicious restaurants, bars, galleries and parks. Why not explore the Kimironko Market - one of the best for picking up Rwanda agaseke baskets or other unique gifts.After breakfast we hop on the overland truck and start making our way to Kabale in Uganda. On route, we make a stop at the Belgian Peacekeepers Memorial and Kigali Genocide Museum to learn about the horrors that occurred in Rwanda between April and July of 1994 and that mass execution of the Tutsi population.. The Belgian Peacekeepers memorial pays tribute to the ten UN workers who were murdered by the Hutu extremists which resulted in the full scale unfolding of the genocide.We then cross the border and arrive in Kabale early afternoon, where you have a free afternoon to spend as you wish. Driving into Kabale you will see the unique Ugandan landscape and rolling plantations flash before your eyes where you’ll start to appreciate the underrated beauty of this corner of Africa.Kabale is our base for our excursion to see the endangered mountain gorillas in the Bwindi Impenetrable Forest. There are believed to be less than 800 mountain gorillas remaining in the world, and about half of that population live in this forest. To watch them in their natural habitat is a heart-stirring experience.Today can be quite a long day so make sure you pack enough water in your day bag to keep hydrated on your trek. To reach the trekking starting point, we will be picked up early in the morning to head for the national park. Expect to trek for up to eight hours today as specialist guides go ahead of you, early in the morning and track the gorilla spoor and look for signs of the gorilla's last movements. The distance you trek is unpredictable and varies depending on how active the gorillas are. Some will not move far from where the trackers left them the day before while others will travel long distances in the search for food.Bwindi Impenetrable Forest is a series of rolling hills with heavy foliage and trekking to the gorillas can often involve steep uphill or downhill climbs, sometimes on uneven and wet terrain. Hiking boots are important and you can rent walking sticks at an extra cost to stabilise your feet. The altitude in the forest is varied, with the highest point being 2607m above sea level and 60% of it being over 2000m. With this in mind, you might find hiking through the terrain slightly more difficult than at sea level. Your guides will give you a detailed safety briefing before you depart on the hike and will reiterate key points shortly before getting close to the gorillas.Your time with the gorillas is restricted to one hour. This is to safeguard the gorilla families and prevent excessive human contact. You can admire the animals and take photos so make sure your batteries are charged and your memory cards empty. Once your hour is up, you will begin the climb out of the forest. Your guides will take you to the nearest road where a 4WD should be waiting to take you back to camp.You can read more about the gorilla trek here.Today we will journey through Uganda to reach Kibale Forest National Park - one of the best reserves in the country and the base for the next wildlife based excursion - chimpanzee tracking.Kibale Forest encompasses just under 800km2 of lush forest and houses 13 species of primate. We arrive at our accommodation in the afternoon and you can enjoy a free evening taking in the surroundings before tracking chimpanzees tomorrow.Today you’ll enjoy the chimpanzee tracking experience. There are two slots today, one in the morning and one in the afternoon. Depending on the group size, you will be split into various, smaller groups for the excursion. First off, the group will hop on the overland truck and drive for a short twenty minutes to reach the start of the excursion. Meet your local guide and learn about what’s ahead before walking for around 2 to 3 hours to see the cheeky primates. You’ll likely spot a few other animals on route including other primates such as the grey cheeked mangabey or the red tailed monkey. Make sure to be looking up, chimpanzees are almost always moving through the trees. It’s also likely you will hear them before you see them - they are noisy creatures!Upon returning to your accommodation, the remainder of the day is free to relax.After breakfast we have a short three hour drive to Queen Elizabeth National Park in the western region of Uganda. The reserve is known for African buffalo, hippos, African bush elephants, leopards, lions and chimpanzees. Overall, it’s home to 95 mammals and over 500 birds, yet unlike many of Africa’s more known national parks, it’s much less visited and quieter making for a unique experience.Upon arrival in the afternoon we enjoy a cruise down the Kazinga Channel. This passage of water connects Lake George and Lake Edward within the reserve and offers a unique perspective of the wondrous surroundings. Keep an eye out for animals lurking both in and out of the water!Today we return to Kigali for the evening before our flight to Nairobi tomorrow. The journey to Kigali will take around six hours, again passing fantastic scenery along the way. We will stop for lunch from the truck before arriving at Kigali in the afternoon where you’ll have the remainder of the day free.Perhaps visit the Presidential Palace, once home to President Habyarimana. The remains of the presidential plane can still be seen on the grounds - it was this crash that is thought to have started the genocide.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/uganda_162/uganda_gorillas_20161111_1494080698.jpg", "countries": "Rwanda, Uganda"}