{"title": "Russian Highlights", "link": "https://www.tucantravel.com/tour/russian-highlights/eehr/", "dates": {"2020-09-04": "EUR 120.00", "2020-09-18": "EUR 120.00", "2021-04-02": "EUR 130.00", "2021-04-16": "EUR 130.00", "2021-04-30": "EUR 130.00", "2021-05-14": "EUR 130.00", "2021-05-28": "EUR 130.00", "2021-06-11": "EUR 130.00", "2021-06-25": "EUR 130.00", "2021-07-09": "EUR 130.00", "2021-07-23": "EUR 130.00", "2021-08-06": "EUR 130.00", "2021-08-20": "EUR 130.00", "2021-09-03": "EUR 130.00", "2021-09-17": "EUR 130.00", "2021-10-01": "EUR 130.00", "2021-10-15": "EUR 130.00"}, "days": "7", "description": "C We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Moscow! You are free to arrive today at your leisure and start enjoying all that Moscow has to offer.Golden onion domes and towering skyscrapers, cosy cafes and hushed churches, Russia's capital city is beautiful, atmospheric and overflowing with history. There is plenty to see and do here, including numerous cathedrals, museums, art galleries, palaces, the State History Museum and the iconic St Basil's Cathedral, towers and monuments. We highly recommend arriving in Moscow a day or so earlier to make the most of this fascinating city.Moscow's Red Square (Krasnaya Ploshad) is the main centre of the city and was a market place during the fifteenth century. The red part of its name does not refer to Communism or to the colour of the stone (which is actually grey) but derives from the old Russian word krasniy meaning beautiful. During the Soviet regime the square was known for its May Day parades and is the site of Lenin's Mausoleum.It is said that soon after January 21, 1924, the day that Vladimir Lenin died, the Soviet government received more than 10,000 telegrams from all over Russia, which asked the government to preserve his body somehow for future generations. Lenin's tomb, and final resting place, was then promptly set about being designed and a wooden tomb was constructed within 6 days of his death. A larger mausoleum was constructed later that year and stands today in the centre of the city in the prominent Red Square.There will be a pre departure meeting held in your hotel at 6pm tonight. Please check reception for details.Today you will have a guided tour of the Kremlin. The famous building is listed as a UNESCO World Heritage site and a main focus of Russia's political and historical heritage since the 13th century, housing both royalty and religious figures. The Kremlin wall contains a mass grave of Bolsheviks who perished during the battle for Moscow in 1917, together with the ashes of a number of well-known Russians, including writer Maxim Gorky and Yuriy Gagarin, the first Russian man to visit space.You will have the rest of the day free to enjoy the many activities in Moscow.We have the whole day to spend in Moscow enjoying some last minute sightseeing before we next head to Veliky Novgorod by overnight train.Moscow's metro system is a network of beautifully and artistically decorated stations. Why not take a self-guided tour of the system and discover Moscow's original underground art scene.One of the oldest cities in Russia, Veliky Novgorod is steeped in history. It was one of the first hubs of religious, political and commercial activities in Russia and it is here where we find St Sophia's Cathedral, the oldest cathedral in Russia.Admire the five domed architecture that dominates the Kremlin in Novgorod, and visit the exhibition of the ancient bells that used to ring in St Sophia's bell tower. Previously, the bells were heard from a 50 mile radius and had a distinct melody in memory of the composer Sergey Rakhaminoff, born in Novgorod. The bells were damaged during World War II, so unfortunately they now are grounded, however you can still enjoy panoramic views of Veliky Novgorod from the bell tower itself.This morning we will make our way to St Petersburg. The cosmopolitan city of St Petersburg is known as the 'Venice of the North' because of its rivers and canals which are fascinating and easy to explore by boat. St Petersburg is the second largest city in Russia and sits on the port of the Baltic Sea. Often considered the country's cultural capital, St Petersburg has a UNESCO World Heritage Site listed historic centre and the Hermitage Museum; one of the largest art museums in the world!We will take an orientation walk around the key sights of the city, including a visit to the aforementioned Hermitage Museum to explore the extensive art collection there, and then you will be free to explore this great city at your leisure.Today you are free to further explore the city. There are many sights to see in this former capital including the Winter Palace or the famous Church of the Spilt Blood. It is easy to spend hours wandering St Petersburg and taking in the city's European flare.Other highlights you could opt to visit are the unique Faberge Egg Museum or the Mariinsky Theatre to see a ballet performance.With so much to see, we highly recommend you book some extra time here in St Petersburg. Speak to an Adventure Specialist to find out about booking post tour accommodation.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/russia_148/russia_20161111_1682412937.jpg", "countries": "Russia"}