{"title": "Central Europe Highlights", "link": "https://www.tucantravel.com/tour/central-europe-highlights/eexc/", "dates": {"2021-04-01": "EUR 190.00", "2021-04-15": "EUR 190.00", "2021-04-29": "EUR 190.00", "2021-05-13": "EUR 190.00", "2021-05-27": "EUR 190.00", "2021-06-10": "EUR 190.00", "2021-06-24": "EUR 190.00", "2021-07-08": "EUR 190.00", "2021-07-22": "EUR 190.00", "2021-08-05": "EUR 190.00", "2021-08-19": "EUR 190.00", "2021-09-02": "EUR 190.00", "2021-09-16": "EUR 190.00", "2021-09-30": "EUR 190.00", "2021-10-14": "EUR 190.00", "2021-10-28": "EUR 190.00"}, "days": "11", "description": "A We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Poland! Warsaw, Poland's capital, has been revitalised as a tourist destination. The city was almost entirely destroyed in World War II but a lot of effort has gone into its rebuilding. Since the fall of communism many old buildings have given way to modern skyscrapers, the dilapidated old town has been brightened up, and entertainment and services transformed to match that of other western capitals.We recommend booking pre tour accommodation or arriving on an early flight so that you can fully enjoy Warsaw and all the city has to offer.There will be a pre departure meeting held in your hotel at 6pm tonight. Please check reception for details.This morning we depart Warsaw and hop on a local train to Kraków. Poland's more famous and cultural city, Kraków has managed to preserve centuries of amazing architecture and artistic traditions as most of the historic buildings and monuments emerged unscathed from World War II.Kraków was the royal capital for 500 years so a must-see is the royal Wawel Castle, a beautiful renaissance palace which now houses a museum. During the evening the cosmopolitan city offers a wild nightlife, with plenty of restaurants, music clubs and bars to explore.We highly recommend taking a guided tour of the famous Wieliczka Salt Mine. The mine produced salt until 2007, making it one of the world's oldest operating salt mines. With underground churches, chandeliers and beautifully made statues (all from salt!) the mine is something special to experience and a highlight of any trip to Kraków.Please Note: The salt mine requires pre-booking. Please advise your tour leader as soon as possible if you wish to take part in this.Please Note: If you wish to visit Oskar Schindler's Factory, pre-booking tickets in advance is essential.Kraków is our base to visit the UNESCO listed Auschwitz-Birkenau German Nazi Concentration and Extermination Camp, a sobering tribute to the people that perished there during the Holocaust. The camp was originally designed for Polish political prisoners but became the most notorious camp of World War II because an estimated 1.6 million people of 27 nationalities, including 1.1 million Jews, 150,000 Poles and 23,000 Roma were killed by the Nazis.You will be collected for your guided tour this morning and return to Kraków mid afternoon to enjoy the remainder of the day.This morning we will return to the station and hop on a train to the charming city of Wroclaw. Brimming with culture, the city was named a UNESCO City of Literature in 2019 after successfully hosting the Theatre Olympics, European Film Awards and being named the World Book Capital back in 2016. Upon arrival you are free to start exploring what is considered one of the prettiest cities in Europe. The beautiful main square encompasses colourful buildings and bars and restaurants, as well as the popular Town Hall which has become one of the main landmarks in the city.This morning we will continue the adventure to Prague. Also known as the City of a Thousand Spires, Prague is one of the most enchanting cities in Europe. Stroll the largest castle complex in Europe, admire the gothic church of St Vitus and watch as the unique Astronomical Clock strikes on the hour.Spend the rest of your day exploring the beautiful city, not forgetting to try one of Prague's tastiest pastries known as 'Trdelnik', a sweet rolled dough in the shape of a cone that is filled with anything from ice-cream to warm chocolate sauce.Prague is a town that loves to party so you may also want to experience the nightlife as there are many great bars and restaurants, as well as plenty of night clubs to enjoy. Czechs have been brewing beer since the 9th century and invented the world's first Pilsner, so Prague offers a great opportunity to sample some of the world's finest beers.You have a full day to enjoy Prague. For something a little unique, take the train to Kutna Hora where you can experience the \"Bone Church\" otherwise known as Sedlec Ossuary. The small Roman Catholic chapel is believed to contain between 40,000 to 70,000 bones which have been arranged in various artistic ways to decorate the chapel. The centrepiece is the huge chandelier of bones that hangs in the middle.Prague is one of the most picturesque cities in Europe, and because of this you can easily pass hours just wandering the narrow streets and checking out the local establishments. The Old Town is bursting with museums, restaurants and ancient architecture.Welcome to Austria!Arriving early afternoon, you will have the rest of the day to start appreciating the city. Vienna is a city worlds away from any other found in Europe. The city's grandeur can be instantly felt as you wander through the centre, admiring the mixture of architecture from Baroque to Roman and Gothic to Art Nouveau.Birthplace of some of the greatest classical musical compositions, Vienna charms with its cultural history and opulent beauty. Known as the city of music, many composers such as Mozart, Beethoven and Strauss were born or worked here and you can learn all about their works in places such as Haus der Musik and Mozarthaus, Mozart's main apartment in Vienna which holds an insight into his celebrated life.Highlights include the Museum quarter, where you can find the Museum of Contemporary Art as well as the renowned Leopold Museum. The complex of the Hofburg Palace is a must see and an experience in itself! This grand building is the former palace of the Habsburg dynasty and today serves as the workplace of the President of Austria. This is where you will also find the world famous Spanish Riding School, where you can opt to book a ticket for tomorrow mornings training session.Today you have the full day to soak up the sights of Vienna. Perhaps you would like to catch a jaw-dropping orchestra performance at the Vienna Philharmonic, or watch a ballet or opera performance at the Wiener Staatsoper? You may also choose to visit the Schloss Schonbrunn, the palace of the Habsburg family, and discover the Baroque grandeur of the Austrian dynasty.Once you have delighted in the culture and beauty of Vienna, there are a host of lively restaurants, cafes and bars to soak up as you watch the world go by in this vibrant city.Departing Austria this morning we take a short ferry ride along the Danube to Bratislava, the capital of Slovakia. Bursting with culture and an urban atmosphere, Slovakia has a modern feel that still manages to captivate the avid traveller through its post-socialist architecture such as the famous 1,400ft UFO Tower and bridge. You will have the day to explore the city, not forgetting to wander along the Danube River and the classic Old Town.After a short train journey we arrive in Budapest, Hungary's stylish capital. It is known as the 'City of Spas' for its abundance of natural thermal springs. To fully explore the city why not book a few extra nights in the city to enjoy some of its sights?Straddling the Danube River, the city is comprised of two very different historic cities, Buda on the west bank and Pest on the east bank. Highlights here include Castle Hill, Matthius Church, Fisherman's Bastion, the Liberation Monument, the fabulous St Stephen's Basilica and the much photographed Parliament Building.Terror Haza (Terror House) is a popular museum recounting stories of espionage and atrocities committed during World War II and during the communist period. During your optional visit you can view very moving testimonial footage from survivors and visit old jail cells, torture chambers and interrogation rooms.The Dohany Street Synagogue is the largest synagogue in Europe and features stunning decorations. You can also wander around Central Market Hall and enjoy the intoxicating sights and smells of'Budapest's pantry' and get an idea of Hungary's food culture - you can even buy chocolates by the kilo!The perfect place to relax after a day of sightseeing is in a traditional bath. The Szechenyi Medicinal Baths are one of the city's more famous Neo Baroque-style baths with indoor and outdoor pools, thermal pools, saunas and massages in a beautiful setting. After a nice soak you can visit numerous restaurants and bars to visit on Liszt Ferenc for an enjoyable evening's entertainment.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/austria_97/vienna_20161118_1245185853.jpg", "countries": "Poland, Czech Republic, Austria, Slovakia, Hungary"}