{"title": "Andes & Coastal Highlights", "link": "https://www.tucantravel.com/tour/andes-and-coastal-highlights/hac/", "dates": {"2020-04-25": "USD 520.00", "2020-05-02": "USD 520.00", "2020-05-09": "USD 520.00", "2020-05-16": "USD 520.00", "2020-05-23": "USD 520.00", "2020-05-30": "USD 520.00", "2020-06-06": "USD 520.00", "2020-06-13": "USD 520.00", "2020-06-20": "USD 520.00", "2020-06-27": "USD 520.00", "2020-07-04": "USD 520.00", "2020-07-11": "USD 520.00", "2020-07-18": "USD 520.00", "2020-07-25": "USD 520.00", "2020-08-01": "USD 520.00", "2020-08-08": "USD 520.00", "2020-08-15": "USD 520.00", "2020-08-22": "USD 520.00", "2020-08-29": "USD 520.00", "2020-09-05": "USD 520.00", "2020-09-12": "USD 520.00", "2020-09-19": "USD 520.00", "2020-09-26": "USD 520.00", "2020-10-03": "USD 520.00", "2020-10-10": "USD 520.00", "2020-10-17": "USD 520.00", "2020-10-24": "USD 520.00", "2020-10-31": "USD 520.00", "2020-11-07": "USD 520.00", "2020-11-14": "USD 520.00", "2020-11-21": "USD 520.00", "2020-11-28": "USD 520.00", "2020-12-05": "USD 520.00", "2020-12-12": "USD 520.00", "2020-12-19": "USD 520.00", "2020-12-26": "USD 520.00", "2021-01-02": "USD 550.00", "2021-01-12": "USD 550.00", "2021-01-16": "USD 550.00", "2021-01-23": "USD 550.00", "2021-01-30": "USD 550.00", "2021-02-06": "USD 550.00", "2021-02-13": "USD 550.00", "2021-02-20": "USD 550.00", "2021-02-27": "USD 550.00", "2021-03-06": "USD 550.00", "2021-03-13": "USD 550.00", "2021-03-20": "USD 550.00", "2021-03-27": "USD 550.00", "2021-04-03": "USD 550.00", "2021-04-10": "USD 550.00", "2021-04-17": "USD 550.00", "2021-04-24": "USD 550.00"}, "days": "21", "description": "T We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Peru! Your adventure starts here in Lima and you are free to arrive today at your leisure.Lima was founded by the Spanish Conquistador Francisco Pizarro in 1535 after he eradicated the Incas and made the city his capital. The city has many beautiful colonial buildings and some of the best museums in South America including the Gold Museum, Museum of the Inquisition and the Catacombs below the San Francisco Church.Peru's capital has much to offer and many of the sights, including the city's two main squares the Plaza de Armas and Plaza San Martin, boast some fantastic sightseeing opportunities. The Plaza de Armas houses the Cathedral, Municipal Palace and Presidential Palace where the changing of the guard can be seen every day at 12 noon.Another highlight of Lima is the Huaca Pucllana, ruins of a pre-Incan pyramid. The clay structure, built in seven staggered levels is one of the few that remain from the historic pre-Colombian period in Peru. It is thought to have been built around 500 AD and would have been used for spiritual ceremonies. Located in the Miraflores district, it's surprisingly very easy to get it!Of course you should also spend time sampling some delicious local Peruvian food. For a breakdown of the best food in Peru and where to eat in Lima, click hereNo trip to Peru would be complete without a visit to what is considered the most biodiverse place on earth, the lush and beautiful Amazon rainforest. Covering nearly two thirds of the country, the area is home to around 600 species of birds, 1200 types of butterflies and 300 reptiles, to name a few. As eco-tourism continues to grow, there are a number of eco lodges allowing you to experience the rainforest in the most responsible and authentic way possible.We will transfer to the airport for our flight to the jungle community of Puerto Maldonado, the starting point for our visit to the Amazon rainforest. Here you can pick up last minute drinks and snacks before the group continue with a short bus ride followed by riverboat journey to reach the accommodation for the night. Sailing along the river, the trip takes around 2 hours and is an excellent chance to relax and start to take in the magic of the rainforest.Arriving at your riverside lodge, check in and have some time to relax before an afternoon of exploring. After lunch we will set off on a trek through the rainforest along wooden walkways. On the way our guide will stop to show you various species of bird and explain the medicinal plants and delicate ecological systems of the Amazon Jungle. The scenery is extremely varied incorporating dense jungle as well as marsh areas. You will see incredibly big trees, several metres in diameter and around 450 years old. We walk to Cochita Caiman (Caiman Pond) where we see wildlife along the way. We then return to the lodge for dinner.Please note: The eco-lodges in the Amazon jungle are designed to give travellers the most authentic jungle experience while limiting disruption to the animals and plantlife. The bungalows are built from local indigenous materials with the rooms sealed by mesh netting to keep mosquitoes out. All rooms have private bathroom facilities however these are basic and hot water can be limited. There is portable water available at the lodge therefore we recommend taking a reusable water bottle with you. Electricity is limited and it is advisable to bring portable chargers for your electronics and ensure they are fully charged. After dark, the walkways are lit by oil lamps. The lodges include a welcome area, dining room and bar, meaning there are plenty areas for your group to relax and socialise. Single supplements are not available in the bungalows. If you have further questions on what to expect, your tour leader will be happy to assist. All excursions in the jungle are led by an English speaking guide.After an early breakfast we hike deeper in to the jungle, enjoying the surroundings and exploring the delights and hidden wonders of the Amazon Rainforest. We may also catch a glimpse of the rare giant otter. Afterwards we will enjoy the view of the lake from our viewing point/observation platform, where you can experience the canopy wildlife such as parrots, guacamayos, toucans, camungos, shanshos, herons, turtles and caiman. We will return to the lodge for a well deserved lunch.After a break and some yummy food, we take a short boat trip across the Madre de Dios River to Monkey Island. On the way over you may spot caiman from the boat. Once on the island it is possible to see a great variety of monkeys such as the ‘maquisapa’, black and white ‘Martins’, ‘Leoncito de la Selva’ (Little Lions), ‘Frailes’ (Friars), ‘Achuñis’, ‘Ronsocos’ as well as an array of birdlife. In the evenings it is often possible to enjoy the wonderful sunset, one of the most impressive sights of the forest (weather permitting).Enjoy your final night in the heart of the jungle soaking up this magical and peaceful atmosphere.On the final day we awake to the sounds of the jungle before departing this jungle haven and returning to Puerto Maldonado for our flight on to Cusco, where you have the rest of the day free to explore this fascinating ancient capital.A full day is spent visiting the Sacred Valley of the Incas. At an altitude of 3800m we take slow walks that take up to an hour, around each of the ruins in order to manage any effects the high altitude may have. Firstly we visit the Pisac ruins, perched on a hilltop with incredible views of the surrounding mountains. We then go down to the famous traditional market of the same name, which is full of colour and atmosphere. A great place for souvenirs! After lunch, we continue along the valley to the temple/fortress of Ollantaytambo with its enormous Inca terracing constructed on the side of a steep mountain.If you are doing the Inca Trek to Machu Picchu, tonight you will stay in Ollantaytambo.Having stayed overnight in Ollantaytambo, it means we have a short bus ride to the starting point of the trek. The first day is a relatively easy 4½ hour and 13 kilometre walk. With mostly flat and light climbs, you start to witness the lush scenery of Peru. Walking slowly, you will have plenty of short breaks to ensure the group are acclimatising to the altitude.The Inca Trail Trek can be demanding but can be completed by anyone who leads a reasonably active life - you certainly don’t need to be an athlete. Everyone is able to walk at their own pace and there is no rush to finish. The trekking group is led by an expert local guide and supported by a team of porters and cooks, leaving you with only a small day pack to carry. If you are in any doubt or if you have any condition that may affect your ability to trek, we advise that you consult your doctor.Please Note: Due to a limited number of people being allowed on the trail a day, permits are limited and can sell out far in advance. If you wish to book the Inca Trail, please provide your Reservations Agent with your passport details by email as soon as possible so that we can secure your permit. Without your passport details, we are unable to arrange your Inca Trail Trek. Alternatively you can opt to participate in the challenging but rewarding 1 day Inca trek. Please speak to one of our travel consultants for more information or you can read more about it here. If you are not participating in either trek then you will visit Machu Picchu by train and then have plenty of free time to enjoy the activities available in and around Cusco. Meals are included for those doing the Inca Trail Trek. If you are choosing not to do the Inca Trail Trek, you will have 2-3 days to spend exploring Cusco.Today is the biggest challenge on the trek as you reach the highest pass at Warmiwañusca, also known as Dead Woman’s Pass! Sitting at 4,200 metres, it is nearly 1,800 metres higher than Machu Picchu itself. The terrain here is slightly more rockier and due to open area, trekkers are more exposed to the elements, whether it’s the rain lashing down or the sun blazing down! However it can be said that traversing this part of the trail is the second most rewarding part, just after seeing Machu Picchu itself.You will cover approximately nine kilometres in about 5-7 hours and after the high pass it's all downhill as the trail winds its way along old Inca stairs to our campsite.Today you will cover the most distance, at 15 kilometres you will walk for around 7 hours. While being the longest day, it is also the most interesting as you pass more ruins and unique sites. After roughly one hour of trekking you will come to the ruins of Runkurakay, a small circular shaped archaeological site. It has been said this site was most likely used as resting point for the Inca messengers, who maintained communication across the Inca Empire.From this point, it is mostly downhill, and we have four more ruin sites to be discovered, with the next being Sayacmarca. Also known to historians as the “inaccessible town” due to it being barricaded on three sides with steep mountain drop offs, archaeologists remain baffled as to what the site was used for. Some say it was a viewing and control point for those headed to Machu Picchu.We continue onto Phuyupatamarca where you can enjoy some amazing views from the top. The Quechua translation being “town in the clouds” it offers some great photo opportunities and is often used as a lunch spot for groups.On the last morning of the Inca Trail Trek, after an overnight stop at Wiñay-Wayna, you will rise early for the final walk to Machu Picchu and greet daybreak over the famous “Sun Gate”. There will then be time to explore on your own or simply take in the magnificence of the place after your guided tour.The Lost City of Machu Picchu was originally completely self-contained, surrounded by agricultural terraces sufficient to feed the population, and watered by natural springs. Located high above the fast flowing Urubamba River, the cloud shrouded ruins have palaces, baths, temples, storage rooms and some 150 houses, all in a remarkable state of preservation that will simply take your breath away.The ruins were only discovered by the outside world in 1911, when American explorer Hiram Bingham found them while looking for another “lost city” called Vilcabamba. Due to their isolation many of the buildings are still quite intact and you can't help but admire Huayna Picchu (“Young Mountain”), which towers above the ruins.After spending most of the day at Machu Picchu you have the chance to meander through the markets of Aguas Calientes before enjoying a scenic train ride back to the Sacred Valley where our transfer to Cusco will be waiting.After a packed few days you'll probably want some rest time and that's exactly what today is all about. The day is free for you to relax and unwind, or explore more of Cusco at your own pace.The oldest continuously inhabited city in South America, Cusco was the hub of the Incan Empire and features a population of around 300,000, most of who are indigenous. This marvellous colonial city is situated 3,310 metres above sea level and has numerous churches, some of which were built using recycled Inca masonry, as were many other buildings in Cusco. The main square is called the Plaza de Armas, which has the beautiful cathedral on one side, which took a century to build, and the Church of La Compañia de Jesus on the other. The colonial arcades, which occupy the remainder of the plaza, are full of restaurants and shops. If you're in the mood for a cultural experience, take a peek inside the 14th-century Inca palace which was later converted into the city's Museo de Arte Religioso (Museum of Religious Art). Well worth exploring during your time here is the ancient archaeological site of Sacsayhuaman, which has the largest and most impressive Inca stonework of all.If that all sounds a bit much, the city boasts some great markets, the most well-known being San Pedro where all kinds of textiles and artisan merchandise are sold, and you can enjoy a fresh fruit juice made by one of the welcoming locals. Or you can simply enjoy wandering the cobbled streets, enjoy a cup of coca tea in a local café and soak up the friendly atmosphere.Leaving Cusco, we'll drive along roads abundant with herds of llamas, alpacas and vicuñas before reaching the Altiplano (high plain) where our journey takes us past hot mineral pools, snow capped mountains and through villages where the locals sell food, fur hats and alpaca sweaters.The beautiful scenery is continual all the way to Puno on the shores of Lake Titicaca, which at 3,855 metres above sea level, is the highest navigable lake in the world.Today we take a day trip to the traditional and enthralling Lake Titicaca. Not only is it the largest lake in South America, it sits at 3,800 meters above sea level making it the highest navigable body of water on earth. Crystal blue waters compliment the bright yellow grass reeds used to construct the homes and boats floating upon it, while the traditional clothing simply adds to the beauty and colour of the place. While the lake tends to be overshadowed by its biodiverse and world famous neighbour the Amazon jungle, there exists over 500 aquatic species here and many various birds.First we visit the floating reed islands in the Bay of Puno to see the Uros islanders way of life and we will have the option to ride in a traditional reed boat.Next stop is Taquile Island, an island on Lake Titicaca still holding up many of the traditions values and customs it was built on. Learn about the way of life, from the reasons for why they do their hair the way they do and how they dress. Famous for their textiles and clothing, you will be able to pick up a homemade gift or two from the main square.We will return to Puno for the evening.We journey by public bus into La Paz which is built in a steep valley that protects the city from the harsh elements of the Altiplano. Just about every building in La Paz is built on some sort of hill, so sightseeing will literally take your breath away! You will have time to explore La Paz and it's bustling atmosphere. Our hotel is very centrally located and is just around the corner from the city's colourful indigenous street markets including the fascinating and suitably named ?Witches Market'? where local women in traditional 'Cholita' dress sell such items as dead cats and llamas foetuses said to ward off evil spirits. The main square, Plaza Murillo, is also within walking distance. The square still retains its colonial buildings including the Presidential Palace.Today is a free day to enjoy the sights and sounds of La Paz. For a cheap thrill and a birds eye view of the expansive city why not hop on the Telef&#233;rico, the most extensive urban transport project in the world!We fly from La Paz to Uyuni, in the South West corner of Bolivia. If it is a clear day, you will be able to see the huge expanse of the Altiplano as you fly over the landlocked country, perhaps seeing the Andes slowly flattening out to become the Amazonian basin, which spreads to the far East of the country, to the border with Brazil.Arriving in the early evening you will have time to relax before the exciting 4WD tour to the Salar de Uyuni tomorrow.Please note: During the winter months of May-August temperatures of the Altiplano can be extremely cold, so please be prepared and pack warm clothesThis morning we embark on an exhilarating 4WD tour to explore the Salar de Uyuni and the striking landscapes that surround it. First on the agenda is a visit to the Train Cemetery, where you can see the remains of 19th and early 20th century steam locomotives - a good place for artistic photographs. We will then come to Colchani, the main plant for the iodisation of salt and the best place to observe the methods of salt extraction from the salar. Here ovens are used to dry the salt, which is then formed into cakes. From here we drive onto the Salt Flats themselves. Claimed to be the largest salt flat in the world, the brilliant white vast Salar de Uyuní, which covers some 10,500 square kilometres and is estimated to contain 10 billion tons of salt, looks like something from a surrealist painting and its seemingly infinite horizons will amaze you. You will then visit either Fish Island or Incahuasi Island (seasonal dependent). Located in the centre of the Salar, 100 kilometres from Uyuní, this hilly outpost is covered in giant cacti amid a flat, white sea of hexagonal salt tiles.The otherworldly views from the islands will take your breath away, with the brilliant blue sky (weather permitting of course) contrasting with the pure white of the salt flats.Please Note: Occasionally in the rainy season the salt flats become overly flooded and we may have to alter the itinerary if the salt flats are not safe to traverse. Your tour leader will advise as early as possible if this is likely to happen on your tour.Please Note:The accommodation here is basic with limited facilities. Please see your tour notes for further details.We continue south on our epic 4WD expedition, into some of the most remote areas of the Bolivian Altiplano. You will see a variety of dramatic landscapes including smoking volcanoes, barren deserts and gravity-defying rock formations carved by the wind. In this incredibly empty landscape you'll most likely feel the furthest from civilisation you've ever been. You will visit  a number of lagoons including Cañapa, Chairkota and Laguna Honda. You will also get to see the Laguna Colorada, which offers some truly breathtaking scenery, with several varieties of flamingos gathering in the shallow waters of the beautiful crimson lagoon. Before arriving at Laguna Colorada you will pass Arbol de Piedra, the famous Stone Tree.Please Note:The temperatures can get very cold and often drop below zero when crossing the Bolivian Altiplano, especially the winter months from May to September. You may wish to bring a sleeping bag if traveling in the winter months. A sleeping bag can also be rented from your Tour Leader for 70 Bolivian Bolivianos. Also note that on occasion in winter snow can cause the itinerary to be altered at short notice.Please Note:The accommodation here is basic with limited facilities. Please see your tour notes for further details.Today we leave Bolivia behind and head for Chile. We make our way to San Pedro de Atacama, making a few stops on the way. We visit the volcanic zone ‘Sol de Mañana' (Morning Sun) at 4,850 metres above sea level. Here you'll discover a geyser basin with bubbling mud pots, hellish fumaroles and a thick aroma of sulphur fumes. Inside a small crater we will observe mud bubbling away and we will also stop at hot springs where you can bathe. We will pass the Desert of Salvador Dali before crossing a 5,000 metre pass. We then come to the beautiful Laguna Verde, which is shadowed by the cone of the Licancabur Volcano. Next to Laguna Verde is Laguna Blanca, known as the White Lake. Continuing on we will cross into Chile. On the way we get the chance to see both the Bolivian and Chilean sides of the 5960m Licancabur Volcano.We then come to San Pedro de Atacama in the world's driest desert. The area is famous for the salt-covered lunar landscapes, geysers, salt flats and hot springs of the Valley of the Moon, which we will explore by van tomorrow.Please Note: Upon exiting Bolivia you will be required to pay a small fee of 20 Bolivianos.San Pedro de Atacama is a picturesque small town that looks like it has come straight from the scene of a Western with its single-storey buildings, white-washed walls and dusty roads. Due to its remote location and dry climate, the Atacama desert offers some of the clearest skies in the world and as such is used by international space agencies to monitor the skies. If you are lucky enough to have clear nights during your stay in San Pedro de Atacama, the starscape will most likely be the best you'll ever see.Today we enjoy an excursion to the Valley of the Moon. The various stone formations have been formed by the wind and rain over time, resulting in unique and interesting shapes, similar to the surface of the moon. In fact, it is said a prototype of the Mars rover was tested in the area!We fly to the sprawling metropolis of Santiago. If it is a clear day, you will have astounding views of the capital and the surrounding mountains as you come in to land. You are free to explore this cosmopolitan city at your own pace.For the best views of the city, take a funicular railway to the top of San Cristobal where the Statue of the Virgin overlooks the capital and the distant Andes. Here you can taste some of Chile's best wines and find some beautifully situated swimming pools. Santiago is a very clean, modern city with many fountains and parks, and is well-renowned for its markets such as the famous Mercado Central, one of the best seafood markets in the world. In the Plaza Constitución at the Palacio de la Moneda you can see the changing of the guard on most days.Please Note: Breakfast is not included on the morning we depart to Santiago, as we leave early to maximise our time in the city.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/peru_7/peru_amazon_boat_20161111_1130731654.jpg", "countries": "Peru, Bolivia, Chile"}