{"title": "Bangkok to Singapore", "link": "https://www.tucantravel.com/tour/bangkok-to-singapore/icbs/", "dates": {"2020-07-25": "USD 170.00", "2020-08-22": "USD 170.00", "2020-09-19": "USD 170.00", "2020-10-17": "USD 170.00", "2020-11-14": "USD 170.00", "2020-12-12": "USD 170.00", "2021-01-09": "USD 180.00", "2021-02-06": "USD 180.00", "2021-03-06": "USD 180.00", "2021-04-03": "USD 180.00", "2021-05-01": "USD 180.00", "2021-05-29": "USD 180.00", "2021-06-26": "USD 180.00", "2021-07-24": "USD 180.00", "2021-08-21": "USD 180.00", "2021-09-18": "USD 180.00", "2021-10-16": "USD 180.00", "2021-11-13": "USD 180.00", "2021-12-11": "USD 180.00"}, "days": "15", "description": "S We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Bangkok and the start of your South East Asian adventure. This loud, vibrant and tantalizing city is the centre of economics in Thailand and is seen as the gateway to South East Asia for most travellers.Today you are free to arrive at your leisure and enjoy the various activities in the city. We highly recommend booking pre tour accommodation to maximise your time here.One of the biggest highlights of the city and a must see is the opulent Grand Palace, which was built in 1782 and was home of the Thai King for over 150 years. The palace complex has several impressive buildings such as the Temple of the Emerald Buddha. Just walking around this vast area will give you an idea of the spectacular Thai architecture and vibrant colours. Another must see is the temple of Wat Pho, which houses the impressive reclining Buddha. The position of the Buddha represents entry into Nirvana and the end of reincarnations and is an important symbol for Thai people.Today you can also visit the famous Chatuchak Weekend Market, Bangkok's largest market which is also said to be the largest in the world. There are over 15,000 stalls offering anything and everything that you could dream of. Mingle with the locals and immerse yourself in the bustle of vendors and shoppers going about their daily lives.Tonight you will have a pre departure meeting to meet your tour leader and group. Please check reception for details and timings.Please note that unless you have extended your room, check out will be at 11am. Luggage storage is available at the hotel while you head out for the day.This morning we enjoy a short riverboat trip experiencing a different perspective of the Bangkok skyline. We disembark at Wat Pho and visit the famous reclining Buddha.Spend today ticking off any last must do activities in Bangkok. Pick up some last minute souvenirs at the market or wander around Chinatown. If you wish to enjoy an air conditioned shopping experience, check out Terminal 21, located on Sukhumvit Road. This 9 storey shopping mall is designed after an airport terminal with each floor representing a theme of a different country. The ground floor also has a food court, with local and international cuisines. On the top floor you can find a cinema showing both English and Thai movies.In the early evening we will meet our group and tour leader back at the hotel and head to the train station for the overnight train to southern Thailand!Arriving to the train station early in the morning we will then take a minivan towards Khao Sok National Park, driving for a further three hours to reach our hotel. Staying nearby you have the chance to visit the national park and tropical rainforest, which is older than the Amazon Jungle. The area of Khao Sok National Park is an incredible 739 square kilometres, including the 165 square kilometre Cheow Lan Lake. The park is the most biodiverse jungle in Thailand and as well as holding many wild animals has an amazing array of flora and fauna, as well as various bird species. Mammals found in the rainforest include the tapir, Asian elephant, sambar deer, wild boar, white handed gibbons and bears.The landscapes are beautiful, with lush jungle complimented with breath-taking limestone cliffs and hidden waterfalls. It is also home to the rare Rafflesia Kerrii, the world's largest flower. Khao Sok is the only place in Thailand to find it.After an orientation of the surrounding area you are free to explore the park or simply wander around the breathtaking area. While the area is rural and tranquil, there are various restaurants and hotels in the area serving fresh and good quality local food.Spend today enjoying the rainforest and everything on offer in the area. The lake is a popular base for many activities including kayaking, canoeing and bamboo rafting. The views from the water are stunning as you pass limestone cliffs and see various fish swimming below.For those who enjoy hiking there are various paths around the park to follow, many of which lead to beautiful waterfalls. A great way to experience this is to hire a local guide who can talk you through the animals that live in the area and show you the best places to see in the rainforest.Caves in the area, such as Diamond Cave, Khang Cow Cave and Nam Talu Cave, all connect to the lake and can be explored on a boat trip.This morning we leave behind the rainforest for a different type of scenery just as spectacular; the beaches of Phuket. Thailand's largest island, Phuket offers some of the country's most popular beaches and is located close to popular islands including James Bond Island (Khao Phing Kan) or Racha Island (Ko Racha Yai) famed for its diving and snorkelling.We hop on a private minibus and travel for around three hours to reach our hotel in Phuket. The rest of the afternoon is free to start enjoying the sunshine filled beaches and glistening waters. The hardest decision of today will be whether you snorkel or paddle board first!Phuket comes alive at night with various restaurants, bars and live music venues. From all night laser nightclubs to laid back beach bars, there is something for every taste and every budget on the island. The food choices are endless, you could enjoy the fresh seafood on offer or the various small eateries serving up typical Thai dishes. Your tour leader will be able to recommend the best ones.Spend today soaking up the beauty of Phuket and the surrounding islands. Thailand's famed islands have been the set for many films over the years and hold a certain mystique. Take a boat trip and explore as many as your heart desires or snorkel around the bays amongst stunning exotic fish and other marine animals.Of course beaches and islands are not to everyone's taste, so why not visit the historical Old Phuket Town, small enough to stroll around but with an abundance of differing cultural histories. See the Big Buddha, a white, 45 metre tall effigy of Buddha with 360 degree views of the island. Wat Chalong is one of the most significant temples on the island and is beautifully decorated with many shimmering pieces on the pagodas.This morning is free to get some extra hours in bed or make for the beach to enjoy a last swim. Just before lunchtime we head to the airport and make our way to Penang, Malaysia.We will stay in Georgetown, which is the island's capital and a UNESCO World Heritage Site. Georgetown possesses a unique charm, blending old and new cultures. Peddlers exhibit their goods surrounded by modern buildings. Old buildings stand side-by-side with new businesses. Take a rickshaw tour and introduce yourself to this lively town or perhaps visit the 65-storey Kompleks Tun Abdul Razak (KOMTAR), a prominent Penang landmark, which houses Government departments, commercial offices, department stores, shops and restaurants.This morning we enjoy an included local heritage walk, a route which passes by some of the best and most visited sights in Georgetown. On this tour we will visit the Chocolate House, Cheong Fatt Tze Mansion, the Bengali Mosque, Assumption Cathedral, St. George?s Church, City Hall and Town Hall (two wonderfully old Colonial administrative buildings) Fort Cornwallis and the War Memorial, Queen Victoria's Clock, the Financial District, Little India, Chinese Clan Jetties, Malay Mosque, Khoo Kongsi Clan House, Yap Kongsi Temple, Armenian Street and finally the Kapitan Keling Mosque before heading back to the hotel for a well earned rest. Phew!The rest of the day is free to enjoy other highlights of Penang. Famous for it?s delicious cuisine, wander around and sample everything from ice kacang to nasi lemak.Named after William Cameron, a British colonial government surveyor who discovered the plateau in 1885, the Cameron Highlands is a region around 1500 metres above sea level. This morning we hop on a local bus and journey for around four hours to reach this gem of Malaysia.With so much to see, we spend this afternoon on an included excursion to showcase all the highlights of the region. We explore the Boh Tea Plantation, strawberry farms, rose gardens, a Chinese temple and vegetable farms. The region's fertile mountain slopes make it one of the best places in the country to grow tea, and there are many tea plantations. The Cameron Highlands is also a major supplier of vegetables to Malaysia and Singapore.This morning we walk to the bus stop and hop aboard for a five hour journey to Kuala Lumpur. Malaysia's diverse and vibrant capital city, KL (as it is commonly known) is a melting pot of tradition and modernities. From temples and markets to skyscrapers and rooftop bars, KL has an abundance of incredible sites and activities.The skyline of Kuala Lumpur is dominated by the impressive Petronas Twin Towers, standing at over 450 meters with 88 stories. A skybridge links the two towers on the 41st and 42nd floors, offering incredible city views of the surrounding area. Tonight we will enjoy an evening visit to view the towers under darkness, where they light up and glisten in the night sky. We also experience the fountain light show in KLCC Park, where the towers are located.This morning we head to the magical Batu caves and temple located a short train ride from the city centre. An important religious site located inside the limestone caves and rising 100 meters above ground level, the temples and caves are used for many Hindu festivals and pilgrimages The caves are dominated by the 42.7 meter high golden statue of Lord Murugan, a Hindu God, looking out over the city and appearing to guard the caves entrance. A steep 272 steps will then take you into the caves where you get some incredible views of the city skyline, and watch out for the monkeys frolicking around the area too!The remainder of the day is free to enjoy more of the city. Pay a visit Berjaya Times Square and marvel at the incredible indoor roller-coaster, not to mention the more than 1000 shops and restaurants spread over its more than 10 floors. You could take a short taxi ride to watch the Changing of the Guards at the Royal Palace (Istana Negara) or visit the huge Masjid Negara (National Mosque of Malaysia).We then head to one of Malaysia's most popular destinations, Melaka. Historically famous for its importance as a trading port and it's commanding location on the strategic Straits of Malacca, it was also one of the most important shipping lanes in the world linking the Indian and Pacific Oceans.Ruled in the past by the British, Dutch, Portuguese and finally Malaysia, Melaka is now a wonderful town centered around the beautiful red buildings of the Stadthuys and Dutch Square (Red Square). In 2008 the town was declared a World Heritage Site.Whether you choose to take an evening river cruise, stroll along the famous 'Jonkers' Street or the aptly nicknamed 'Harmony Street' known for its unbridled harmony of religions and cultures located along its path, Melaka is a wonderful town to wander around. You could visit the many interesting museums including the Maritime Museum built in the shape of a ship, or learn about the local history of the Chinese-Malays.Tonight we enjoy a rickshaw tour around the streets of Melaka. Adorned with flowers and more lights than a Christmas tree, often playing local or Bollywood Pop music these rickshaws are fun, crazy and a must do while in Melaka.Today is a free day to continue exploring the coastal city of Melaka.For those of you who enjoy exploring on two wheels you could hire a bike and cycle the town, experiencing the unique blend of colonial buildings, mosques and Buddhist temples. Cycling round every corner, you never know what you will find. Search out Cheng Hoon Teng Chinese Temple, which is the oldest of its kind in Malaysia.Shop 'til you drop at the nearby shopping malls close to the hotel or unwind with a film at one of three English speaking Cinema multiplex. In the evening take advantage of a relaxing river cruise along the Melaka river as you pass through lighted bridges and past the bright lights of the city.This morning we board a comfortable tourist bus and travel for around four hours to reach Singapore.After check in, we enjoy a walking tour to Clarke Quay, Merlion Park, Marina Bay and the Raffles Hotel. Marina Bay is somewhat of an icon of Singapore - boasting the cities best hotels, skyscrapers and attractions.Like any major city, the shopping is excellent here, whether it be high end designer shopping along the world famous Orchard Road, seeking those authentic spices in Little India or checking out the bargains in Chinatown, the history and multi-cultural infrastructure of Singapore means you can eat and shop till you drop.Singapore restaurants are not the cheapest you will come across in South East Asia but if you also hit some of the market food stalls or the hawker centres you are sure to delight in an amazing selection of fresh, scrumptious food. In fact, Singapore was the first place to have its street food stalls listed in the Michelin restaurant guide!Other must-sees in Singapore include the ArtScience Museum, Singapore Botanic Gardens, Gardens by the Bay and the impressive Kampong Glam.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/malaysia_133/tea-plantations-in-cameron-highlands-malaysia_20161214_1474814887.jpg", "countries": "Thailand, Malaysia, Singapore"}