{"title": "Thailand in a week", "link": "https://www.tucantravel.com/tour/thailand-in-a-week/ict1/", "dates": {"2020-07-19": "USD 110.00", "2020-08-16": "USD 110.00", "2020-09-13": "USD 110.00", "2020-10-11": "USD 110.00", "2020-11-08": "USD 110.00", "2020-12-06": "USD 110.00", "2021-01-03": "USD 120.00", "2021-01-31": "USD 120.00", "2021-02-28": "USD 120.00", "2021-03-28": "USD 120.00", "2021-04-25": "USD 120.00", "2021-05-23": "USD 120.00", "2021-06-20": "USD 120.00", "2021-07-18": "USD 120.00", "2021-08-15": "USD 120.00", "2021-09-12": "USD 120.00", "2021-10-10": "USD 120.00", "2021-11-07": "USD 120.00", "2021-12-05": "USD 120.00"}, "days": "7", "description": "I We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Thailand and the Rose of the North otherwise known as Chiang Mai. A vibrant and bustling city, Chiang Mai is renowned for its temples and unique old city.You are free to arrive at your leisure and start exploring this wonderful city. Visit Doi Suthep, located about 12 km outside the city that has fantastic views of the surrounding area. The mountain is also home to a 13th century temple and replica of the Emerald Buddha.Take a stroll down San Kamphaeng Road, also known as the Handicraft Highway due its pottery, wood carving and silk products. This area is also well known for selling Celadon, a type of pottery that has a green glaze making it look almost like jade. Some of the finest silversmiths in Thailand also sell their work here, so keep an eye out for some unique jewellery.Tonight you will have a pre departure meeting at 6pm to meet your tour leader and group.Today is free to enjoy the city and its host of activities. Learn the secrets of Thai cuisine on a cooking course, indulge in a relaxing massage in some of the best spas in the country or take in a night time Muay Thai match. Chiang Mai is also home to a dazzling night bazaar where you can sample street food and browse the large selection of crafts, clothing and art.Northern Thailand is famous for having amazing food and there will be plenty local delicacies to sample. Try the Khao Soi, a coconut and curry soup filled with egg noodles and topped with crispy noodles.This morning we travel to our next destination, the ancient and golden city of Sukhothai.A UNESCO World Heritage City, Sukhothai is home to various temples and other historical sites. The Sukhothai Kingdom, which ruled from around the 12th to the 14th century, is known as the birthplace is Thai civilisation, and where Thai art and language have their origins.Tomorrow we will enjoy a bike tour of the Historical Park and it's sites, so the rest of today gives the perfect opportunity to relax and perhaps sample some of the food on offer. Check out the markets and try one of the beloved dishes, such as the Sukhothai noodles, a style of rice noodle soup which is popular in the area.Sukhothai is a wonderful place to soak up Thai history and tradition, and today we do just that in the Historical Park. It has over 200 ancient sites to be explored, including temples, ruins, statues and other religious symbols. We depart just after breakfast while the weather is still cooler, with the opportunity to stop for ice cream on route.A must see in the park is the Wat Si Chum, which is home to what is said to be Thailand's most beautiful Buddha statues. Wat Saphan Hin, due its elevated position, offers views of the surrounding area and the 11 meter tall Buddha found here was once a favourite spot for royalty to worship.This morning we hop on a local train and head for Bangkok which is your final destination on tour.One of the biggest highlights of the city and a must see is the opulent Grand Palace, which was built in 1782 and was home of the Thai King for over 150 years. The palace complex has several impressive buildings such as the Temple of the Emerald Buddha. Just walking around this vast area will give you an idea of the spectacular Thai architecture and vibrant colours. Another must see is the temple of Wat Pho, which houses the impressive reclining Buddha. The position of the Buddha represents entry into Nirvana and the end of reincarnations and is an important symbol for Thai people.Perhaps spend time soaking up the culture and art scene in one of the many museums dotted around the city. For history buffs, you could easily spend hours soaking up the information in the National Museum, which was Thailand's only museum until the mid 1970?s and has a large and very impressive collection. The Bangkok Art and Culture Centre is a work of art in itself, and you can explore the exhibits which range from photographs to paintings. The Tonson Gallery is excellent for those interested in contemporary art, while the Baan Kamthieng House Museum is perfect for learning more about rural life in Thailand.For some of the most impressive city skylines, Bangkok has a huge host of rooftop bars waiting to be enjoyed. For some luxury, head to the ones located in Sukhumvit. You can also enjoy city views by walking to the top of Phu Khao Thong, or The Golden Mountain. The area is a small jungle oasis in the centre of Bangkok and perfect if you need away from the hustle and bustle of the city.This morning we enjoy a short riverboat trip experiencing a different perspective of the Bangkok skyline. We disembark at Wat Pho and visit the famous reclining Buddha.If you have booked post tour accommodation, tomorrow you can also visit the famous Chatuchak Weekend Market, Bangkok's largest market which is also said to be the largest in the world. There are over 15,000 stalls offering anything and everything that you could dream of. Mingle with the locals and immerse yourself in the bustle of vendors and shoppers going about their daily lives.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/thailand_159/thailand_sukhothai_historical_park_20161111_1363553626.jpg", "countries": "Thailand"}