{"title": "Vietnam Highlights", "link": "https://www.tucantravel.com/tour/vietnam-highlights/icvh/", "dates": {"2020-07-04": "USD 120.00", "2020-07-18": "USD 120.00", "2020-08-01": "USD 120.00", "2020-08-15": "USD 120.00", "2020-08-29": "USD 120.00", "2020-09-12": "USD 120.00", "2020-09-26": "USD 120.00", "2020-10-10": "USD 120.00", "2020-10-24": "USD 120.00", "2020-11-07": "USD 120.00", "2020-11-21": "USD 120.00", "2020-12-05": "USD 120.00", "2020-12-19": "USD 120.00", "2021-01-02": "USD 130.00", "2021-01-16": "USD 130.00", "2021-01-30": "USD 130.00", "2021-02-13": "USD 130.00", "2021-02-27": "USD 130.00", "2021-03-13": "USD 130.00", "2021-03-27": "USD 130.00", "2021-04-10": "USD 130.00", "2021-04-24": "USD 130.00", "2021-05-08": "USD 130.00", "2021-05-22": "USD 130.00", "2021-06-05": "USD 130.00", "2021-06-19": "USD 130.00", "2021-07-03": "USD 130.00", "2021-07-17": "USD 130.00", "2021-07-31": "USD 130.00", "2021-08-14": "USD 130.00", "2021-08-28": "USD 130.00", "2021-09-11": "USD 130.00", "2021-09-25": "USD 130.00", "2021-10-09": "USD 130.00", "2021-10-23": "USD 130.00", "2021-11-06": "USD 130.00", "2021-11-20": "USD 130.00", "2021-12-04": "USD 130.00", "2021-12-18": "USD 130.00"}, "days": "8", "description": "W We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.The bustling city of Ho Chi Minh is the former capital of South Vietnam. Formerly known as Saigon until the end of the Vietnam War (around 1975) and the infamous ‘Fall of Saigon”,the city was then renamed after North Vietnam’s illustrious and revered leader Ho Chi Minh. Originally a small fishing village, it is now the most important economic centre in Vietnam and is the largest city in the country.Today is free to arrive at your leisure. We recommend arriving early or booking pre tour accommodation to enjoy all Ho Chi Minh city has to offer. Spend hours wandering and haggling in Ben Thanh Market or visit the beautiful Opera House and Notre Dame Cathedral.Learn about the sobering stories of the Vietnam War in the War Remnants Museum, or get a glimpse of the art scene at the City Museum of Fine Arts. There are plenty of lesser known museums dotted around the city, including the South Vietnamese Women Museum which provides interesting insight into the role women played during and after the war.For something a little unique, check out the cafe apartments on Nguyen Hue Walking Street. Originally serving as residence for government officials, the apartments were then sold to local workers after the Fall of Saigon. As tourism developed, tenants began renting out or transforming the tiny apartments into various businesses - cafes, boutiques, tattoo studios and restaurants. What results is a miss match of colours, signs and spaces which make for a wonderful place to explore and grab a local coffee.Hoi An is widely considered one of the most colourful and beautiful towns in Vietnam. Largely spared of damage during the Vietnamese conflict, the old trading port of Hoi An is a UNESCO Heritage town offering an amazing central old town with small friendly streets dotted with an abundance of family run shops, restaurants and coffee shops. Whether you want to stop for a nice cheap beer while watching the sun set over the river or splash out on an incredible seafood supper, Hoi An has it all within walking distance.This afternoon we will enjoy a short orientation of the area followed by a bike tour of the nearby paddy fields and beach.Today is free to soak up more of the beauty of Hoi An. One of the biggest highlights are the many tailors found around every corner. If you love clothes and want something special or unique Hoi An is the perfect place. Take a photo in to show the tailors or pick an outfit from the brochures and have it ready the next day.Another highlight of the area is renting a bicycle and cycling the short 5km ride through country lanes bordered by rice paddy fields to the wholly unspoiled Cua Dai beach for the day.Hoi An is also known for offering some incredible local cooking classes. Visit the markets on a local tour and learn the secrets behind the classic Vietnamese spring roll or one of the many other delicacies.This morning we get picked up and driven to Da Nang's Marble Mountains which are made out of limestone and marble. Following this we drive towards Vietnam's ancient Capital City, Hue. On route we will also stop to enjoy the spectacular views from the Hai Van Pass, the longest and highest mountain pass road in Vietnam. Upon reaching the Imperial City, we will tour the forbidden citadel which was only for the emperors and those closest to them, with severe punishments if you were caught trespassing. Time permitting, you can also take a trip down the Perfume River to visit the tombs of Vietnam's ancient Emperors.A short flight takes us to colourful Hanoi.Hanoi offers a beguiling combination of tranquillity and chaos, from the elegance of its crumbling colonial architecture and tree-lined boulevards, to the boisterous cacophony of street vendors and motorcycles. Much can be absorbed of daily life by wandering the streets of the old quarter, tasting local market food, and people-watching. For the culture buffs there are museums, temples and tombs which offer insight into a city rich in history and character.Our morning begins with a visit to the historical center of Hanoi to walk around the relaxing scenery of Hoan Kiem Lake where you can watch the early morning aerobics and enjoy a local speciality of 'egg coffee'. Legend has it that a magical sword was sent to Emperor Ly Thai which was used to drive the Chinese from Vietnam. The sword was later taken from the Emperor by a golden turtle who dissapeared into the depths of the lake with it, and that's where it gets its name from 'Lake of the restored sword'.After our morning at the lake, you have the opportunity to travel out to and visit the world famous Halong Bay on either an optional day or overnight excursion. The bay includes hundreds of islands with towering limestone karsts draped in verdant foliage and is a classified UNESCO World Heritage site.Today is free to enjoy as you please. Discover Ho Chi Minh's Mausoleum, the Presidential Palace, the Stilt House and the famous 1-Pillar Pagoda. You can also visit “coffee street” in the old quarter for a ca phe sua da (a milky iced coffee) for a caffeine fix, grab some hearty bowls of Pho from the street vendors selling delicious Vietnamese street food or cross the red Huc Bridge to visit Jade Island where the Ngoc Son Temple (Temple of Jade Mountain) stands.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/vietnam_166/vietnam_halong_bay_20161111_1601979118.jpg", "countries": "Vietnam"}