{"title": "Highlights of Nepal", "link": "https://www.tucantravel.com/tour/highlights-of-nepal/inhn/", "dates": {"2020-08-05": "USD 140.00", "2020-09-16": "USD 140.00", "2020-10-21": "USD 140.00", "2020-11-25": "USD 140.00", "2021-01-06": "USD 150.00", "2021-02-03": "USD 150.00", "2021-03-10": "USD 150.00", "2021-04-14": "USD 150.00", "2021-05-19": "USD 150.00", "2021-06-30": "USD 150.00", "2021-08-11": "USD 150.00", "2021-09-22": "USD 150.00", "2021-10-27": "USD 150.00", "2021-12-01": "USD 150.00"}, "days": "11", "description": "T We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Kathmandu, the capital of Nepal, is surrounded by snow-capped mountains while Kathmandu Valley has the highest number of UNESCO World Heritage Sites in such a small area and is surrounded by verdant agricultural hills scattered with traditional villages and ancient holy temples and shrines used by both Buddhists and Hindu worshippers.Explore the many attractions this city has to offer. The backstreets around Durbar Square and Palace are bustling with life with throngs of people going about their lives and selling on the road. Random cows wander the streets, taxis hoot and narrow alleyways overflow with spices, vegetables and handicraft shops with intriguing and unpleasant smells, incessant noise and pollution – triggering a sensory overload. You could also venture to ominously named freak street or Jochne named by the hippies during the 1970s.Today we travel down the dusty roads to Lumbini which lies in the foothills of the Himalayas in Nepal. Lumbini is said to be the place where Gautama Buddha 'the apostle of peace and the light of Asia' was born in 623 B.C. The most important temple at Lumbini is the Maya Devi Temple, marking the traditional site of the Buddha's birth. The temple stands on the site of earlier temples and has been a place of pilgrimage for hundreds of years. The area around Lumbini is entirely Hindu, but many Buddhist temples and shrines from various nations are scattered around the holy site itself.We travel to Chitwan National Park. The park is UNESCO World Heritage listed (1984) and is home to one of the last populations of single-horned Asiatic rhinoceros and also of the Bengal tiger. The park is situated in south central Nepal, covering 932 square kilometres in the subtropical lowlands of the inner Terai. The area comprises the Tikauli forest - from Rapti river to the foothills of the Mahabharat - extending over an area of 175 square kilometres. The area became the country's first National Park in 1973.We stay near the entrance of Chitwan National Park and you will have a choice of optional excursions to enjoy from canoeing and jungle walks to jeep safaris as you keep an eye out for the elusive tiger. In the evening, after a delicious dal baat dinner we watch a Tharu Cultural Dance Show, understanding the different interpretations of the Tharu dances.Today you are free to book onto activities in the national park.We head to the stunning lake town of Pokhara with spectacular views of the Annapurna mountains. The town is situated on the banks of Lake Phewa Ta, the second largest lake in Nepal. This town itself is very quiet and laid back providing a great base for trekking. Here you can grab some last minute equipment in preparation for your hike in the morning.After a big breakfast, we take a car to the start of our trek and we begin our climb in to the Annapurna Foothills. We slowly trek for around three hours before stopping for a well deserved lunch, enjoying some stunning views on the way.After an hour break we will continue on our trek to reach our first nights accommodation at\n1900m, arriving late afternoon. On the way we enjoy snow-capped peaks, blue lakes and rivers. The deep valleys and high mountains surrounding the Annapurna Himal include varied terrain, from subtropical jungle to a high, dry landscape.We spend two days hiking through the Annapurna foothills. The views are breathtaking and the trails are scenic. A guide explains the flora and fauna that we pass and we are assisted by porters who carry your toiletries and a change of clothes. We sleep in rustic lodges along the way and pick up litter along the route. It is a magical two days where you get the opportunity to walk through small villages.Please Note: The first day of trekking covers roughly 11 km with mostly uphill terrain.Today the trek will cover around 20 km with mostly flat or downhill terrain.After two nights in the foothills, we return to Pokhara and walk a short 1.5 hours to reach the lake, taking in the stunning scenery on the way.Today we visit a Tibetan Refugee Camp to watch how the women make silk rugs and you can hire a boat out on to the lake and also hike up to the Japanese Peace Pagoda. You can hire a mountain bike to explore the countryside around the lake.We return to Kathmandu for a final night in Nepal's capital. Enjoy some last minute sightseeing and souvenir shopping or a final dahl baat with your tour group.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/nepal_140/nepal_chitwan_np_20161111_1785132840.jpg", "countries": "Nepal"}