{"title": "Best of Egypt & Jordan", "link": "https://www.tucantravel.com/tour/best-of-egypt-and-jordan/meej/", "dates": {"2020-07-11": "USD 320.00", "2020-08-15": "USD 320.00", "2020-08-22": "USD 320.00", "2020-08-29": "USD 320.00", "2020-09-05": "USD 320.00", "2020-09-12": "USD 320.00", "2020-09-19": "USD 320.00", "2020-09-26": "USD 320.00", "2020-10-03": "USD 320.00", "2020-10-10": "USD 320.00", "2020-10-17": "USD 320.00", "2020-10-24": "USD 320.00", "2020-11-07": "USD 320.00", "2020-11-21": "USD 320.00", "2020-12-05": "USD 320.00", "2020-12-19": "USD 320.00", "2021-01-02": "USD 340.00", "2021-01-16": "USD 340.00", "2021-01-30": "USD 340.00", "2021-02-13": "USD 340.00", "2021-02-27": "USD 340.00", "2021-03-06": "USD 340.00", "2021-03-13": "USD 340.00", "2021-03-20": "USD 340.00", "2021-03-27": "USD 340.00", "2021-04-03": "USD 340.00", "2021-04-10": "USD 340.00", "2021-04-17": "USD 340.00", "2021-04-24": "USD 340.00", "2021-05-01": "USD 340.00", "2021-05-08": "USD 340.00", "2021-05-15": "USD 340.00", "2021-05-22": "USD 340.00", "2021-05-29": "USD 340.00", "2021-06-12": "USD 340.00", "2021-06-26": "USD 340.00", "2021-07-24": "USD 340.00", "2021-08-21": "USD 340.00", "2021-09-04": "USD 340.00", "2021-09-18": "USD 340.00", "2021-09-25": "USD 340.00", "2021-10-02": "USD 340.00", "2021-10-09": "USD 340.00", "2021-10-16": "USD 340.00", "2021-10-23": "USD 340.00", "2021-10-30": "USD 340.00", "2021-11-06": "USD 340.00", "2021-11-13": "USD 340.00", "2021-11-20": "USD 340.00", "2021-11-27": "USD 340.00", "2021-12-11": "USD 340.00", "2021-12-25": "USD 340.00"}, "days": "16", "description": "E We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to the capital of Egypt. Originally founded in 2,000 BC and known to be one of the largest cities in Africa, Cairo has established itself as a city of significant landmarks that began to emerge as a result of Roman rule in 30 BC. Journey via private vehicle deep into Arab culture and prepare to explore a city and country bursting with ancient history, grandeur and a fascinating way of living.Today is an arrival day and no activities are planned, however if you are arriving with enough time we recommend exploring the Cave Church in Cairo, which is one of the largest churches in the country as well as paying a visit to the Coptic Museum which is home to the largest collection of Egyptian Christian artifacts in the world. Note that you will be transferred from the airport to your joining hotel where there will be a pre-departure meeting held at approximately 6:00pm.If you have booked pre-tour accommodation through Tucan Travel then your arrival airport transfer will be included on the day you arrive in Cairo.Please note: You will need to pay 110 USD of your local payment which will be collected by your Egyptian tour leader today. The remaining 210 USD will be collected on day 10 of your tour.Today we set off early. Crossing the River Nile, we head to Giza where we visit the famous  Pyramids and Sphinx. Here you will have some free time to explore these magnificent wonders.Considered one of the seven wonders of the ancient world, Egypt’s majestic Pyramids were built to honour dead Pharaohs. The three great pyramids that are part of The Giza plateau date back from a period of construction between 3,800 and 2,800 BC and are located on the West bank of the River Nile because of the symbolism associating with the realm of the dead when the sun sets there in the evenings.After an exciting day of exploring these great ancient monuments you will head to the train station to board your overnight sleeper train to Aswan. Dinner will be included on the overnight train journey.This morning we arrive into Aswan station before heading to nearby Agilika Island to tour the romantic Philae Temples. Most notably, you will visit the Temple of Isis (in honour of the goddess). This classic Egyptian temple lies in between two dams at Aswan and can only be reached by boat.After visiting Philae Temple you will have the opportunity to visit the Aswan High Dam, an impressive engineering masterpiece which stands at an a whopping 364ft.If you would like to get a taste for the local flavour and culture then you have the opportunity to visit a local Nubian village and enjoy dinner and a show in one of the Nubian houses.Today you have the option visit the incredible great sun Temples of Abu Simbel. These temples are considered masterpieces of Ancient Egypt that were built for King Ramses II and Queen Nefertari both also reflecting the glory and grandeur of the new Kingdom. Both temples were discovered in 1813, after centuries of being buried under desert sands, but were then relocated in 1960 with the help of the Egyptian government and UNESCO to avoid the rising water of the Nile. A site not to be missed!Alternatively you can spend the morning relaxing before boarding your traditional felucca boat to embark on an unforgettable sailing adventure down the River Nile. You will depart from Aswan early afternoon, making your way to Kom Ombo. Lunch and dinner will be served on the felucca.Please note:  You will be required to bring your own sleeping bag for the felucca sailing experience.This morning you will disembark from the felucca and transfer to the site of the famous Kom Ombo temple. Overlooking the Nile, the Kom Ombo temple was built in dedication to the gods of Sobek (the Crocodile God) and Haroeris (the Falcon God), and has since become a popular part of Egyptian history that is visited by many for its grand inner halls and intricate wall carvings.After exploring Kom Ombo you continue to follow the River Nile by road. The next stop for today will be Edfu Temple. The Edfu temple contains both elements of Greek and New Kingdom temples. Here you will also get the chance to walk through the 37m high temple and explore its court and inner chapel.The adventure continues in the afternoon as you travel to Luxor, where you will have the next couple of days to explore the city and its surrounding attractions. The Luxor area is filled with more magnificent temples and valleys; you will find yourself at the very heart of ancient Egypt when visiting Luxor.We have included some important excursions in Luxor but not all as there is just so much to see and do and we want you to have the flexibility to see the things on your bucket list!A popular choice in the evening is to visit Karnak Temple for the ‘Light and Sound’ show. The light and sound show in the evening showcases the greatest achievements of some of the great Pharaohs as they come to life with accompanying music and light effects that you can experience as you wander through the complex.Please note: There are many optional excursions available in Luxor. It may not be possible to do all of them, however your Tour Leader will try to arrange them for you according to the best suitable times.Deep within the valley opposite modern Luxor lies the royal burial complex known as The Valley of the Kings. This morning you will have an included excursion to Valley of the Kings. The valley holds over 60 tombs that were once surrounded by a plethora of Egyptian treasures, the most notable being the final resting ground for King Tutankhamun which visitors can see. Admission to the Valley of the Kings complex is included, but entrance to the actual tombs will be at an additional cost if you dare to enter!After visiting the Valley of the Kings our next stop will be Colossi of Memnon. These gigantic statues have survived for 3,400 years in the hot desert sun and are visited by many despite the condition of the statues being affected by weather conditions.This afternoon you will have time to explore some of the many options available in the Luxor area. Your tour leader will be on hand to assist you in arranging these excursions. Maybe you would prefer to take a little relaxation time or perhaps soak up the atmosphere at the Luxor bazaar (Souk)? A visit to the souk is a real insight into local life, you will see traders selling local produce, household utensils, tools and other goods as well as  jewellery, bags, leather goods, souvenirs, spices, scarves and all sorts of other trinkets and treasures.Today you have a free morning to continue exploring. If you have a head for heights why not opt for the scenic hot air balloon journey over the ancient and historical sites of Luxor? This excursion can be arranged locally and is subject to availability. Please note that the operation of this excursion is weather dependant.If you have not already visited then this is also a good time to visit the Karnak temple which is known to be one of the world’s greatest ancient sites. The temple itself contains two museums - the Mummification museum where you can learn more about the ancient process of mummification and the Luxor museum displaying a small but impressive collection of ancient Egyptian artefacts.Alternatively it is also worth opting to visit the ancient temple of Hatshepsut which differs to others due to its classical style of architecture. After a busy morning of exploration we depart Luxor as we hop on an overnight train returning to Cairo.This morning we arrive back at our original starting point in Cairo. After checking into our hotel, we head back out to visit the Egyptian Museum. Here is where you will come face-to-face with more ancient treasures and if you are lucky you will get to view the infamous Gold Death Mask of Tutankhamun.Our day of culture continues as we make our way towards Cairo’s oldest church, also known as The Hanging Church and the nearby Ben Ezra Synagogue. We also stop at the 19th Century Mosque of Muhammad Ali (also known as Saladin Citadel) to admire grand structure and take in some great views of Cairo.Time dependant, you may also have some free time to explore Cairo a little more this afternoon. Tonight will be your last night on tour and you will be free to enjoy this as you wish, however our Tour Leader will be happy to arrange a final group dinner for everyone who wishes to join.Today it’s time to make the journey from Egypt to Jordan. You fly into the capital city of Amman and are picked up at the airport where you'll will be taken to settle into our hotel.Please note: Your group will not be accompanied by a tour leader on the flight to Jordan. You will be accompanied/met by local representatives on each end to assist.This morning you will meet with your new tour leader at breakfast before departing by private vehicle to the ancient city of Jerash. These ruins offer some of Jordan’s best examples of Greco-Roman architecture and are so well preserved that they are often known as the “Pompeii of the Middle East”. Wandering through its cobbled streets and marvelling at its magnificent monuments, temples and theatres it will not be difficult to imagine how life was for its former citizens. Admire Hadrian's Arch and explore the famous Hippodrome which hosted chariot races to thousands of spectators throughout a time of Roman rule.After a morning of exploration, we journey north west to the city of Umm Qais. Once known as the city of Gadara, Umm Qais’ offers panoramic views over the Sea of Galilee and ancient ruins which will have you feeling like a part of history. Later in the day we head back to modern Amman for an evening meal where you can reflect on today's activities with your group.Please note: 210 USD of your local payment will be collected by your Jordanian guide today.This morning we drive to the market city of Madaba which is also known as the ‘City of Mosaics’, most notably the city is home to the 6th century Mosaic map of Jerusalem and the Holy Land. We make a stop at the 19th Century Byzantine Greek Orthodox Church of St George where you will have time to view this famous, colourful mosaic which now forms part of the church's floor.Whilst in Madaba you will have the option to take part in a traditional Jordanian cooking experience. If you choose to do this then your guide will arrange for you to meet a local who will take you to buy produce from the local shops and market. After purchasing your fresh goods you will return to their home where they will share recipes and local traditions while you prepare and cook an authentic dish together. This will give you the unique opportunity to learn more about local culture and interact with a local family. If you opt not to join the cooking experience then you will have free time to explore Madaba and take lunch.We depart Madaba and drive along the historical King's Highway which dates back to biblical times - the winding roads will take us through mountainous scenery observing local life along the way.During our journey we will make a stop to experience a birds eye view of Wadi Mujib which is best known as ‘The Grand Canyon of Jordan’. Impressive for its grand scale, this gorge was known during biblical times as the River Arnon and was named after its noisy waterfalls. The river was important during this period as it formed a physical boundary between the Moabites and the Amorites. The canyon opens out to the Dead Sea at an altitude of 410m below sea level making it the lowest nature reserve on Earth.Following this we will visit Mount Nebo - a Holy site in Jordan said to have been the place where Moses saw the Promised Land before he died as mentioned in the Old Testament. Your group will also get the opportunity to catch spectacular panoramic views of the Dead Sea and the Jordan River from Mount Nebo before making our way to the ancient site of Umm ar-Rasas.In the late afternoon we arrive at our hotel situated just outside the ancient city of Petra. It is ideally located for tomorrow&#39;s activity where we will have a full day to explore the world famous UNESCO World Heritage Site, also known as the ‘Rose City’ due to its rose coloured rocks. Prepare to be mesmerised as you enter the city through the dramatic main entrance known as the Siq. Standing tall at an impressive 80m and over 1 km in length, this narrow and majestic gorge acts as a gateway to one of the most picturesque destinations you will ever visit.Today we start early in order to best experience Petra on our morning guided excursion. You will come face-to-face with this archaeological treasure which is very precious to the people of Jordan, so much so that it is considered a national symbol of the country. One of the Seven New Wonders of the World, this awe inspiring gem comprises of tombs, temples and its notable red-rose sandstone rock in which the city itself was carved inside. You will have the opportunity to continue exploring this in depth during your free afternoon.This evening you have the option to experience the magic of the city at night with a candlelight experience.The adventure continues as we drive further south to the dramatic desert wilderness of Wadi Rum. Bask in the natural beauty of the red-sand desert and its surrounding rock formations before setting up camp overnight where we will experience the cool desert climate under the starsToday we arrive in the city of Karak where you will find an ancient fortified castle perched high on top of a hill nestled within the heart of the local town. Built by the Crusaders in the 12th century it’s strategic position allows for views as far as the Dead Sea on a clear day.After some time exploring this well preserved Crusader stronghold we journey to what is best known as ‘The Grand Canyon of Jordan’. Impressive for its grand scale this gorge was known during biblical times as the \"River Arnon\" and was named after its noisy waterfalls. The river was important during this period as it formed physical boundary between the Moabites and the Amorites. The canyon opens out to the Dead Sea at an altitude of 410m below sea level making it the lowest nature reserve on Earth.Today you have a full free day to enjoy the Dead Sea which is notable for its deep blue waters made up of Dead Sea salts and minerals. Make the most of your relaxation time while appreciating the magnificent surrounding views of the Jordanian East Coast. The hotel customer service team will be there to assist you with anything you may need.You will also have the opportunity to visit Bethany Beyond the Jordan - the archaeological site of Bethany which is believed to be the site where Jesus was baptised by John the Baptist. Only recently excavated you can see a number of different churches, baptismal pools and prayer hall which all date back to the Byzantine and Roman period. Not only can you visit the baptism site of Jesus but you will be able to touch the River Jordan and perhaps observe as people are also baptised in this holy river. Just metres over the river you will see people visiting the same spot from the Holy Land of Israel & Palestine.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/egypt_113/shutterstock_egypt_the_nile_at_aswan_96065345_20180525_1745582062.jpg", "countries": "Egypt, Jordan"}