{"title": "Machu Picchu, Amazon & Galapagos", "link": "https://www.tucantravel.com/tour/machu-picchu-amazon-and-galapagos/peag/", "dates": {"2020-04-28": "USD 190.00", "2020-05-12": "USD 190.00", "2020-05-26": "USD 190.00", "2020-06-09": "USD 190.00", "2020-06-23": "USD 190.00", "2020-07-07": "USD 190.00", "2020-07-21": "USD 190.00", "2020-09-01": "USD 190.00", "2020-09-29": "USD 190.00", "2020-10-13": "USD 190.00", "2020-10-27": "USD 190.00", "2020-11-10": "USD 190.00", "2020-11-24": "USD 190.00", "2020-12-08": "USD 190.00", "2020-12-22": "USD 190.00", "2021-01-05": "USD 200.00", "2021-01-19": "USD 200.00", "2021-02-02": "USD 200.00", "2021-02-16": "USD 200.00", "2021-03-02": "USD 200.00", "2021-03-16": "USD 200.00", "2021-03-30": "USD 200.00", "2021-04-13": "USD 200.00", "2021-04-27": "USD 200.00", "2021-05-11": "USD 200.00", "2021-05-25": "USD 200.00", "2021-06-08": "USD 200.00", "2021-06-22": "USD 200.00", "2021-07-06": "USD 200.00", "2021-07-20": "USD 200.00", "2021-08-03": "USD 200.00", "2021-08-17": "USD 200.00", "2021-08-31": "USD 200.00", "2021-09-14": "USD 200.00", "2021-09-28": "USD 200.00", "2021-10-12": "USD 200.00", "2021-10-26": "USD 200.00", "2021-11-09": "USD 200.00", "2021-11-23": "USD 200.00", "2021-12-07": "USD 200.00", "2021-12-21": "USD 200.00"}, "days": "14", "description": "C We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Peru! Your adventure starts in Cusco, a city of beautiful Spanish colonial architecture and the once capital of the Inca Empire. While the city is usually seen as the gateway to the iconic Machu Picchu, Cusco is well worth exploring in itself.Discover the Plaza de Armas, the cultural centre of the city and where you can find many bars, restaurants and local coffee shops. Visit the Cathedral, which was built with blocks from the nearby Inca site of Sacsayhuaman and took almost a century to complete.We highly recommend arriving to Cusco a few days prior to the start of your tour to help with acclimatisation. If you would like to book pre-tour accommodation please contact your Adventure Specialist.Tonight you will have a briefing on what to expect over the next few days and your journey to Machu Picchu.Today we make our way to Ollantaytambo, a small village in the Sacred Valley and the starting point for the train journey to Machu Picchu which we will take tomorrow.First we spend a full day visiting the Sacred Valley and its ruins.At an altitude of 3800m we take slow walks that take up to an hour, around each of the ruins in order to manage any effects the high altitude may have. Firstly we visit the Pisac ruins, perched on a hilltop with incredible views of the surrounding mountains. We then go down to the famous traditional market of the same name, which is full of colour and atmosphere. A great place for souvenirs! After lunch, we continue along the valley to the temple/fortress of Ollantaytambo with its enormous Inca terracing constructed on the side of a steep mountain.Tonight you will stay in the town of Ollantaytambo in preparation for an early departure to Machu Picchu tomorrow.Machu Picchu is undoubtedly Peru’s most well known and visited attraction. One of the most beautifully preserved Inca citadels in the world, the mystical views have to be seen to be believed.Today is that day, and you will enjoy an included train ride to the beautiful ruins followed by a guided tour of the site. Waking early in Ollantaytambo, your group will take a local train to Aguas Calientes where you have time to get some food. Enjoy some stunning views as you journey through the lush Peruvian countryside witnessing mountain vistas, small communities as well as other smaller Inca sites.From Aguas Calientes, you will hop on a tourist bus for the final short (around 20 minutes) journey to the site.The lost city of Machu Picchu was originally completely self -contained, surrounded by agricultural terraces sufficient to feed the population, and watered by natural springs. Located high above the fast flowing Urubamba River, the cloud shrouded ruins have palaces, baths, temples, storage rooms and some 150 houses, all in a remarkable state of preservation that will simply take your breath away. The ruins were only discovered by the outside world in 1911, when American explorer Hiram Bingham found them while looking for another “lost city” called Vilcabamba. Due to their isolation many of the buildings are still quite intact and you can't help but admire Huayna Picchu (Young Mountain), which towers above the ruins.After your guided tour and some free time to explore the ruins, you will get the train back to Ollantaytambo, arriving back in Cusco at approximately 10pm.Options for getting to Machu Picchu:Taking the train: Waking early in Ollantaytambo you will take the train to Aguas Calientes, arriving at 10am. You will have time to get some food before entering Machu Picchu at approximately midday. Enjoy a guided tour around the site before getting the train back to Ollantaytambo and arriving back in Cusco at approximately 10pm.One day hike: Waking early in Ollantaytambo you will take the train to to Km104 (2100m) where you will start the trek heading towards the ruins of Chachabamba. From here you will follow the Inca Trail to the foot of the Wiñay-Wayna ruins (2700m), hiking until you reach Sun Gate and Machu Picchu in the late afternoon. Enjoy a guided tour around the site before getting the train back to Ollantaytambo and arriving back in Cusco at approximately 10pm.Today is free to relax and explore some more of Cusco. Take a walking tour and admire the colonial buildings or wander the colourful San Pedro Market, where you can find fruits and vegetables in abundance as well as other local delicacies.A 45 minute walk from the centre lies Sacsayhuaman, another ancient Inca site that is well worth the journey for both the incredible views of Cusco and the interesting stonework. You can also catch a glimpse of Cristo Blanco, the large statue of Christ that towers above the city.Spend the evening back at Plaza de Armas and experience Cusco after dark. With plenty quaint restaurants and vibrant bars around, the plaza is as lively as during the day.No trip to Peru would be complete without a visit to what is considered the most biodiverse place on earth, the lush and beautiful Amazon rainforest. Covering nearly two thirds of the country, the area is home to around 600 species of birds, 1200 types of butterflies and 300 reptiles, to name a few. As eco-tourism continues to grow, there are a number of eco lodges allowing you to experience the rainforest in the most responsible and authentic way possible.Our local representative will transfer you to the airport for your flight to the jungle community of Puerto Maldonado, the starting point for our visit to the Amazon rainforest. Here you can pick up last minute drinks and snacks before the group continue with a short bus ride followed by riverboat journey to reach the accommodation for the night. Sailing along the river, the trip takes around 2 hours and is an excellent chance to relax and start to take in the magic of the rainforest.Arriving at your riverside lodge, check in and have some time to relax before an afternoon of exploring. After lunch we will set off on a trek through the rainforest along wooden walkways. On the way our guide will stop to show you various species of bird and explain the medicinal plants and delicate ecological systems of the Amazon Jungle. The scenery is extremely varied incorporating dense jungle as well as marsh areas. You will see incredibly big trees, several metres in diameter and around 450 years old. We walk to Cochita Caiman (Caiman Pond) where we see wildlife along the way. We then return to the lodge for dinner.Please note: The eco-lodges in the Amazon jungle are designed to give travellers the most authentic jungle experience while limiting disruption to the animals and plantlife. The bungalows are built from local indigenous materials with the rooms sealed by mesh netting to keep mosquitoes out. All rooms have private bathroom facilities however these are basic and hot water can be limited. There is portable water available at the lodge therefore we recommend taking a reusable water bottle with you. Electricity is limited and it is advisable to bring portable chargers for your electronics and ensure they are fully charged. After dark, the walkways are lit by oil lamps. The lodges include a welcome area, dining room and bar, meaning there are plenty areas for your group to relax and socialise. Single supplements are not available in the bungalows. If you have further questions on what to expect, your tour leader will be happy to assist. All excursions in the jungle are led by an English speaking guide.After an early breakfast we hike deeper in to the jungle, enjoying the surroundings and exploring the delights and hidden wonders of the Amazon Rainforest. We may also catch a glimpse of the rare giant otter. Afterwards we will enjoy the view of the lake from our viewing point/observation platform, where you can experience the canopy wildlife such as parrots, guacamayos, toucans, camungos, shanshos, herons, turtles and caiman. We will return to the lodge for a well deserved lunch.After a break and some yummy food, we take a short boat trip across the Madre de Dios River to Monkey Island. On the way over you may spot caiman from the boat. Once on the island it is possible to see a great variety of monkeys such as the ‘maquisapa’, black and white ‘Martins’, ‘Leoncito de la Selva’ (Little Lions), ‘Frailes’ (Friars), ‘Achuñis’, ‘Ronsocos’ as well as an array of birdlife. In the evenings it is often possible to enjoy the wonderful sunset, one of the most impressive sights of the forest (weather permitting).Enjoy your final night in the heart of the jungle soaking up this magical and peaceful atmosphere.This morning after breakfast we make our way to Lima. After a boat back to Puerto Maldonado, followed by a two hour flight you are met by our local representative and transferred to your hotel for the evening.Lima was founded by the Spanish Conquistador Francisco Pizarro in 1535 after he eradicated the Incas and made the city his capital. Lima has many fine colonial buildings and some of the best museums in South America including the Gold Museum, Museum of the Inquisition and the Catacombs below the San Francisco Church. Peru's capital has much to offer and many of the sights, including the city's two main squares the Plaza de Armas and Plaza San Martin, boast some fantastic sightseeing opportunities. The Plaza de Armas houses the Cathedral, Municipal Palace and Presidential Palace where the changing of the guard can be seen every day at 12 noon. There are also many markets in Lima, possibly the best being in the central district.This morning you will be transferred to the airport by our representative for your flight to Quito; gateway to the Galapagos. Enjoy a free afternoon in the bustling capital city of Ecuador, exploring the streets and squares of the largest historical centre in the Americas. The old town is listed as a UNESCO world heritage site and has many quaint cafes, shops and attractions. Visit the Basílica del Voto Nacional towers, a Roman Catholic church and largest neo gothic basilica in the world, or the Iglesia de la Compañía de Jesus church which is considered one of the most beautiful landmarks in the city.Tonight, take the opportunity to sample some classic Ecuadorian cuisine, with various restaurants dotted around the city. From ceviche to guinea pig, there is a variety on offer from the mountains to the coast. Try one of the most famous dishes, Llapingachos, a fried potato omelette stuffed with cheese and served with a fried egg, avocado or meat.Get ready to channel your inner David Attenborough and experience some of the most untouched, wildlife packed islands in existence, as today you start your Galapagos adventure. This morning transfer to the airport and fly to San Crist&#243;bal Island where you will be met by our guide and taken to your home for the next few days, the Coral Expedition Cruise.This afternoon we visit the Cerro Colorado Tortoise Breeding and Rearing Center for young tortoises. Passengers can learn about the National Park's conservation programs and about an assisted reproduction programme. If time allows, you may have the opportunity to visit the port village and have a shop for arts, crafts and souvenirs.Spend your evening relaxing on the boat, with indoor and outdoor space to rest or socialise. Make use of the open deck jacuzzi and enjoy a dinner of either Ecuadorian or international cuisine.You will be onboard the Coral I or II. To find out more about our ships please click  hereToday we head ashore to Cerro Brujo's white coral beach (wet landing). The white-sand beaches offer great open walking with brilliant migratory bird watching opportunities; look out for black-necked stilts, ruddy turnstones, whimbrels and white-cheeked pintails. This is also a great place for a swim or snorkelling off the beach before heading back to the M/V Coral I or II for lunch.Difficulty Level: EasyType of Terrain: SandyAfter lunch we go ashore to Pitt Point on San Crist&#243;bal Island which is probably one of the few places on the islands where it is possible to see the three booby species together: Nazca, blue-footed and red-footed. The island also features magnificent and great frigate birds, a large sea lion colony and great spots for dinghy rides. There will be an opportunity to go snorkelling before we head back to the boat for dinner.Difficulty Level: DifficultType of Terrain: RockyWe have a dry landing today on Espa&#241;ola Island (Suarez Point). Here you will learn more about the lava terrain and hike cross the inactive lava fields. Besides the sea lion colonies, this is one of the most important sites for bird watching. Many species, like the hooded mockingbird and red-billed tropic can be spotted and observed closely. Past the nesting grounds you&#39;ll reach the world&#39;s largest colony of waved albatross. From May to December their mating rituals are a highlight of the visit. Later you will visit the famous blowhole where water shoots about 23m (75ft) high.Difficulty Level: DifficultType of Terrain: RockyIn the afternoon we continue on to Gardner Bay for a wet landing on a white coral beach amidst a large colony of sea lions. This site has no trails, so hiking is not possible. It?s an open area where you can spot Galapagos hawks, American oyster catchers, Galapagos doves, and hood mockingbirds, three species of Darwin finches, yellow warblers, lava lizards and marine iguanas.This is also a great area for swimming and snorkelling and you can see many Galapagos marine species like king angelfish, Creole fish, damsel fish, parrot fish, manta rays and white tipped reef sharks.Difficulty Level: EasyType of Terrain: SandyToday we spend the day on Floreana Island. We hike through black mangrove beds, view plants endemic to the island and enjoy the nesting sites of the Green Pacific Sea Turtles. You will not be able to walk in the water in case of sting rayes in the sand but you can see sea turtles and blue footed boobies feeding.Floreana has had a colourful history: Pirates, whalers, convicts, and a small band of somewhat peculiar colonists - a Baroness among them - who chose a Robinson Crusoe existence that ended in mystery and death. Today roughly fifty Ecuadorians inhabit the island. Punta Cormorant offers two highly contrasting beaches; the strand where the yacht anchors is composed of volcanic olivine crystals, giving it a greenish tint that glitters in the sun. From here a trail crosses the neck of the isthmus - which rises to form a cinder cone - to a beach of very fine white sand, formed by the erosion of coral skeletons. Between the two beaches is a salt lagoon frequented by flamingos, pintails, stilts and other wading birds.In 1793 British whalers set up a barrel as the island&#39;s Post Office to send letters home on passing ships. The tradition continues to this day, simply by dropping a post card into the barrel without a stamp. The catch is you must take a post card from the barrel and see that it gets to the right place. That is how the system began and continues to this day. Some claim it works better than the post office. Seen 250m north from Punta Cormorant is an old submerged volcanic cone that has been worn down by waves. Devil's Crown is home to a myriad of marine species including a variety of corals, pencil sea urchin, wrasses, angelfish, amberjacks and many other creatures, making for some of the best snorkelling in the Galapagos. The eroded crater walls form a popular roosting site for seabirds including boobies and pelicans.Difficulty Level: EasyType of Terrain: SandyThis morning we have a dry landing on Santa Cruz Island, where we visit a natural tortoise reserve called 'El Chalto', where Giant Tortoises are found in their natural habitat, as well as land birds such as Yellow Warblers. You will then check out of the M/V Coral I or II and transfer to Baltra Island?s airport for the return flight to Quito. You will be transferred to your hotel upon arrival in Quito.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/peru_7/peru_amazon_boat_20161111_1130731654.jpg", "countries": "Peru, Ecuador, Galapagos"}