{"title": "Morocco in a Week", "link": "https://www.tucantravel.com/tour/highlights-of-morocco/rmohmc/", "dates": {"2020-04-26": "USD 50.00", "2020-05-10": "USD 50.00", "2020-05-24": "USD 50.00", "2020-06-07": "USD 50.00", "2020-06-21": "USD 50.00", "2020-07-05": "USD 50.00", "2020-07-19": "USD 50.00", "2020-08-02": "USD 50.00", "2020-08-16": "USD 50.00", "2020-08-30": "USD 50.00", "2020-09-13": "USD 50.00", "2020-09-27": "USD 50.00", "2020-10-11": "USD 50.00", "2020-10-25": "USD 50.00", "2020-11-08": "USD 50.00", "2020-11-22": "USD 50.00", "2020-12-13": "USD 50.00", "2020-12-23": "USD 50.00", "2021-01-24": "USD 50.00", "2021-02-07": "USD 50.00", "2021-02-21": "USD 50.00", "2021-03-07": "USD 50.00", "2021-03-21": "USD 50.00", "2021-04-04": "USD 50.00", "2021-04-18": "USD 50.00", "2021-05-02": "USD 50.00", "2021-05-16": "USD 50.00", "2021-05-30": "USD 50.00", "2021-06-13": "USD 50.00", "2021-06-27": "USD 50.00", "2021-07-11": "USD 50.00", "2021-07-25": "USD 50.00", "2021-08-08": "USD 50.00", "2021-08-22": "USD 50.00", "2021-09-05": "USD 50.00", "2021-09-19": "USD 50.00", "2021-10-03": "USD 50.00", "2021-10-17": "USD 50.00", "2021-10-31": "USD 50.00", "2021-11-14": "USD 50.00", "2021-11-28": "USD 50.00", "2021-12-12": "USD 50.00", "2021-12-22": "USD 50.00"}, "days": "8", "description": "From the souks of Marrakech to the Sahara Desert, get under the skin of Morocco on this 8 day adventure. We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Morocco! You will be transferred from the airport to your hotel where you have the remainder of the day to relax or explore.Casablanca is the largest city in Morocco and is considered the economic and business centre of the country. From the fascinating architecture to the immense art and culture scene, there are many hidden gems in this populous city. Parts of the city are designated UNESCO World Heritage Sites and walking the streets is the perfect way to immerse yourself in the history. In the heart of old Casablanca you will find the palm-lined Boulevard Mohammed V, a striking reminder of the French influence in the city.You will have a pre departure meeting at 6pm tonight to meet your tour leader and group.After breakfast we head towards Fes but first we stop at Rabat where we enjoy a guided tour of the city. Visit the Oudaia Kasbah in the oldest part of the city, where you can spot famous landmarks at the Hassan Tower. We then journey to Meknes for a lunch stop, one of Morocco's imperial cities.After lunch we head to the Roman ruins of Volubilis, the largest site in Morocco dating back to AD40. Enjoy a guided tour around the Roman settlement before heading to Fes where we spend the night.Rich in culture and tradition, Fes is the second largest city in Morocco and it's medina is one of the largest intact in the world.Today we enjoy a guided tour to see the highlights and learn more about this medieval city. It is the oldest medieval city in the world, heavy in history and powerful stories. The souk’s are an intense mix of spices, sounds and colourful sights. Outside of the souks there are plenty of medieval mosques and palaces to visit. A full day city tour is included and we visit the famous leather tanneries and dye pits. That night you have the option to soak up traditional Moroccan entertainment and food at a local restaurant which comes highly recommended.Today we can enjoy a scenic drive heading towards the great Sahara Desert. We stop for a delicious Moroccan lunch (optional) before continuing to the desert. During the summer months we may also have time for a relaxing swim.Once we are fully refreshed we travel to Merzouga, where we board our desert transport- camels! Ride through the sand, reaching the Berber Camp where we will stay the night.Enjoy local food, music and an incredible night star-gazing under the desert sky.With vertical cliffs surrounding it, Todra Gorge is Morocco's answer to the Grand Canyon.Breathtakingly beautiful, we have time to explore the gorge, taking hikes around the rim and into the basin or even trying out rock climbing. As the day progresses, the colours of the canyon change turning a magnificent golden colour.Today we say goodbye to Todra Gorge.On the way, we stop off at Ouarzazate, a resting point traditionally used by African traders. Today it has been used as the set of many great films like Alexander the Great and The Last Temptation of Christ.Arriving at Ait Benhaddou we can enjoy a guided tour of the city known for its ancient and well preserved Kasbahs that are still occupied by a handful of families today. The city sits between the Sahara and Marrakech and has been a UNESCO World Heritage Site for a number of years.We return to Marrakech where you have free time to enjoy and tick off any further sights you want to explore. Relax by the pool and haggle in the markets for any last minute gifts.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/morocco_137/morocco_fort_20161111_1295956864.jpg", "countries": "Morocco"}