{"title": "Jewels of Sri Lanka", "link": "https://www.tucantravel.com/tour/jewels-of-sri-lanka/srj/", "dates": {"2020-07-25": "USD 230.00", "2020-08-22": "USD 230.00", "2020-09-19": "USD 230.00", "2020-10-10": "USD 230.00", "2020-10-31": "USD 230.00", "2020-11-21": "USD 230.00", "2020-12-05": "USD 230.00", "2020-12-19": "USD 230.00", "2021-01-09": "USD 250.00", "2021-01-30": "USD 250.00", "2021-02-20": "USD 250.00", "2021-03-13": "USD 250.00", "2021-04-03": "USD 250.00", "2021-04-24": "USD 250.00", "2021-05-22": "USD 250.00", "2021-06-19": "USD 250.00", "2021-07-17": "USD 250.00", "2021-08-14": "USD 250.00", "2021-09-11": "USD 250.00", "2021-10-09": "USD 250.00", "2021-10-30": "USD 250.00", "2021-11-20": "USD 250.00", "2021-12-11": "USD 250.00", "2021-12-25": "USD 250.00"}, "days": "15", "description": "E We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Sri Lanka! You are free to arrive today at your leisure.Negombo is situated by the shores of a lagoon by the same name. Once a Portuguese and Dutch trading port, popular attractions here include the Old Dutch fort gate built in 1672, the Dutch Canal, and the old churches and fishing villages which surround the area. In fact, due to the many ornate Roman Catholic churches scattered throughout, Negombo is sometimes known as &#34;The Little Rome&#34;. It also has a huge and rather inviting white sandy beach!Also worth exploring is the Kochchikade area, that comes to life at dusk with many handicrafts for sale, boutiques, shops, gem shops and restaurants for you to explore.There will be a pre departure meeting tonight at 6pm where you will meet your tour leader and fellow travellers.This morning we enjoy a Negombo city tour before heading towards Anuradhapura. Enroute, we will stop at the fish market and fishing village before visiting a coconut plantation.Anuradhapura, listed as a UNESCO World Heritage site was founded in the 4th century BC and was the capital of the Anuradhapura Kingdom until the beginning of the 11th century AD. Today the extensive ruins are well preserved and are an important site for Buddhists, Tamils and Hindus alike and we take a guided tour of them, learning about the fascinating history and the restoration efforts.After check in and some time to recharge we also explore the ancient site of Mihintale. Here you can discover the ruins of a hospital, a large monastery and ancient carvings. Climb the rock of Mihintale and discover an aerial view of ancient city of Anuradhapura.Today we embark on a day trip to visit the Anuradhapura ruins. You can choose to either hop in the private vehicle or enjoy the tour by bicycle.See the Sacred Bodhi Tree, dating back to 288BC which makes it the oldest living human planted tree on earth. It is widely thought that this is the spot where Buddha attained enlightenment and is now one of the most respected sacred relics in the world.Other sites include Isurumuniya Temple, Ruwanwelisaya, Jethawanarama, Stupa rama, Elephant pond, Twin pond, Moon stone and Guard stone.Return to the hotel mid afternoon and enjoy the rest of the day at your leisure.This morning we begin our drive to the ancient city of Polonnaruwa. On the way we stop at Aukana Buddha, one of the reservoirs constructed during the reign of King Dathusena, where we can see a magnificent 12 metre high statue of the Buddha.Polonnaruwa remains one of the best planned archaeological relic sites in the country. Built between the 11th and 12th centuries AD, Polonnaruwa is a listed World Heritage site. Here you can see the ruins of the Royal Palace, the Gal Viharaya, and four statues of the Buddha in 'Upright', 'Sedentary' and 'Recumbent' postures carved out of rock. Polonnaruwa is laid out over a large distance, therefore the best way to explore the area is by bicycle which we will do a guided tour. If you prefer not to bike, it is possible to take the guided tour in the private vehicle.This morning we head to Sigiriya, (Lions Rock), an impressive site from a distance rising 200 metres from the jungle. With hundreds of steps to climb to reach the top of the 5th century AD rock fortress, the view from the top over the surrounding landscape is incredible. Here you can also see the world-renowned frescoes of the &#39;Heavenly Maidens&#39; of Sigiriya.We then continue to our next destination of Dambulla, famous for its cave temple complex which we will explore tomorrow.This morning we visit the most impressive of Sri Lanka&#39;s cave temples which were used by the monks as meditation locations and places of worship. Some contain statues, paintings of the Buddha and detailed frescoes. We will also make a stop at a Spice and Herbal Garden where you will get shown the locally grown flora and some of its uses in medicine and cooking.On arrival to Kandy we&#39;ll take you on an orientation walk before enjoying an included evening &#39;puja&#39; at the sacred Temple of the Tooth, Sri Lanka&#39;s most important temple, revered and visited by Buddhists from all over the world.Kandy was the last capital of the Sri Lankan kings of the central hill regions, and of course, is a UNESCO World Heritage site.Today we will take a drive around the Kandy Lake, built by the last Sinhala king Sri Wickrama Rajasinghe in 1798, visit the Kandy town and Bazaar, the arts & crafts centre, a gem museum and a lapidary. In the afternoon you will have some free time to enjoy the city. You will find that Kandy is probably the best place to buy most of the handicrafts produced in Sri Lanka.Tonight we will watch a cultural show featuring traditional Sri Lankan dancing.A short drive today as we head further south to Nuwara Eliya, located in the heart of Sri Lankan hill country. Its higher altitudes and cooler climate offer a welcome respite from the usual temperatures.Today we enjoy an included tour to enjoy the velvety green tea plantations carpeting the rolling hills and to visit one of the local plantations and tea factory. The rest of the day offers time to be spent at your leisure, and a chance to relax and enjoy the cooler climes.Early in the morning we leave the hotel and head towards the impressive Horton Plains National Park. The park is home to many species of wildlife, including the sambar deer, macaques, leopards, wild boar and mongooses. The area is surrounded by the country's highest mountains, shrouded in cloud and rivers. This is the only National Park in Sri Lanka in which visitors are allowed to walk around freely so we will take the opportunity for a trek through the high mountain vegetation and lakes.Our goal is &#39;Worlds End&#39; where the 2000 metre plateau comes to an abrupt end, plunging 700-1000 meters to the valley floor. On the way we will visit Baker's Falls for panoramic views of the waterfalls, see a great deal of wildlife, including with purple­faced langurs, wild boar and barking deer as well as a small number of leopards.We board a train from Nuwara Eliya and enjoy the slow pace through the mountain scenery as we head to Ella. Ella is a sleepy village in Sri Lanka's Hill Country. Please note that seating is non-reserved on the train.This morning we enjoy a short 5km trek to Little Adam's Peak. After watching the sunrise we will visit Nine Arch bridge breakfast, followed by the Ravana Waterfalls.We then continue to Yala National Park where we will spend a night just outside of the park. We will take a game drive for your best chances to see elephants, leopards and bears. Yala National Park was established in 1900 and has one of the densest populations of wildlife in Asia. The park has two important pilgrimage sites, Sithulpahuwa and Magul Vilhara and has been the center of past civilisations.We depart this morning heading towards Unawatuna. On the way we visit the Udawalawe Elephant Transit Home, an important sanctuary that aims to rehabilitate orphaned elephant calves for release back into the wild.Upon arrival you are free to explore or relax on some of the most beautiful beaches in Sri Lanka. Off the coast, there are excellent diving opportunities, with a number of coral reefs and shipwrecks to be explored. There are a number of optional activities here to enjoy, and with two nights in Unawatuna, there is plenty of time to make the most of the surroundings.Today we include a city tour of nearby Galle, an old fortified city founded by Portuguese colonists in the 16th century, and later expanded by the Dutch.There are also a number of optional activities to enjoy in and around Unawatuna, and with two nights here, there's plenty of time to explore or simply take the opportunity to enjoy the surroundings and relax at the end of your enjoyable, activity-packed adventure.Upon arrival to Colombo, expect a busy and vibrant city with a mixture of modern life and colonial buildings. Enjoy driving through the Commercial area or the 'Fort', so named because both the Portuguese and Dutch had a fort here. We drive past 'Pettah', a hectic bazaar full of ancient vehicles, bargains, mosques and temples, then visit a Hindu temple and drive past Jumi-UL Alfar Jumma Mosque. We continue through the Wolvendaal Dutch Church, Hultsdorf Law courts, to the residential area of Cinnamon Gardens and on to Independence Square and Bandaranayake Memorial International Conference Hall.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/sri_lanka_327/sri_lanka_gold_budha_temple_20161111_1047369962.jpg", "countries": "Sri Lanka"}