{"title": "Delta & Deserts", "link": "https://www.tucantravel.com/tour/delta-and-deserts/afdd/", "dates": {"2020-04-11": "USD 700.00", "2020-05-16": "USD 700.00", "2020-06-20": "USD 700.00", "2020-07-25": "USD 700.00", "2020-08-08": "USD 700.00", "2020-08-29": "USD 700.00", "2020-09-12": "USD 700.00", "2020-10-03": "USD 700.00", "2020-11-07": "USD 700.00", "2020-12-12": "USD 700.00", "2021-01-16": "USD 740.00", "2021-02-20": "USD 740.00"}, "days": "18", "description": "A journey through some of southern Africa’s most popular countries, ending in the diverse and exciting Cape Town, nestled under Table Mountain. Feel the spray of the thunderous Victoria Falls, watch wildlife along the Chobe River, listen to the sounds of the Okavango Delta, far away from civilisation and bury your feet in rolling sand dunes in Namibia. This tour is packed with wildlife and unique eco-systems, all to be discovered We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Livingstone! The town, named after the great 19th century Scottish missionary explorer Dr David Livingstone, was once the bustling capital of Northern Rhodesia. Livingstone changed it's face and became a quiet town following the Capital’s relocation to Lusaka in 1935.Wonder the craft markets and pick up some unique souvenirs or chose from one of the many optional activities available in this area. Whether it be sunset cruises down the Zambezi, a visit to the Mukuni Cultural Village, river-boarding, white water rafting, canoeing, horse riding, abseiling, quad biking, kayaking, helicopter or microlight flights over the falls there is something for everyone.You are free to arrive today at your leisure. There will be a pre departure meeting this evening to meet your group and tour leader, please look out for information at reception.From Zambia we head to Botswana. We stay close to Chobe National Park which is home to the most diverse wildlife in Botswana. 11,000 square kilometres of wilderness, floodplains, forests and swamps support all manners of animal and birdlife. To gain a different perspective of the animals we embark on a sunset cruise along the Chobe River. Wildlife is plentiful and common along the water’s edge; as we glide by you may see elephants, buffalos, kudu, bushback, hippo, giraffe and sable.Located in north west Botswana, Chobe is a diverse area spanning from the border at the Chobe River, to the now dry Savute Channel and beyond to the borders of the Moremi Game Reserve and Okavango Delta. The park is divided into four distinctly different eco systems: Serondela with its lush plains and dense forests in the Chobe River area, the Savuti Marsh, the Linyanti Swamps and the dry hinterland and it is famous for having one of the largest game concentrations in the African continent.Please note: You will be required to pay a Tourism Levy of U$30 when entering Botswana. This is payable by cash or credit card.Our next stop is spent in a very unique location. You will be staying at Elephant Sands, a bush lodge set on private conservancy in the north-east part of Botswana. It is home to a huge amount of wildlife that roams free, especially elephants. You can enjoy the swimming pool and if you are lucky catch a sighting of one of these gentle giants! Elephant Sands is located near two waterholes which are only a few feet away.You will be staying in stilted tented camps and can enjoy a cocktail or two in the Elephant Sands bar.Driving across the top edge of the Kalahari Desert we reach the town of Maun, which will be our gateway for visiting the Okavango Delta, Africa's largest freshwater wetland.The Okavango Delta is a huge area of very slow flowing water fed by the Kavango River. The water fans out from the river into a labyrinth of channels, lagoons and palm-covered islands before evaporating over the sands of the Kalahari Desert.Today we will take a day trip to the small islands in the bush.  We will travel by hand-crafted mokoros (small boats with shallow drafts similar to canoes) through the delta. The canoes glide silently along the reed-fringed waterways, steered by stealthy polers who earn their living transporting travellers along the delta. We will also have walking safaris through the bush and a chance for a swim before returning to the hotel in Maun.Departing Maun we drive through Botswana towards Namibia and cross the border through a narrow strip of land known as the Caprivi Strip. Keep your eyes peeled as we drive through Mahongo Game Reserve as you may be lucky enough to spot zebra, giraffe, gazelle and elephants among other wildlife.Please note: A yellow fever vaccination is required if you are travelling to/from countries with risk of yellow fever transmission in Africa; this includes transiting through a yellow fever risk country. The Majority of our tours in Africa require a yellow fever certificate therefore we highly recommend that you obtain this prior to travel. Please make sure that on arrival you have a valid yellow fever certificate ready for inspection by local customs or health authorities, otherwise you could be refused entry or quarantined.Etosha National Park is one of the most memorable places you will visit on this trip with huge amounts of wildlife visiting the waterholes to drink. We have a full game drive to make the most of the fantastic wildlife-spotting opportunities.Today is a full day of driving to reach Etosha where you will enjoy a game drive tomorrow.We have a full game drive to make the most of the fantastic wildlife-spotting opportunities.Etosha National Park is one of the best places in Africa to spot cheetah and the endangered black rhino. Keep your camera lens ready for rare antelope species, the Burchell's zebra and black-faced impala's which roam the wild savannah. You may spot the odd giraffe or two chewing through thorny acacia trees in the woodland areas. Etosha National Park is a bird watcher's paradise with some 340 species inhabiting the park at different times of the year. For a short period after seasonal rains Etosha's vast salt pan is covered by a layer of water which attracts massive flocks of pelicans, flamingoes and other wading birds. While the pan is dry it is notable for the way it dramatically changes colour during the early morning and late afternoon sun.This morning we leave the Etosha National Park area and make our way towards Otjiwarongo. We travel through the Namibian landscape for around four hours to reach the Cheetah Sanctuary where we will stop for a few hours. After arrival to the sanctuary we will enjoy an introduction to the centre and the work that they do, including a tour of the centre, museum, clinic and creamery. You will witness the cheetahs being fed and also meet the other livestock that live in the centre.Following this you can enjoy an optional Cheetah drive excursion where you have the opportunity to witness these beautiful creatures up close.Later in the afternoon we have a short drive to our final destination for the night, Otjiwarongo.Our next stop will be the charming coastal town of Swakopmund, a historic colonial German town surrounded by desert and sweeping sand dunes which meet with the Atlantic Ocean. It is Namibia's most popular holiday destination. We spend two nights here, so you can wander around town viewing the colonial architecture or perhaps enjoy a cold locally brewed beer or two. If you would prefer to fuel your thirst for adrenaline then there is a wide range of optional excursions available. The town also has a good selection of bars and restaurants to cater for every taste. The seafood here is great!Today you are free to enjoy more of Swakopmund.From the coast we head inland again, making our way east towards Windhoek, Namibia’s capital city. At an elevation of 1650 metres, Windhoek lies in a beautiful valley and is surrounded by the Eros Mountains in the north and the Auas mountains to the south. This is the only city in Namibia and is home to a population of over 250,000 inhabitants.Like in Swakopmund there is a noticeable German influence here. German is still widely spoken and it is common to find traditional breads, sausage, and other delicacies, they even hold annual beer festivals.No tourists visit to Windhoek is complete without paying a visit to Joe’s Beer house, a bar and restaurant providing a mix of warm Namibian and German hospitality. This place is full of old relics from ‘Joe’s’ travels and creates a great atmosphere for socialising and reminiscing about your journey so far. Here you can also opt to sample some delicious game meats or try out one of the many craft beers on offer.Departing the capital we drive towards the Tropic of Capricorn where we make a stop so that you can get that obligatory picture with the sign. From here we continue on to Solitaire, a small settlement in the Khomas Region of Central Namibia, close to the Namib-Naukluft National Park. This small desert community has only a gas station, post office, bakery and general store. As you step off the truck you will feel as though you have stepped back in time onto a movie set, surrounded by cacti and old vehicle carcasses partially submerged in the sand.We arrive in Sesriem staying just outside Sesriem Canyon park.This morning you have the option to hike to the top of Dune 45 for incredible views over the Namib Desert. We will also visit Sossusvlei and Deadvlei where the dark camel thorn trees against the white floor provide fantastic photo opportunities. This place really is a photographer’s paradise.We continue south to Orange River, known locally in Afrikaans as Oranjerivier. This is South Africa’s longest river and runs along the border of Namibia and South Africa.  En-route to Orange River we stop at Fish River Canyon which is one of the world's largest canyons and it is quite breathtaking in its immensity; it is rivalled only by the Grand Canyon in North America for sheer grandeur. We will park at the viewpoint overlooking the canyon and can take a short walk along the canyon rim, stopping along the way for photos.The Fish River running through the bottom of the canyon is one of Namibia's few permanent rivers and while the flow is seasonal, beautiful turquoise pools can be seen in the distance during the dry season. As you walk and enjoy the colours of the strata and rugged scenery, you may be lucky enough to spot hardy mountain animals in the distance, as well as numerous bird species. Weather depending we will have lunch at the viewpoint.As we head towards Cape Town we make a stop in the Cederberg wilderness area with its rugged landscape criss-crossed by streams, waterfalls, cool pools and amazing natural rock formations. Here you will get to sample some of the local wines on our included wine tasting tour.Situated on the south western tip of Africa and set between the Atlantic Ocean and the iconic Table Mountain, Cape Town is recognised as one of the most beautiful cities on Earth.There are dozens of amazing sightseeing opportunities to enjoy in Cape Town and in the surrounding area. You can tackle a trek up Table Mountain or take the cable car to the top for spectacular views of the city. If you have a good head for heights you can enjoy the scenery looking over Camps Bay then rather than taking the cable car, abseil 112 metres down again, but this option is not one for the faint hearted! The V&A Waterfront is the very epitome of African chic and offers a unique shopping and entertainment environment where you can soak up the cosmopolitan vibe of the city. Be sure to sample some of South Africa's famous wines with dinner and sit back with a hot cup of rooibos herbal tea afterwards.From Cape Town, you can visit Robben Island where former South African President and Nobel Laureate Nelson Mandela was incarcerated among other political prisoners. Once a blight on the nation's history, the island is now seen as a national symbol of triumph over adversity and has been recognised by UNESCO as a World Heritage Site. If you want to arrange this activity, it is advised that you book in advance to avoid disappointment. Excursions to the island are weather dependant.Please note:We highly recommend booking post tour accommodation in Cape Town to enjoy all the activities on offer.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/botswana_101/botswana_mokoro_20161111_1291924867.jpg", "countries": "Zambia, Botswana, Namibia, South Africa"}