{"title": "Highlights of Africa", "link": "https://www.tucantravel.com/tour/highlights-of-africa/afha/", "dates": {"2020-04-11": "USD 2960.00", "2020-05-16": "USD 2960.00", "2020-06-20": "USD 2960.00", "2020-07-04": "USD 2960.00", "2020-07-25": "USD 2960.00", "2020-08-08": "USD 2960.00", "2020-08-29": "USD 2960.00", "2020-10-03": "USD 2960.00", "2020-11-07": "USD 2960.00", "2020-12-12": "USD 2960.00", "2021-01-16": "USD 3100.00"}, "days": "53", "description": "The ultimate adventure for anyone travelling to Africa, spend 53 days travelling from Nairobi to Cape Town. Packed with iconic sights, amazing safaris and jaw-dropping landscapes, it is the perfect tour for anyone wanting to see the best of the continent. We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Nairobi and the start of your adventure! Kenya’s capital city is a hub for business and culture with an inner population of around 3.5 million.You are free to arrive today at your leisure. If you wish to go exploring, we recommend seeking local advice from the hotel about where is safe to walk. Petty theft is unfortunately common in Nairobi and you should remain vigilant at all times.There will be a pre departure meeting tonight to meet your tour leader and fellow travellers. Please look out for information on reception.After breakfast this morning we transfer to Nairobi Airport to take our flight to Kigali, Rwanda’s capital. Kigali is the largest city of Rwanda, and is a large cultural and commercial hub.Kigali has had a turbulent past and was the scene of the Rwandan Genocide which you will learn more about tomorrow. In recent years, it has transformed and is now one of the most attractive cities in Africa with pretty boulevards, tasty restaurants and a lively atmosphere. On arrival the rest of your afternoon / evening is free to relax.After breakfast you will be collected from your hotel and taken on a private guided tour to visit the Kigali Genocide Memorial Centre where you will learn about the recent history of the Rwandan Genocide and the mass execution of the Tutsi population.We will make a brief stop for lunch before leaving the capital. We will pass through lush countryside, and rolling plantations, seeing many locals go about their daily lives before crossing the border into Uganda, where we will then be transferred to Lake Bunyonyi, arriving late afternoon.Lake Bunyonyi is our base for the next few days and will be the start point for our excursion to see endangered mountain gorillas in the Bwindi Impenetrable Forest. There are believed to be less than 800 mountain gorillas remaining in the world, and about half of that population live in this forest. To watch them in their natural habitat is a heart-stirring experience.Please note: A yellow fever vaccination is required if you are travelling to/from countries with risk of yellow fever transmission in Africa; this includes transiting through a yellow fever risk country. The Majority of our tours in Africa require a yellow fever certificate therefore we highly recommend that you obtain this prior to travel. Please make sure that on arrival you have a valid yellow fever certificate ready for inspection by local customs or health authorities, otherwise you could be refused entry or quarantined.Today can be quite a long day so make sure you pack enough water in your day bag to keep hydrated on your trek. To reach the trekking starting point, we will be picked up early in the morning to head for the national park. Expect to trek for up to eight hours today as specialist guides go ahead of you, early in the morning and track the gorilla spoor and look for signs of the gorillas last movements. The distance you trek is unpredictable and varies depending on how active the gorillas are. Some will not move far from where the trackers left them the day before while others will travel long distances in the search for food.Bwindi Impenetrable Forest is a series of rolling hills with heavy foliage and trekking to the gorillas can often involve steep uphill or downhill climbs, sometimes on uneven and wet terrain. Hiking boots are important and you can rent walking sticks at an extra cost to stabilise your feet. The altitude in the forest is varied, with the highest point being 2607m above sea level and 60% of it being over 2000m. With this in mind, you might find hiking through the terrain slightly more difficult than at sea level. Your guides will keep you give you a detailed safety briefing before you depart on the hike and will reiterate key points shortly before getting close to the gorillas.Your time with the gorillas is restricted to one hour. This is to safeguard the gorilla families and prevent excessive human contact. You can admire the animals and take photos so make sure your batteries are charged and your memory cards empty. Once your hour is up, you will begin the climb out of the forest. Your guides will take you to the nearest road where a 4WD should be waiting to take you back to camp.You can read more about the gorilla trek here.Today you will have a free morning to relax and recuperate after your trek. Alternatively if you wish to explore the area a little more, then you can opt to visit some of the nearby villages, take a swim in the lake or walk up to some of the amazing viewpoints which overlook the area.Lake Bunyonyi is around 29 kilometres long and 7 kilometres wide, dotted by 29 islands. Look out for Uganda's national bird, the crested crane, among the 200 other bird species in the area.After experiencing the beautiful scenery, spectacular wildlife and welcoming local communities of Lake Bunyonyi, we will be transported to meet our custom built overland expedition vehicle in the town of Kabale. From here we will make our way to Uganda’s capital, Kampala. En route to Kampala we will be passing townships and local markets and will also make a stop at the equator to get that all essential picture of you with one foot in the Southern and one foot in the Northern Hemisphere! The equator has some of the best opportunities to purchase souvenirs in all of East Africa.After breakfast we head towards the source of the mighty Nile River.Jinja is known for being the adventure sports hub of Uganda and offers world-class white water rafting on the Nile River as well as quad biking and mountain biking. There is plenty to entertain you in this buzzing town!!Today you are free to explore Jinja.For those who want a more relaxing experience you will have the opportunity to go for a refreshing swim in the Nile, take a walk through the local villages or visit the markets - depending on the day of the week.Today we head to Lake Naivasha where we will spend two nights. Here you will have a full free day to explore the area and choose from many of the optional activities on offer.Due to our location at Lake Naivasha you may awake to some unusual sound effects in the morning as the wildlife roam.Explore the nearby Hell's Gate National Park on foot or by bicycle on a half day tour. With no predators present this is one of the few parks in Africa where you can enter on foot and walk beside wildlife such as giraffe, zebra, gazelle and warthogs to mention a few while taking in the amazing scenery that surrounds you. Don’t miss a walk through the beautiful and impressive Hell’s Gate Gorge and see why it inspired the stampede scene in Disney’s Lion King.You can also visit Elsamere, the former home of the late Joy Adamson, who became famous for her relationship with the lioness Elsa in the film Born Free.We depart Naivasha early, after breakfast and drive to our lunch spot where we will exchange our expedition truck for 4WD safari van before continuing on to the Masai Mara Nature Reserve. On arrival we get straight into our first game drive in one of the world's most famous and expansive wildlife reserves.Covering over 1,500 square kilometres and providing habitat for thousands of animals, the Masai Mara Nature Reserve is deservedly one of Kenya’s most popular safari spots. Animals present in the reserve include the big five (lions, elephants, Cape buffaloes, leopards and rhinoceros), various grazing mammals which attract carnivores such as cheetahs, hyenas and jackals, and over 500 recorded species of birds. We stay just outside the park in permanent tents, enjoying a buffet dinner in the evening.This morning we leave camp early for a second game drive, visiting the mighty Mara River. During the annual Great Migration, this is the setting for the thunderous display of thousands of wildebeest crossing the river while canny crocodiles lie in wait. At any time of year, the river is vitally important to the ecosystem and a good spot to view animals. You will also have the opportunity to visit a local Masai village, learning about the vibrant, semi-nomadic herders’ way of life and join them in a local dance.Today we leave the incredible Masai Mara behind and head back to Nairobi where you have the rest of the day free at your leisure.Today we visit the elephant orphanage and experience the feeding before making our way to the Giraffe centre. Spend time learning more about the wildlife at the educational centre and take snaps of these magnificent creatures. We will then arrive back mid-late afternoon and you have the evening free to relax.Crossing the border into Tanzania, we make our way to Arusha. It is here that we will prepare to enter the Serengeti National Park and Ngorongoro Crater. You will stay here for the night, leaving your belongings with the truck and taking only an overnight bag on your included excursion to the Serengeti NP and Ngorongoro Crater tomorrow.A place that needs no introduction, the Serengeti National Park is the most famous safari destination in Africa. We’re picked up after breakfast and taken by 4WD to the national park. The afternoon is spent game driving to our lodge, located inside the national park to maximise our time and wildlife viewing opportunities.Before we reach the Serengeti plains, we’ll stop for a stunning vista overlooking the Ngorongoro Crater, the largest unbroken, unflooded caldera in the world. The vast 300 square kilometre crater stretches out in front of you in a kaleidoscope of blues and greens and it’s not until you spot the barely discernible grey speck of an elephant that you truly grasp its scale.Our second day in the park is a full day of game driving, trying to spot the more elusive members of the animal kingdom before heading to our lodge just outside the Ngorongoro Crater.Every safari is unique and you will never know what’s in store for you until you arrive. Among the hundreds of species in the park, you may encounter zebra, giraffe, wildebeest, buffalo, lion, cheetah, leopard, hippopotamus, hyena, elephant, vulture, monkey, warthog, gazelle and impala. Each season offers a different highlight.Our final morning game driving is spent inside the crater itself - a good place to spot black rhinoceros, elephant and lions.This afternoon, we return to stay in Arusha and reunite with the overland truck.Today we are bound for the enigmatic, intoxicating Isles of Zanzibar. We will transfer to Arusha Airport to take our flight to the paradise island. Arriving in Zanzibar we head to Stone Town where we will spend our first night on the Island.On arrival at our hotel in Stone Town you are free to explore the labyrinth of walled streets, winding alleys, bustling markets and grand crumbling architecture. This UNESCO-listed Stone Town has changed little over the past 200 years. If you enjoy shopping then there are plenty of crafts and colourful souvenirs to be purchased here. Admire the intriguingly decorated elephant-proof doors before sitting down to watch the sun set with a fresh juice, cold beer or cocktail. If the thought of fresh seafood gets the taste buds tingling, make sure you check out the excellent night market on the promenade which serves a feast not to be missed!Today we head to Nungwi Beach. On the way we will stop at one of the many spice plantations where we can discover the abundant plants that flourish in this verdant, tropical environment and sample spices picked straight from the source. We will also visit a small village, having the chance to interact with the locals and experience their kind hospitality; here we will enjoy a traditional lunch cooked by community.We arrive in Nungwi early afternoon and start enjoying this sun kissed paradise. Indulge in a cocktail or two while we watch the sunset over the crystal clear Indian Ocean.Today you are free to relax on the white coral sands or enjoy one of the many water based activities on the island. Snorkel with colourful marine life or simply kick back and soak up the sun. This beautiful setting will certainly provide you with a chance to relax and unwind!With a host of bars and fresh seafood restaurants dotted along the beach there is plenty for every taste.After breakfast we will head to the airport, where we will leave behind our paradise island and fly to Johannesburg in South Africa, transferring to accommodation in Pretoria. This short flight connects east Africa with southern Africa. After arrival you will have the remainder of the day free.Please note that the group will fly to Pretoria without a tour leader and you will meet your next tour leader at the hotel in Pretoria. A local representative will drop you off at the airport and assist with check in, and another will collect the group at the other end.Today you will have a free day to explore Pretoria. Why not visit some of the fascinating museums devoted to subjects as diverse as apartheid, Nelson Mandela, gold, beer and traditional African medicine? There are also plenty of other options, including the Walter Sisulu Botanical Gardens, or you could meet the healers at the Mai Mai market. You may also choose to visit the Soweto Township on a professional guided tour.After breakfast we say goodbye to South Africa temporarily and head into Africa’s smallest country - The Kingdom of Swaziland. This beautifully diverse territory is known for its wilderness reserves, arts and crafts, festivals and traditional rich cultural heritage.Making our way towards Mlilwane Wildlife Sanctuary located in the Ezulwini Valley we pass through stunning countryside and small villages before reaching our accommodation where we spend the next two nights.As Swaziland is comparatively small to most other African countries, Mlilwane provides an excellent base from where you can explore many different areas of this incredible kingdom.The next two days will be free time for you to take on a few exciting activities with many different options to choose from. How about taking a morning cycle or walk through Mlilwane Wildlife Sanctuary amongst herds of relaxed wild animals? Here you can admire the grassy plains, tranquil lakes and stunning mountain backdrops (there may even be time to take a dip in one of the mountain streams or warm springs), before visiting the Mantenga Cultural Village where you can enjoy some of Africa’s best traditional cultural song and dance performances.Today is your last free day in Swaziland. If you would prefer something a little more adventurous then you might opt to participate in some zip-lining or take a canopy tour in the Malolotja Reserve located in the in the North West of the country where you can also visit the Phophonyane Falls, Maguga Dam, Ngwempisi Rock Art and the old mining town of Bulembu.Today we leave Swaziland behind and re-enter South Africa. Located just outside the borders of Kruger National Park, Hazyview is a small town in South Africa's Mpumalanga province. We will make our way to Hazyview via the Blyde Dam Loop with a number of scenic wonders such as God's Window, the world renowned Blyde River Canyon, as well as the Lisbon Falls.We have an early morning start to get to Kruger National Park where we search for the big five.Kruger National Park is South Africa's premier game reserve, regarded as one of the finest in Africa. Here you'll have the chance to experience the vast diversity of wildlife as we explore some of the two million hectares of the park. The big five game animals of Africa are richly represented here – lion, leopard, African buffalo, African elephant and the white rhino in large numbers. On our first night we will stay inside the National Park so we can awake early for a full days game drive. On the second night we will be staying either in or nearby the park.This morning you will enjoy another game drive spotting more animal action in the national park. We then make our way to our next accommodation for tonight which will be in or around the park.After breakfast we head towards Tshipise, a small town close to the border of Zimbabwe.We leave South Africa and cross the border into Zimbabwe, making our way to the town of Bulawayo which will be our base for exploring Matobo National Park.situated in the awe-inspiring Matobo Hills and occupying a total area of 44,500 hectares, Matobo National Park is home to a protection zone in which a large population of black and white rhinoceros are successfully breeding. Established in 1953, the park was awarded UNESCO World Heritage status in 2003.We take a full day excursion admiring the fantastic scenery, unique rock formations and Bushman paintings, whilst learning about the local flora and fauna. After our picnic lunch we enter Matobo National Park where we will take a short game drive before leaving our vehicle and continuing on foot, allowing us to get closer to the magnificent rhinoceros and other animal species which roam the park. Time permitting we may also have the opportunity to fit in an optional visit to ‘Worlds View’ located on Malindidzimu Hill (The dwelling place of benevolent spirits). Apart from providing magnificent views of the Matobos region, this site also houses the grave of British Colonist Cecil John Rhodes, who requested to be buried here after passing away in 1902.We depart Bulawayo and drive north towards one of Africa’s greatest attractions and one of the most spectacular waterfalls in the world. With a length of over one kilometre and a height of over one hundred metres this magnificent natural wonder of cascading water defines the border separating Zimbabwe & Zambia. Depending on the wind direction you can hear the roar from the falls up to 40km away as it surges into Africa’s fourth biggest river, the mighty Zambezi.Tonight we will stay close to the action in the town of ‘Victoria Falls’You have a full free day to enjoy Victoria Falls and its activities.We leave Zimbabwe behind and cross the infamous Victoria Falls Bridge linking us with Zambia. Look out for the bungee jumpers who you may see plunging towards the Zambezi River from the bridge.Livingstone was named after the great 19th century Scottish missionary explorer Dr David Livingstone.  Once the bustling capital of Northern Rhodesia, Livingstone changed it's face and became a quiet town following the Capital’s relocation to Lusaka in 1935. We arrive at our accommodation this afternoon and the rest of the day is yours to enjoy as you wish.Today you are free to enjoy Livingstone.Wonder the craft markets and pick up some unique souvenirs or chose from one of the many optional activities available in this area. Whether it be sunset cruises down the Zambezi, a visit to the Mukuni Cultural Village, riverboarding, white water rafting, canoeing, horse riding, abseiling, quad biking, kayaking, helicopter or microlight flights over the falls there is something for everyone.From Zambia we head to Botswana. We stay close to Chobe National Park which is home to the most diverse wildlife in Botswana. 11,000 square kilometres of wilderness, floodplains, forests and swamps support all manners of animal and birdlife. To gain a different perspective of the animals we embark on a sunset cruise along the Chobe River. Wildlife is plentiful and common along the water’s edge; as we glide by you may see elephants, buffalos, kudu, bushback, hippo, giraffe and sable.Located in north west Botswana, Chobe is a diverse area spanning from the border at the Chobe River, to the now dry Savute Channel and beyond to the borders of the Moremi Game Reserve and Okavango Delta. The park is divided into four distinctly different eco systems: Serondela with its lush plains and dense forests in the Chobe River area, the Savuti Marsh, the Linyanti Swamps and the dry hinterland and it is famous for having one of the largest game concentrations in the African continent.Please note: You will be required to pay a Tourism Levy of U$30 when entering Botswana. This is payable by cash or credit card.Our next stop is spent in a very unique location. You will be staying at Elephant Sands, a bush lodge set on private conservancy in the north-east part of Botswana. It is home to a huge amount of wildlife that roams free, especially elephants. You can enjoy the swimming pool and if you are lucky catch a sighting of one of these gentle giants! Elephant Sands is located near two waterholes which are only a few feet away.You will be staying in stilted tented camps and can enjoy a cocktail or two in the Elephant Sands bar.Driving across the top edge of the Kalahari Desert we reach the town of Maun, which will be our gateway for visiting the Okavango Delta, Africa's largest freshwater wetland.The Okavango Delta is a huge area of very slow flowing water fed by the Kavango River. The water fans out from the river into a labyrinth of channels, lagoons and palm-covered islands before evaporating over the sands of the Kalahari Desert.Today we will take a day trip to the small islands in the bush.  We will travel by hand-crafted mokoros (small boats with shallow drafts similar to canoes) through the delta. The canoes glide silently along the reed-fringed waterways, steered by stealthy polers who earn their living transporting travellers along the delta. We will also have walking safaris through the bush and a chance for a swim before returning to the hotel in Maun.Departing Maun we drive through Botswana towards Namibia and cross the border through a narrow strip of land known as the Caprivi Strip. Keep your eyes peeled as we drive through Mahongo Game Reserve as you may be lucky enough to spot zebra, giraffe, gazelle and elephants among other wildlife.Please note: A yellow fever vaccination is required if you are travelling to/from countries with risk of yellow fever transmission in Africa; this includes transiting through a yellow fever risk country. The Majority of our tours in Africa require a yellow fever certificate therefore we highly recommend that you obtain this prior to travel. Please make sure that on arrival you have a valid yellow fever certificate ready for inspection by local customs or health authorities, otherwise you could be refused entry or quarantined.Etosha National Park is one of the most memorable places you will visit on this trip with huge amounts of wildlife visiting the waterholes to drink. We have a full game drive to make the most of the fantastic wildlife-spotting opportunities.Today is a full day of driving to reach Etosha where you will enjoy a game drive tomorrow.We have a full game drive to make the most of the fantastic wildlife-spotting opportunities.Etosha National Park is one of the best places in Africa to spot cheetah and the endangered black rhino. Keep your camera lens ready for rare antelope species, the Burchell's zebra and black-faced impala's which roam the wild savannah. You may spot the odd giraffe or two chewing through thorny acacia trees in the woodland areas. Etosha National Park is a bird watcher's paradise with some 340 species inhabiting the park at different times of the year. For a short period after seasonal rains Etosha's vast salt pan is covered by a layer of water which attracts massive flocks of pelicans, flamingoes and other wading birds. While the pan is dry it is notable for the way it dramatically changes colour during the early morning and late afternoon sun.This morning we leave the Etosha National Park area and make our way towards Otjiwarongo. We travel through the Namibian landscape for around four hours to reach the Cheetah Sanctuary where we will stop for a few hours. After arrival to the sanctuary we will enjoy an introduction to the centre and the work that they do, including a tour of the centre, museum, clinic and creamery. You will witness the cheetahs being fed and also meet the other livestock that live in the centre.Following this you can enjoy an optional Cheetah drive excursion where you have the opportunity to witness these beautiful creatures up close.Later in the afternoon we have a short drive to our final destination for the night, Otjiwarongo.Our next stop will be the charming coastal town of Swakopmund, a historic colonial German town surrounded by desert and sweeping sand dunes which meet with the Atlantic Ocean. It is Namibia's most popular holiday destination. We spend two nights here, so you can wander around town viewing the colonial architecture or perhaps enjoy a cold locally brewed beer or two. If you would prefer to fuel your thirst for adrenaline then there is a wide range of optional excursions available. The town also has a good selection of bars and restaurants to cater for every taste. The seafood here is great!Today you are free to enjoy more of Swakopmund.From the coast we head inland again, making our way east towards Windhoek, Namibia’s capital city. At an elevation of 1650 metres, Windhoek lies in a beautiful valley and is surrounded by the Eros Mountains in the north and the Auas mountains to the south. This is the only city in Namibia and is home to a population of over 250,000 inhabitants.Like in Swakopmund there is a noticeable German influence here. German is still widely spoken and it is common to find traditional breads, sausage, and other delicacies, they even hold annual beer festivals.No tourists visit to Windhoek is complete without paying a visit to Joe’s Beer house, a bar and restaurant providing a mix of warm Namibian and German hospitality. This place is full of old relics from ‘Joe’s’ travels and creates a great atmosphere for socialising and reminiscing about your journey so far. Here you can also opt to sample some delicious game meats or try out one of the many craft beers on offer.Departing the capital we drive towards the Tropic of Capricorn where we make a stop so that you can get that obligatory picture with the sign. From here we continue on to Solitaire, a small settlement in the Khomas Region of Central Namibia, close to the Namib-Naukluft National Park. This small desert community has only a gas station, post office, bakery and general store. As you step off the truck you will feel as though you have stepped back in time onto a movie set, surrounded by cacti and old vehicle carcasses partially submerged in the sand.We arrive in Sesriem staying just outside Sesriem Canyon park.This morning you have the option to hike to the top of Dune 45 for incredible views over the Namib Desert. We will also visit Sossusvlei and Deadvlei where the dark camel thorn trees against the white floor provide fantastic photo opportunities. This place really is a photographer’s paradise.We continue south to Orange River, known locally in Afrikaans as Oranjerivier. This is South Africa’s longest river and runs along the border of Namibia and South Africa.  En-route to Orange River we stop at Fish River Canyon which is one of the world's largest canyons and it is quite breathtaking in its immensity; it is rivalled only by the Grand Canyon in North America for sheer grandeur. We will park at the viewpoint overlooking the canyon and can take a short walk along the canyon rim, stopping along the way for photos.The Fish River running through the bottom of the canyon is one of Namibia's few permanent rivers and while the flow is seasonal, beautiful turquoise pools can be seen in the distance during the dry season. As you walk and enjoy the colours of the strata and rugged scenery, you may be lucky enough to spot hardy mountain animals in the distance, as well as numerous bird species. Weather depending we will have lunch at the viewpoint.As we head towards Cape Town we make a stop in the Cederberg wilderness area with its rugged landscape criss-crossed by streams, waterfalls, cool pools and amazing natural rock formations. Here you will get to sample some of the local wines on our included wine tasting tour.Situated on the south western tip of Africa and set between the Atlantic Ocean and the iconic Table Mountain, Cape Town is recognised as one of the most beautiful cities on Earth.There are dozens of amazing sightseeing opportunities to enjoy in Cape Town and in the surrounding area. You can tackle a trek up Table Mountain or take the cable car to the top for spectacular views of the city. If you have a good head for heights you can enjoy the scenery looking over Camps Bay then rather than taking the cable car, abseil 112 metres down again, but this option is not one for the faint hearted! The V&A Waterfront is the very epitome of African chic and offers a unique shopping and entertainment environment where you can soak up the cosmopolitan vibe of the city. Be sure to sample some of South Africa's famous wines with dinner and sit back with a hot cup of rooibos herbal tea afterwards.From Cape Town, you can visit Robben Island where former South African President and Nobel Laureate Nelson Mandela was incarcerated among other political prisoners. Once a blight on the nation's history, the island is now seen as a national symbol of triumph over adversity and has been recognised by UNESCO as a World Heritage Site. If you want to arrange this activity, it is advised that you book in advance to avoid disappointment. Excursions to the island are weather dependant.Please note:We highly recommend booking post tour accommodation in Cape Town to enjoy all the activities on offer.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/botswana_101/botswana_mokoro_20161111_1291924867.jpg", "countries": "Rwanda, Uganda, Kenya, Tanzania, Swaziland, Zimbabwe, Zambia, Botswana, Namibia, South Africa"}