{"title": "Kruger to Vic Falls", "link": "https://www.tucantravel.com/tour/kruger-to-vic-falls/afkf/", "dates": {"2020-05-03": "USD 400.00", "2020-06-07": "USD 400.00", "2020-07-12": "USD 400.00", "2020-07-26": "USD 400.00", "2020-08-16": "USD 400.00", "2020-08-30": "USD 400.00", "2020-09-20": "USD 400.00", "2020-10-25": "USD 400.00", "2020-11-29": "USD 400.00", "2021-01-03": "USD 420.00", "2021-02-07": "USD 420.00"}, "days": "14", "description": "In two incredible weeks travel from Pretoria to Livingstone. Head to one of the smallest countries in Africa, Swaziland and learn about the cultures that define the country. Spot herds of zebra and families of lion stalking the plains in Kruger National Park and walk with rhinos from Bulawayo. You will finish the tour in Zambia where you can witness the powerful force of Victoria Falls! We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Pretoria! After check in you are free to relax or start exploring.Why not visit some of the fascinating museums devoted to subjects as diverse as apartheid, Nelson Mandela, gold, beer and traditional African medicine? There are also plenty of other options, including the Walter Sisulu Botanical Gardens, or you could meet the healers at the Mai Mai market. You may also choose to visit the Soweto Township on a professional guided tour.You are free to arrive today at your leisure. There will be a pre departure meeting this evening where you will meet your group and tour leader. Please check the hotel reception for details.After breakfast we say goodbye to South Africa temporarily and head into Africa’s smallest country - The Kingdom of Swaziland. This beautifully diverse territory is known for its wilderness reserves, arts and crafts, festivals and traditional rich cultural heritage.Making our way towards Mlilwane Wildlife Sanctuary located in the Ezulwini Valley we pass through stunning countryside and small villages before reaching our accommodation where we spend the next two nights.As Swaziland is comparatively small to most other African countries, Mlilwane provides an excellent base from where you can explore many different areas of this incredible kingdom.The next two days will be free time for you to take on a few exciting activities with many different options to choose from. How about taking a morning cycle or walk through Mlilwane Wildlife Sanctuary amongst herds of relaxed wild animals? Here you can admire the grassy plains, tranquil lakes and stunning mountain backdrops (there may even be time to take a dip in one of the mountain streams or warm springs), before visiting the Mantenga Cultural Village where you can enjoy some of Africa’s best traditional cultural song and dance performances.Today is your last free day in Swaziland. If you would prefer something a little more adventurous then you might opt to participate in some zip-lining or take a canopy tour in the Malolotja Reserve located in the in the North West of the country where you can also visit the Phophonyane Falls, Maguga Dam, Ngwempisi Rock Art and the old mining town of Bulembu.Today we leave Swaziland behind and re-enter South Africa. Located just outside the borders of Kruger National Park, Hazyview is a small town in South Africa's Mpumalanga province. We will make our way to Hazyview via the Blyde Dam Loop with a number of scenic wonders such as God's Window, the world renowned Blyde River Canyon, as well as the Lisbon Falls.We have an early morning start to get to Kruger National Park where we search for the big five.Kruger National Park is South Africa's premier game reserve, regarded as one of the finest in Africa. Here you'll have the chance to experience the vast diversity of wildlife as we explore some of the two million hectares of the park. The big five game animals of Africa are richly represented here – lion, leopard, African buffalo, African elephant and the white rhino in large numbers. On our first night we will stay inside the National Park so we can awake early for a full days game drive. On the second night we will be staying either in or nearby the park.This morning you will enjoy another game drive spotting more animal action in the national park. We then make our way to our next accommodation for tonight which will be in or around the park.After breakfast we head towards Tshipise, a small town close to the border of Zimbabwe.We leave South Africa and cross the border into Zimbabwe, making our way to the town of Bulawayo which will be our base for exploring Matobo National Park.situated in the awe-inspiring Matobo Hills and occupying a total area of 44,500 hectares, Matobo National Park is home to a protection zone in which a large population of black and white rhinoceros are successfully breeding. Established in 1953, the park was awarded UNESCO World Heritage status in 2003.We take a full day excursion admiring the fantastic scenery, unique rock formations and Bushman paintings, whilst learning about the local flora and fauna. After our picnic lunch we enter Matobo National Park where we will take a short game drive before leaving our vehicle and continuing on foot, allowing us to get closer to the magnificent rhinoceros and other animal species which roam the park. Time permitting we may also have the opportunity to fit in an optional visit to ‘Worlds View’ located on Malindidzimu Hill (The dwelling place of benevolent spirits). Apart from providing magnificent views of the Matobos region, this site also houses the grave of British Colonist Cecil John Rhodes, who requested to be buried here after passing away in 1902.We depart Bulawayo and drive north towards one of Africa’s greatest attractions and one of the most spectacular waterfalls in the world. With a length of over one kilometre and a height of over one hundred metres this magnificent natural wonder of cascading water defines the border separating Zimbabwe & Zambia. Depending on the wind direction you can hear the roar from the falls up to 40km away as it surges into Africa’s fourth biggest river, the mighty Zambezi.Tonight we will stay close to the action in the town of ‘Victoria Falls’You have a full free day to enjoy Victoria Falls and its activities.We leave Zimbabwe behind and cross the infamous Victoria Falls Bridge linking us with Zambia. Look out for the bungee jumpers who you may see plunging towards the Zambezi River from the bridge.Livingstone was named after the great 19th century Scottish missionary explorer Dr David Livingstone.  Once the bustling capital of Northern Rhodesia, Livingstone changed it's face and became a quiet town following the Capital’s relocation to Lusaka in 1935. We arrive at our accommodation this afternoon and the rest of the day is yours to enjoy as you wish.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}