{"title": "Mara to Cape Town", "link": "https://www.tucantravel.com/tour/mara-to-cape-town/afmc/", "dates": {"2020-04-20": "USD 2270.00", "2020-05-25": "USD 2270.00", "2020-06-29": "USD 2270.00", "2020-07-13": "USD 2270.00", "2020-08-03": "USD 2270.00", "2020-08-17": "USD 2270.00", "2020-09-07": "USD 2270.00", "2020-10-12": "USD 2270.00", "2020-11-16": "USD 2270.00", "2020-12-21": "USD 2270.00", "2021-01-25": "USD 2380.00"}, "days": "44", "description": "An incredible trip through the wilds of Africa, we will visit some of the continent's greatest natural wonders, most endearing cultures and a selection of the national parks that have helped build Africa's reputation as the greatest safari location on earth. Starting in the east and finishing in the south, this 44 day adventure encompasses a selection of Africa's greatest sights and most breathtaking wildlife. We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Nairobi and the start of your African adventure! Kenya’s capital city acts as the country’s business and cultural hub with an inner population of around 3.5 million.You are free to arrive today at your leisure. If you wish to go exploring, we recommend seeking local advice from the hotel about where is safe to walk. Unfortunately petty theft is common in Nairobi, meaning you should remain vigilant at all times.There will be a pre departure meeting tonight to meet your tour leader and fellow travellers. Please look out for information on reception.Departing Nairobi early after breakfast we drive to our lunch spot and exchange our expedition truck for 4WD safari van before continuing on to the world famous Masai Mara Nature Reserve. On arrival we get straight into our first game drive, searching for the diverse wildlife that call this vast and varied wildlife reserve home.Covering over 1,500 square kilometres and providing a habitat for thousands of animals, the Masai Mara Nature Reserve is deservedly one of Kenya’s most popular safari spots. Animals that can be seen in the reserve include the big five (lions, elephants, Cape buffaloes, leopards and rhinoceros), as well as a variety of grazing mammals which in turn attract the attention carnivores such as cheetahs, hyenas and jackals. That evening we make our way just outside the park, staying in permanent tents and enjoying a buffet dinner after a day in the Serengeti.In the morning we leave camp early for our second game drive, visiting the mighty Mara River. During the annual Great Migration, this is the setting for the thunderous display of thousands of wildebeest crossing the river as canny crocodiles lie in wait under the water’s murky surface. If you aren’t planning to visit during the migration season don't fret - throughout the year the river is vitally important to the ecosystem and an excellent spot to view animals. You will also have the opportunity to visit a local Masai village, learning about the vibrant, semi-nomadic herders’ way of life and can join them in a local dance.Leaving the immense Masai Mara behind, today we head back to Nairobi where you have the rest of the day free at your leisure to explore more of the city or gain some much needed post-safari rest.Today we visit the incredible Sheldrick Wildlife Trust elephant orphanage, the most successful organisation of its kind on the planet, before making our way to the trust’s giraffe centre. The visit lets you experience the trust’s efforts first hand and spend time learning more about the wildlife found at the educational centre. We will then arrive back mid-late afternoon and have time in the evening to relax.Crossing the border into Tanzania, we make our way to Arusha at the base of the volcanic Mount Meru, where we will prepare to enter the Serengeti National Park and Ngorongoro Crater. You will stay here for the night, leaving your belongings with the truck and taking only an overnight bag on your included excursion to the Serengeti NP and Ngorongoro Crater the following day.A place that needs no introduction, the Serengeti National Park is the most famous safari destination in Africa. After being picked up post-breakfast we are taken by 4WD to the entrance of the notorious national park. The afternoon is spent game driving towards our lodge, which is located inside the national park, allowing for maximum time spent searching for the spectacular wildlife on show.Before we reach the Serengeti plains, we’ll stop for a stunning vista over the Ngorongoro Crater, the world’s largest unbroken, unflooded caldera. The vast 300 square kilometre crater stretches out in front of you in a kaleidoscope of blues and greens and it’s not until you spot the barely discernible grey speck of an elephant that you can truly grasp the extent of its colossal scale.Our second day in the park is a full day of game driving, trying to spot the more elusive members of Africa’s animal kingdom before heading to our lodge for the night just outside the Ngorongoro Crater.Every safari is unique and you will never know what’s in store for you until you arrive. Among the hundreds of species in the park, you may encounter zebra, giraffe, wildebeest, buffalo, lion, cheetah, leopard, hippopotamus, hyena, elephant, vulture, monkey, warthog, gazelle and impala. Each season offers a different highlight.Our final morning game driving is spent venturing around the inner plateau of the Ngorongoro Crater itself. The crater provides a good opportunity to spot black rhinoceros, elephants and lions.This afternoon, we return to stay in Arusha and reunite with the overland truck.Today we are bound for the enigmatic, intoxicating Isles of Zanzibar. We will transfer to Arusha Airport before taking our flight to the paradisiacal island. Arriving in Zanzibar we head to Stone Town where we will spend our first night on the island.On arrival at our hotel in Stone Town you are free to explore the labyrinth of walled streets, winding alleys, bustling markets and grand crumbling architecture. This UNESCO-listed Stone Town has changed little over the past 200 years. If you enjoy shopping then there is a wide variety of colourful African crafts and souvenirs available for purchase here. Admire the intriguingly decorated elephant-proof doors before sitting down to watch the sun set with a fresh juice, cold beer or cocktail of your choice. If the thought of fresh seafood gets the taste buds tingling, make sure you check out the excellent night market on the promenade which serves a feast that not to be missed!Today we head to the idyllic white sands of Nungwi Beach. On the way we will stop at one of the area’s many spice plantations to discover more about the abundance of plants that flourish in this verdant, tropical environment and sample spices picked straight from the source. We will also visit a small village, offering a chance to interact with the locals and experience their kind hospitality; here we will enjoy a traditional lunch cooked by members of the community.We arrive in Nungwi early in the afternoon and start enjoying this sun kissed paradise. Lay back and indulge in a cocktail or two while observing the sun set over the crystal clear Indian Ocean.Today is all about relaxing, unwinding and recharging those batteries as you lay on the beach and bask in the heat of the African sun. For those of you who like to keep active there are a variety of water based activities available on the island, including snorkelling experiences with the rainbow of marine life.A host of bars and fresh seafood restaurants dotted along the beach ensure that all tastes are catered for.After breakfast we will head to the airport, leave behind our slice of paradise and make the shift from east Africa to southern Africa by flying to Johannesburg in South Africa, transferring to accommodation in Pretoria. After arrival you will have the remainder of the day free to explore the nation’s administrative capital. The gorgeous architecture, bustling markets and upmarket eateries make are sure to keep you satisfactorily occupied.Please note: the group will fly to Pretoria without a tour leader and you will meet your next tour leader at the hotel in Pretoria. A local representative will drop you off at the airport and assist with check in, before another will collect the group at the other end.Today you will have a free day to explore Pretoria. Why not visit some of the fascinating museums devoted to subjects as diverse as apartheid, Nelson Mandela, gold, beer and traditional African medicine? If museums don't take your fancy there are plenty of other options, including the Walter Sisulu Botanical Gardens, or meeting the healers at the Mai Mai market. You can also opt to visit the Soweto Township on a professional guided tour.After breakfast we say goodbye to South Africa temporarily as we head into Africa’s smallest country - the landlocked Kingdom of Swaziland. This beautifully diverse territory is known for its wilderness reserves, local arts and crafts, diverse festivals and rich cultural heritage.Making our way towards Mlilwane Wildlife Sanctuary in the Ezulwini Valley, we pass through stunning countryside and small villages before reaching our accommodation for the next two nights.As Swaziland is a relatively small nation, Mlilwane provides an excellent base from which to explore many different areas of this incredible kingdom.Today and tomorrow will be free time for you to take on a few exciting activities with many different options to choose from. How about taking a morning cycle or walk through grassy plains and tranquil lakes amongst herds of wild animals in Mlilwane Wildlife Sanctuary? You can even take a dip in one of the streams or warm springs as you gaze out at the gorgeous mountain backdrop. You can also visit the Mantenga Cultural Village and witness traditional African cultural song and dance performances.If you would prefer something a little more adventurous during your last free day in Swaziland then we recommend a visit to the rolling green slopes of the Malolotja Reserve in the North West of the country, where visitors have the option to partake in a ziplining adventure. Alternatively you could pay a visit to the Phophonyane Falls, Maguga Dam or the natural stone pillars and rock art of Ngwempisi.Today we leave Swaziland behind and re-enter South Africa as we head towards Hazyview, a small town located on the borders of the internationally renowned Kruger National Park.We will take the Blyde Dam Loop to Hazyview - a route that boasts a number of scenic wonders such as the otherworldly views from God's Window in the notoriously scenic Blyde River Canyon and the mesmerising water flow of Lisbon Falls.We have an early morning start to get to Kruger National Park, where we search for the big five.Kruger National Park is South Africa's premier game reserve, regarded as one of the finest in Africa. Here you'll have the chance to experience the vast diversity of wildlife as we explore some of the park’s astonishing two million hectares. The big five game animals of Africa are richly represented here – lion, leopard, African buffalo, African elephant and the white rhino - and in large numbers. On our first night we will stay inside the National Park, allowing for an early wakeup and full days game drive.This morning you will enjoy another game drive through Kruger in search of that incredible moment that you will cherish for the rest of your life.We then make our way to our next accommodation for tonight which will be in the park or nearby.After breakfast we set off for Tshipise, a small town close to the border of Zimbabwe, in preparation for our border crossing the following day.We say farewell to South Africa and cross the border into Zimbabwe, making our way to the town of Bulawayo, which will be our base for exploring Matobo National Park.Situated in the awe-inspiring, boulder-strewn Matobo Hills and occupying a total area of 44,500 hectares, Matobo National Park is home to a protection zone in which a large population of black and white rhinoceros are successfully breeding. The park is also home to the densest population of leopards in the world. Established in 1953, the park was awarded UNESCO World Heritage status in 2003.We take a full day excursion admiring the fantastic scenery, obscure boulder formations and Bushman paintings, whilst learning about the local flora and fauna. After our picnic lunch we enter Matobo National Park where we will take a short game drive before leaving our vehicle and continuing on foot, allowing us to get closer to the park’s magnificent wildlife.Time permitting we may also have the opportunity to fit in an optional visit to ‘Worlds View’ located atop Malindidzimu Hill. Aside from the magnificent 360 degree views of the Matobos region and spiritual aura, this site also houses the grave of Rhodesia’s founder, Cecil John Rhodes, who requested to be buried here.We depart Bulawayo and drive north towards one of Africa’s greatest attractions and one of the most spectacular waterfalls in the world. With a length of over one kilometre and a height of over one hundred metres this magnificent natural wonder of cascading water defines the border separating Zimbabwe and Zambia. Depending on the wind direction, you can hear the powerful roar from the fall’s water up to 40km away as it surges into Africa’s fourth biggest river, the mighty Zambezi.Tonight we will stay close to the action in the fall’s neighbouring town.You have a full free day to enjoy Victoria Falls and its activities, which include hiking, rafting and ziplining. If you are feeling brave you may be able to take a swim in Devils Pool (weather dependant), which teeters right on the cusp of the waterfall’s one hundred metre plummet.We leave Zimbabwe behind and cross the infamous Victoria Falls Bridge linking us with Zambia. Keep an eye open for bungee jumpers plunging towards the Zambezi River from the bridge’s edge.Livingstone was named after the great 19th century Scottish missionary explorer Dr David Livingstone. Once the bustling capital of Northern Rhodesia, Livingstone changed it's face and became a quiet town following the Capital’s relocation to Lusaka in 1935. We arrive at our accommodation this afternoon and the rest of the day is yours to enjoy as you wish. Visiting the orphaned lions and cheetahs at the Big Cat Centre or organise a visit to a nearby village to get a true taste of the local Zambian culture.On your second day in Livingstone you have more free time to explore what the area has to offer in the way of activities. Wander the craft markets or choose from one of the many optional activities available in this area. Whether it be sunset cruises down the Zambezi, horse riding, abseiling, quad biking, kayaking, helicopter or microlight flights over the falls there is something for everyone.From Zambia we make our way to Botswana. We stay close to Chobe National Park which is home to the most diverse wildlife in Botswana. 11,000 square kilometres of wilderness, floodplains, forests and swamps support all manner of wildlife. To gain a different perspective of the animals, we embark on a sunset cruise along the Chobe River. Wildlife is plentiful along the water’s edge; as we glide by you may see elephants, buffalos, kudu, bushbuck, hippo, giraffe and sable.Located in north west Botswana, Chobe is a diverse area spanning from the border at the Chobe River to the now dry Savute Channel and beyond to the borders of the Moremi Game Reserve. The park is divided into four distinctly different eco systems: Serondela with its lush plains and dense forests in the Chobe River area, the Savuti Marsh, the Linyanti Swamps and the dry hinterland and it is famous for having one of the largest game concentrations in the African continent.Please note: You will be required to pay a Tourism Levy of U$30 when entering Botswana. This is payable by cash or credit card.Our next stop is spent in the unique location of Elephant Sands, a bush lodge set on private conservancy in the north-east part of Botswana. It is home to a huge amount of wildlife, particularly elephants, that roam free. With two watering holes located just a few feet off site, you have a good chance of seeing these magical giants up close.You will be staying in stilted tented camps on site and can enjoy an evening cocktail or two in the Elephant Sands bar.Driving across the top edge of the orange expanse of the Kalahari Desert we reach the town of Maun, which will act as our gateway to the nearby Okavango Delta, Africa's largest freshwater wetland.The Okavango Delta is a gargantuan area of very slow flowing water fed by the Kavango River. The water gradually fans out from the river into a labyrinth of channels, lagoons and palm-covered islands before evaporating over the sands of the Kalahari Desert.Today we will venture to the small islands in the delta’s bush. Travelling by traditional hand-crafted mokoros (small boats with shallow drafts similar to canoes) through the delta’s waters. The canoes glide silently along the reed-fringed waterways, steered by stealthy polers who earn their living transporting travellers along the delta. Being on the water offers the chance of coming into close contact with its inhabitants - hippos, elephants and crocodiles.We will also experience a walking safari through the dense delta bush and have a chance to swim in the refreshing waters before returning to the hotel in Maun.Departing Maun we drive through Botswana towards Namibia and cross the border through the narrow Caprivi Strip. Keep your eyes peeled as we drive through Mahongo Game Reserve as you may be lucky enough to spot zebra, giraffe, gazelle and elephants among other wildlife.Please note: A yellow fever vaccination is required if you are travelling to/from countries with risk of yellow fever transmission in Africa; this includes transiting through a yellow fever risk country. The Majority of our tours in Africa require a yellow fever certificate therefore we highly recommend that you obtain this prior to travel. Please make sure that on arrival you have a valid yellow fever certificate ready for inspection by local customs or health authorities, otherwise you could be refused entry or even be quarantined.Famous for the dry salt pan lying almost entirely within its boundaries, Etosha National Park is brimming with wildlife due to the abundance of watering holes. It is notable for having the world’s largest population of the endangered black rhino.Today we have a full game drive to make the most of the fantastic wildlife-spotting opportunities.Etosha National Park is one of the best places in Africa to spot cheetah and the endangered black rhino as well as rare antelope species, the Burchell's zebra and black-faced impala's which roam the wild savannah. You may also spot the odd giraffe or two chewing through thorny acacia trees in the woodland areas. Etosha National Park is a bird watcher's paradise, with some 340 species inhabiting the park at different times of the year. For a short period after seasonal rains Etosha's vast salt pan is covered by a layer of water which attracts vast flocks of pelicans, flamingoes and other wading birds.This morning we leave Etosha National Park and make our way towards Otjiwarongo. On our way through the Namibian landscape we reach the Cheetah Sanctuary where we will enjoy an introduction to the centre and the work that they do. This includes a tour of the centre, museum, clinic and creamery. Witness the cheetahs being fed and also meet the other livestock that live in the centre.Following this you can enjoy an optional Cheetah drive excursion where you have the opportunity to witness these beautiful creatures up close.Later in the afternoon we have a short drive to our final destination for the night, Otjiwarongo.Our next stop will be the charming German coastal town of Swakopmund, a historic colonial town surrounded by desert and sweeping sand dunes which meet with the Atlantic Ocean. It is Namibia's most popular holiday destination.The day is yours to do as you please. Adrenaline junkies may opt to speed through the desert dunes on quad bikes or see the magnificent landscape from above as they skydive from a plane. For those after something with a slower tempo we recommend strolling around town’s colonial streets or perhaps enjoy a cold locally brewed beer or two. The town has a good selection of bars and restaurants to cater for every taste but the seafood is particularly delicious!Another day for you to explore what Swakopmund has on offer.From the coast we head inland again, making our way east towards Namibia’s capital city, Windhoek. Nestled amongst Namibia’s highlands at an elevation of 1650 metres, Windhoek lies in a beautiful valley, flanked by the Eros Mountains to the north and the Auas mountains to the south. This is the only city in Namibia and is home to a population of over 250,000 inhabitants.Like Swakopmund, there is a noticeable German influence here. German is still widely spoken and it is common to find traditional breads, sausage, and other delicacies. They even hold annual beer festivals.No tourist visit to Windhoek is complete without paying a visit to Joe’s Beerhouse, a bar and restaurant providing a mix of warm Namibian hospitality and Germanic beers and spirits. This place is full of old relics from ‘Joe’s’ travels and creates a great atmosphere for socialising and reminiscing about your journey so far. Here you can also opt to sample some delicious game meats or try out one of the many craft beers on offer.Departing the capital we drive through the Tropic of Capricorn, stopping on the way so that you can get that obligatory picture with the sign. From here we continue on to Solitaire, a small settlement in the Khomas Region of Central Namibia, close to the Namib-Naukluft National Park. This small desert community has only a gas station, post office, bakery and general store. As you step off the truck you will feel as though you have stepped onto a post-apocalyptic movie set, surrounded by cacti and the rusted carcasses of numerous old vehicles slowly sinking into the sand.We arrive in Sesriem, staying just outside Sesriem Canyon park.This morning you have the option to hike to the top of Dune 45 for remarkable views over the Namib Desert. We will also visit Sossusvlei and Deadvlei where the dark camel thorn trees against the white floor provide an otherworldly feel akin to that of a Salvador Dali painting. This place really is a photographer’s paradise.We continue south to Orange River, known locally in Afrikaans as Oranjerivier. This is South Africa’s longest river, running along the border with Namibia. En-route to Orange River we stop at Fish River Canyon, one of the world's largest canyons and quite breathtaking in its immensity. It is rivalled only by the Grand Canyon in North America for sheer grandeur. We will park at the viewpoint overlooking the canyon for a short walk along the canyon rim.The Fish River running through the bottom of the canyon is one of Namibia's few permanent rivers and, while the flow is seasonal, beautiful turquoise pools can be seen in the distance during the dry season. As you walk and enjoy the strata’s arrayed colour palette and rugged scenery, you may be lucky enough to spot hardy mountain animals in the distance. Weather depending, we will have lunch atop the viewpoint.As we head towards Cape Town we make a pit stop amongst the Cederberg area’s rugged landscape, criss-crossed by streams, waterfalls, pools and mesmerising natural rock formations. Here you will get to sample some of the local wines on our wine tasting tour.Situated on the south western tip of Africa and set between the Atlantic Ocean and the iconic Table Mountain, Cape Town is recognised as one of the most beautiful cities on Earth.There are dozens of amazing sightseeing opportunities to enjoy in Cape Town and in the surrounding area. You can tackle a trek up Table Mountain or take the cable car to the top for spectacular views of the city. If you have a good head for heights you can enjoy the scenery looking over Camps Bay then rather than taking the cable car, abseil 112 metres down again, but this option is not one for the faint hearted! The V&A Waterfront is the very epitome of African chic and offers a unique shopping and entertainment environment where you can soak up the cosmopolitan vibe of the city. Be sure to sample some of South Africa's famous wines with dinner and sit back with a hot cup of rooibos herbal tea afterwards.From Cape Town, you can visit Robben Island where former South African President and Nobel Laureate Nelson Mandela was incarcerated among other political prisoners. Once a blight on the nation's history, the island is now seen as a national symbol of triumph over adversity and has been recognised by UNESCO as a World Heritage Site. If you want to arrange this activity, it is advised that you book in advance to avoid disappointment. Excursions to the island are weather dependant.Please note:We highly recommend booking post tour accommodation in Cape Town to enjoy all the activities on offer.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}