{"title": "Mara to Victoria Falls", "link": "https://www.tucantravel.com/tour/mara-to-victoria-falls/afmv/", "dates": {"2020-04-20": "USD 1580.00", "2020-05-25": "USD 1580.00", "2020-06-29": "USD 1580.00", "2020-07-13": "USD 1580.00", "2020-08-03": "USD 1580.00", "2020-08-17": "USD 1580.00", "2020-09-07": "USD 1580.00", "2020-10-12": "USD 1580.00", "2020-11-16": "USD 1580.00", "2020-12-21": "USD 1580.00", "2021-01-25": "USD 1650.00"}, "days": "27", "description": "If you are looking for wildlife, this is a tour for you. A photographer’s dream, spot herds of zebras scattered on the vast plains of the Masai Mara, see big cats stalk their prey in the Serengeti and marvel at elephants from the Tucan Travel truck in Kruger National Park. You will also experience the idyllic beaches of Zanzibar and the bushpainting in Matobo National Park. We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Nairobi and the start of your adventure! Kenya’s capital city is a hub for business and culture with an inner population of around 3.5 million.You are free to arrive today at your leisure. If you wish to go exploring, we recommend seeking local advice from the hotel about where is safe to walk. Petty theft is unfortunately common in Nairobi and you should remain vigilant at all times.There will be a pre departure meeting tonight to meet your tour leader and fellow travellers. Please look out for information on reception.We depart Nairobi early, after breakfast and drive to our lunch spot where we will exchange our expedition truck for 4WD safari vehicle before continuing on to the Masai Mara Nature Reserve. On arrival we get straight into our first game drive in one of the world's most famous and expansive wildlife reserves.Covering over 1,500 square kilometres and providing habitat for thousands of animals, the Masai Mara Nature Reserve is deservedly one of Kenya’s most popular safari spots. Animals present in the reserve include the big five (lions, elephants, Cape buffaloes, leopards and rhinoceros), various grazing mammals which attract carnivores such as cheetahs, hyenas and jackals, and over 500 recorded species of birds. We stay just outside the park in permanent tents, enjoying a buffet dinner in the evening.The following morning we leave camp early for a second game drive, visiting the mighty Mara River. During the annual Great Migration, this is the setting for the thunderous display of thousands of wildebeest crossing the river while canny crocodiles lie in wait. At any time of year, the river is vitally important to the ecosystem and a good spot to view animals. You will also have the opportunity to visit a local Masai village, learning about the vibrant, semi-nomadic herders’ way of life and join them in a local dance.This morning we leave camp early for a second game drive, visiting the mighty Mara River. During the annual Great Migration, this is the setting for the thunderous display of thousands of wildebeest crossing the river while canny crocodiles lie in wait. At any time of year, the river is vitally important to the ecosystem and a good spot to view animals. You will also have the opportunity to visit a local Masai village, learning about the vibrant, semi-nomadic herders’ way of life and join them in a local dance.Today we leave the incredible Masai Mara behind and head back to Nairobi where you have the rest of the day free at your leisure.Today we visit the elephant orphanage and experience the feeding before making our way to the Giraffe centre. Spend time learning more about the wildlife at the educational centre and take snaps of these magnificent creatures. We will then arrive back mid-late afternoon and you have the evening free to relax.Crossing the border into Tanzania, we make our way to Arusha. It is here that we will prepare to enter the Serengeti National Park and Ngorongoro Crater. You will stay here for the night, leaving your belongings with the truck and taking only an overnight bag on your included excursion to the Serengeti NP and Ngorongoro Crater tomorrow.A place that needs no introduction, the Serengeti National Park is the most famous safari destination in Africa. We’re picked up after breakfast and taken by 4WD to the national park. The afternoon is spent game driving to our lodge, located inside the national park to maximise our time and wildlife viewing opportunities.Before we reach the Serengeti plains, we’ll stop for a stunning vista overlooking the Ngorongoro Crater, the largest unbroken, unflooded caldera in the world. The vast 300 square kilometre crater stretches out in front of you in a kaleidoscope of blues and greens and it’s not until you spot the barely discernible grey speck of an elephant that you truly grasp its scale.Our second day in the park is a full day of game driving, trying to spot the more elusive members of the animal kingdom before heading to our lodge just outside the Ngorongoro Crater.Every safari is unique and you will never know what’s in store for you until you arrive. Among the hundreds of species in the park, you may encounter zebra, giraffe, wildebeest, buffalo, lion, cheetah, leopard, hippopotamus, hyena, elephant, vulture, monkey, warthog, gazelle and impala. Each season offers a different highlight.Our final morning game driving is spent inside the crater itself - a good place to spot black rhinoceros, elephant and lions.This afternoon, we return to stay in Arusha and reunite with the overland truck.Today we are bound for the enigmatic, intoxicating Isles of Zanzibar. We will transfer to Arusha Airport to take our flight to the paradise island. Arriving in Zanzibar we head to Stone Town where we will spend our first night on the Island.On arrival at our hotel in Stone Town you are free to explore the labyrinth of walled streets, winding alleys, bustling markets and grand crumbling architecture. This UNESCO-listed Stone Town has changed little over the past 200 years. If you enjoy shopping then there are plenty of crafts and colourful souvenirs to be purchased here. Admire the intriguingly decorated elephant-proof doors before sitting down to watch the sun set with a fresh juice, cold beer or cocktail. If the thought of fresh seafood gets the taste buds tingling, make sure you check out the excellent night market on the promenade which serves a feast not to be missed!Today we head to Nungwi Beach. On the way we will stop at one of the many spice plantations where we can discover the abundant plants that flourish in this verdant, tropical environment and sample spices picked straight from the source. We will also visit a small village, having the chance to interact with the locals and experience their kind hospitality; here we will enjoy a traditional lunch cooked by community.We arrive in Nungwi early afternoon and start enjoying this sun kissed paradise. Indulge in a cocktail or two while we watch the sunset over the crystal clear Indian Ocean.Today you are free to relax on the white coral sands or enjoy one of the many water based activities on the island. Snorkel with colourful marine life or simply kick back and soak up the sun. This beautiful setting will certainly provide you with a chance to relax and unwind!With a host of bars and fresh seafood restaurants dotted along the beach there is plenty for every taste.After breakfast we will head to the airport, where we will leave behind our paradise island and fly to Johannesburg in South Africa, transferring to accommodation in Pretoria. This short flight connects east Africa with southern Africa. After arrival you will have the remainder of the day free.Please note that the group will fly to Pretoria without a tour leader and you will meet your next tour leader at the hotel in Pretoria. A local representative will drop you off at the airport and assist with check in, and another will collect the group at the other end.Today you will have a free day to explore Pretoria. Why not visit some of the fascinating museums devoted to subjects as diverse as apartheid, Nelson Mandela, gold, beer and traditional African medicine? There are also plenty of other options, including the Walter Sisulu Botanical Gardens, or you could meet the healers at the Mai Mai market. You may also choose to visit the Soweto Township on a professional guided tour.After breakfast we say goodbye to South Africa temporarily and head into Africa’s smallest country - The Kingdom of Swaziland. This beautifully diverse territory is known for its wilderness reserves, arts and crafts, festivals and traditional rich cultural heritage.Making our way towards Mlilwane Wildlife Sanctuary located in the Ezulwini Valley we pass through stunning countryside and small villages before reaching our accommodation where we spend the next two nights.As Swaziland is comparatively small to most other African countries, Mlilwane provides an excellent base from where you can explore many different areas of this incredible kingdom.The next two days will be free time for you to take on a few exciting activities with many different options to choose from. How about taking a morning cycle or walk through Mlilwane Wildlife Sanctuary amongst herds of relaxed wild animals? Here you can admire the grassy plains, tranquil lakes and stunning mountain backdrops (there may even be time to take a dip in one of the mountain streams or warm springs), before visiting the Mantenga Cultural Village where you can enjoy some of Africa’s best traditional cultural song and dance performances.Today is your last free day in Swaziland. If you would prefer something a little more adventurous then you might opt to participate in some zip-lining or take a canopy tour in the Malolotja Reserve located in the in the North West of the country where you can also visit the Phophonyane Falls, Maguga Dam, Ngwempisi Rock Art and the old mining town of Bulembu.Today we leave Swaziland behind and re-enter South Africa. Located just outside the borders of Kruger National Park, Hazyview is a small town in South Africa's Mpumalanga province. We will make our way to Hazyview via the Blyde Dam Loop with a number of scenic wonders such as God's Window, the world renowned Blyde River Canyon, as well as the Lisbon Falls.We have an early morning start to get to Kruger National Park where we search for the big five.Kruger National Park is South Africa's premier game reserve, regarded as one of the finest in Africa. Here you'll have the chance to experience the vast diversity of wildlife as we explore some of the two million hectares of the park. The big five game animals of Africa are richly represented here – lion, leopard, African buffalo, African elephant and the white rhino in large numbers. On our first night we will stay inside the National Park so we can awake early for a full days game drive. On the second night we will be staying either in or nearby the park.This morning you will enjoy another game drive spotting more animal action in the national park. We then make our way to our next accommodation for tonight which will be in or around the park.After breakfast we head towards Tshipise, a small town close to the border of Zimbabwe.We leave South Africa and cross the border into Zimbabwe, making our way to the town of Bulawayo which will be our base for exploring Matobo National Park.situated in the awe-inspiring Matobo Hills and occupying a total area of 44,500 hectares, Matobo National Park is home to a protection zone in which a large population of black and white rhinoceros are successfully breeding. Established in 1953, the park was awarded UNESCO World Heritage status in 2003.We take a full day excursion admiring the fantastic scenery, unique rock formations and Bushman paintings, whilst learning about the local flora and fauna. After our picnic lunch we enter Matobo National Park where we will take a short game drive before leaving our vehicle and continuing on foot, allowing us to get closer to the magnificent rhinoceros and other animal species which roam the park. Time permitting we may also have the opportunity to fit in an optional visit to ‘Worlds View’ located on Malindidzimu Hill (The dwelling place of benevolent spirits). Apart from providing magnificent views of the Matobos region, this site also houses the grave of British Colonist Cecil John Rhodes, who requested to be buried here after passing away in 1902.We depart Bulawayo and drive north towards one of Africa’s greatest attractions and one of the most spectacular waterfalls in the world. With a length of over one kilometre and a height of over one hundred metres this magnificent natural wonder of cascading water defines the border separating Zimbabwe & Zambia. Depending on the wind direction you can hear the roar from the falls up to 40km away as it surges into Africa’s fourth biggest river, the mighty Zambezi.Tonight we will stay close to the action in the town of ‘Victoria Falls’You have a full free day to enjoy Victoria Falls and its activities.We leave Zimbabwe behind and cross the infamous Victoria Falls Bridge linking us with Zambia. Look out for the bungee jumpers who you may see plunging towards the Zambezi River from the bridge.Livingstone was named after the great 19th century Scottish missionary explorer Dr David Livingstone.  Once the bustling capital of Northern Rhodesia, Livingstone changed it's face and became a quiet town following the Capital’s relocation to Lusaka in 1935. We arrive at our accommodation this afternoon and the rest of the day is yours to enjoy as you wish.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}