{"title": "Serengeti to Zanzibar", "link": "https://www.tucantravel.com/tour/serengeti-to-zanzibar/afsz/", "dates": {"2020-04-03": "USD 760.00", "2020-04-24": "USD 760.00", "2020-05-08": "USD 760.00", "2020-05-29": "USD 760.00", "2020-06-12": "USD 760.00", "2020-07-03": "USD 760.00", "2020-07-17": "USD 760.00", "2020-08-07": "USD 760.00", "2020-08-21": "USD 760.00", "2020-09-11": "USD 760.00", "2020-09-25": "USD 760.00", "2020-10-16": "USD 760.00", "2020-10-30": "USD 760.00", "2020-11-20": "USD 760.00", "2020-12-04": "USD 760.00", "2020-12-25": "USD 760.00", "2021-01-08": "USD 800.00", "2021-01-29": "USD 800.00"}, "days": "9", "description": "A perfect nine day tour combining some of the best wildlife viewing opportunities in east Africa with a few days on the beaches of the paradise island of Zanzibar. Enjoy lodges inside the Serengeti National Park and be one of the first vehicles to enter the Ngorongoro Crater before wandering Stone Town’s bustling markets. We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Nairobi and the start of your adventure! Kenya’s capital city is a hub for business and culture with an inner population of around 3.5 million.You are free to arrive today at your leisure. If you wish to go exploring, we recommend seeking local advice from the hotel about where is safe to walk. Petty theft is unfortunately common in Nairobi and you should remain vigilant at all times.There will be a pre departure meeting tonight to meet your tour leader and fellow travellers. Please look out for information on reception.Crossing the border into Tanzania, we make our way to Arusha. It is here that we will prepare to enter the Serengeti National Park and Ngorongoro Crater. You will stay here for the night, leaving your belongings with the truck and taking only an overnight bag on your included excursion to the Serengeti NP and Ngorongoro Crater tomorrow.A place that needs no introduction, the Serengeti National Park is the most famous safari destination in Africa. We’re picked up after breakfast and taken by 4WD to the national park. The afternoon is spent game driving to our lodge, located inside the national park to maximise our time and wildlife viewing opportunities.Before we reach the Serengeti plains, we’ll stop for a stunning vista overlooking the Ngorongoro Crater, the largest unbroken, unflooded caldera in the world. The vast 300 square kilometre crater stretches out in front of you in a kaleidoscope of blues and greens and it’s not until you spot the barely discernible grey speck of an elephant that you truly grasp its scale.Our second day in the park is a full day of game driving, trying to spot the more elusive members of the animal kingdom before heading to our lodge just outside the Ngorongoro Crater.Every safari is unique and you will never know what’s in store for you until you arrive. Among the hundreds of species in the park, you may encounter zebra, giraffe, wildebeest, buffalo, lion, cheetah, leopard, hippopotamus, hyena, elephant, vulture, monkey, warthog, gazelle and impala. Each season offers a different highlight.Our final morning game driving is spent inside the crater itself - a good place to spot black rhinoceros, elephant and lions.This afternoon, we return to stay in Arusha and reunite with the overland truck.Today we are bound for the enigmatic, intoxicating Isles of Zanzibar. We will transfer to Arusha Airport to take our flight to the paradise island. Arriving in Zanzibar we head to Stone Town where we will spend our first night on the Island.On arrival at our hotel in Stone Town you are free to explore the labyrinth of walled streets, winding alleys, bustling markets and grand crumbling architecture. This UNESCO-listed Stone Town has changed little over the past 200 years. If you enjoy shopping then there are plenty of crafts and colourful souvenirs to be purchased here. Admire the intriguingly decorated elephant-proof doors before sitting down to watch the sun set with a fresh juice, cold beer or cocktail. If the thought of fresh seafood gets the taste buds tingling, make sure you check out the excellent night market on the promenade which serves a feast not to be missed!Today we head to Nungwi Beach. On the way we will stop at one of the many spice plantations where we can discover the abundant plants that flourish in this verdant, tropical environment and sample spices picked straight from the source. We will also visit a small village, having the chance to interact with the locals and experience their kind hospitality; here we will enjoy a traditional lunch cooked by community.We arrive in Nungwi early afternoon and start enjoying this sun kissed paradise. Indulge in a cocktail or two while we watch the sunset over the crystal clear Indian Ocean.Today you are free to relax on the white coral sands or enjoy one of the many water based activities on the island. Snorkel with colourful marine life or simply kick back and soak up the sun. This beautiful setting will certainly provide you with a chance to relax and unwind!With a host of bars and fresh seafood restaurants dotted along the beach there is plenty for every taste.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your tour will end here on Nungwi Beach. If you would like to pre-book a transfer back to Stone Town please contact your Adventure Specialist.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/tanzania_158/tanzania_lion_cubs_20161111_1683559702.jpg", "countries": "Kenya, Tanzania"}