{"title": "Windhoek to Cape Town", "link": "https://www.tucantravel.com/tour/windhoek-to-cape-town/afwc/", "dates": {"2020-04-22": "USD 260.00", "2020-05-27": "USD 260.00", "2020-07-01": "USD 260.00", "2020-08-05": "USD 260.00", "2020-08-19": "USD 260.00", "2020-09-09": "USD 260.00", "2020-09-23": "USD 260.00", "2020-10-14": "USD 260.00", "2020-11-18": "USD 260.00", "2020-12-23": "USD 260.00", "2021-01-27": "USD 270.00", "2021-03-03": "USD 270.00"}, "days": "7", "description": "This whirlwind adventure whisks you through Namibia and South Africa stopping at sensational sights and jaw-dropping landscapes. Visit the unique town of Solitaire, speckled with vintage cars, and admire the golden colour of spectacular sand dunes found in the sweeping Namib desert. Heading into South Africa we stop at Cederberg where you can explore the local vineyards before ending in the buzzing city of Cape Town. We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Windhoek. At an elevation of 1650 metres, Windhoek lies in a beautiful valley and is surrounded by the Eros Mountains in the north and the Auas mountains to the south. This is the only city in Namibia and is home to a population over 250,000 inhabitants.Like in Swakopmund there is a noticeable German influence here. German is still widely spoken and it is common to find traditional breads, sausage, and other delicacies. They even hold annual beer festivals!No tourists visit to Windhoek is complete without paying a visit to Joe’s Beer house, a bar and restaurant providing a mix of warm Namibian and German hospitality. This place is full of old relics from ‘Joe’s’ travels and creates a great atmosphere for socialising. Here you can also opt to sample some delicious game meats or try out one of the many craft beers on offer.You are free to arrive today at your leisure. There will be a pre departure meeting this evening to meet your group and tour leader, please look out for information at reception.Please note: A yellow fever vaccination is required if you are travelling to/from countries with risk of yellow fever transmission in Africa; this includes transiting through a yellow fever risk country. The Majority of our tours in Africa require a yellow fever certificate therefore we highly recommend that you obtain this prior to travel. Please make sure that on arrival you have a valid yellow fever certificate ready for inspection by local customs or health authorities, otherwise you could be refused entry or quarantined.Departing the capital we drive towards the Tropic of Capricorn where we make a stop so that you can get that obligatory picture with the sign. From here we continue on to Solitaire, a small settlement in the Khomas Region of Central Namibia, close to the Namib-Naukluft National Park. This small desert community has only a gas station, post office, bakery and general store. As you step off the truck you will feel as though you have stepped back in time onto a movie set, surrounded by cacti and old vehicle carcasses partially submerged in the sand.We arrive in Sesriem staying just outside Sesriem Canyon park.This morning you have the option to hike to the top of Dune 45 for incredible views over the Namib Desert. We will also visit Sossusvlei and Deadvlei where the dark camel thorn trees against the white floor provide fantastic photo opportunities. This place really is a photographer’s paradise.We continue south to Orange River, known locally in Afrikaans as Oranjerivier. This is South Africa’s longest river and runs along the border of Namibia and South Africa.  En-route to Orange River we stop at Fish River Canyon which is one of the world's largest canyons and it is quite breathtaking in its immensity; it is rivalled only by the Grand Canyon in North America for sheer grandeur. We will park at the viewpoint overlooking the canyon and can take a short walk along the canyon rim, stopping along the way for photos.The Fish River running through the bottom of the canyon is one of Namibia's few permanent rivers and while the flow is seasonal, beautiful turquoise pools can be seen in the distance during the dry season. As you walk and enjoy the colours of the strata and rugged scenery, you may be lucky enough to spot hardy mountain animals in the distance, as well as numerous bird species. Weather depending we will have lunch at the viewpoint.As we head towards Cape Town we make a stop in the Cederberg wilderness area with its rugged landscape criss-crossed by streams, waterfalls, cool pools and amazing natural rock formations. Here you will get to sample some of the local wines on our included wine tasting tour.Situated on the south western tip of Africa and set between the Atlantic Ocean and the iconic Table Mountain, Cape Town is recognised as one of the most beautiful cities on Earth.There are dozens of amazing sightseeing opportunities to enjoy in Cape Town and in the surrounding area. You can tackle a trek up Table Mountain or take the cable car to the top for spectacular views of the city. If you have a good head for heights you can enjoy the scenery looking over Camps Bay then rather than taking the cable car, abseil 112 metres down again, but this option is not one for the faint hearted! The V&A Waterfront is the very epitome of African chic and offers a unique shopping and entertainment environment where you can soak up the cosmopolitan vibe of the city. Be sure to sample some of South Africa's famous wines with dinner and sit back with a hot cup of rooibos herbal tea afterwards.From Cape Town, you can visit Robben Island where former South African President and Nobel Laureate Nelson Mandela was incarcerated among other political prisoners. Once a blight on the nation's history, the island is now seen as a national symbol of triumph over adversity and has been recognised by UNESCO as a World Heritage Site. If you want to arrange this activity, it is advised that you book in advance to avoid disappointment. Excursions to the island are weather dependant.Please note:We highly recommend booking post tour accommodation in Cape Town to enjoy all the activities on offer.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}