{"title": "Maasai Mara & Serengeti", "link": "https://www.tucantravel.com/tour/maasai-mara-and-serengeti/ana/", "dates": {"2021-01-20": "USD 500.00", "2021-02-10": "USD 500.00", "2021-03-10": "USD 500.00", "2021-03-24": "USD 500.00", "2021-03-31": "USD 500.00", "2021-04-14": "USD 500.00", "2021-04-21": "USD 500.00", "2021-05-05": "USD 500.00", "2021-05-12": "USD 500.00", "2021-05-26": "USD 500.00", "2021-06-02": "USD 500.00", "2021-06-16": "USD 500.00", "2021-06-23": "USD 500.00", "2021-07-07": "USD 500.00", "2021-07-14": "USD 500.00", "2021-07-28": "USD 500.00", "2021-08-04": "USD 500.00", "2021-08-18": "USD 500.00", "2021-08-25": "USD 500.00", "2021-09-08": "USD 500.00", "2021-09-29": "USD 500.00", "2021-10-20": "USD 500.00", "2021-11-10": "USD 500.00", "2021-12-01": "USD 500.00", "2021-12-22": "USD 500.00"}, "days": "11", "description": "A We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Nairobi and the start of your adventure! Kenya’s capital city is a hub for business and culture with an inner population of around 3.5 million.You are free to arrive today at your leisure. If you wish to go exploring, we recommend seeking local advice from the hotel about where is safe to walk. Petty theft is unfortunately common in Nairobi and you should remain vigilant at all times.There will be a pre departure meeting tonight to meet your tour leader and fellow travellers. Please look out for information on reception.Today we head to Lake Naivasha where we will spend two nights. After a short three hour journey you will have a full free afternoon to explore the area and choose from many of the optional activities on offer.Due to our location at Lake Naivasha you may awake to some unusual sound effects in the morning as the wildlife roam.Today is another free day to enjoy the area. We recommend exploring the nearby Hell's Gate National Park on foot or by bicycle on a half day tour. With no predators present this is one of the few parks in Africa where you can enter on foot and walk beside wildlife such as giraffes, zebra, gazelle and warthogs, to mention a few, while taking in the amazing scenery that surrounds you. Don’t miss a walk through the beautiful and impressive Hell’s Gate Gorge and see why it inspired the stampede scene in Disney’s Lion King.You can also visit Elsamere, the former home of the late Joy Adamson, who became famous for her relationship with the lioness Elsa in the film Born Free.We depart Naivasha early and head to the Masai Mara Nature Reserve. On arrival at the lodge we will enjoy lunch before we get straight into our first game drive in one of the world's most famous and expansive wildlife reserves.Covering over 1,500 square kilometres and providing habitat for thousands of animals, the Masai Mara Nature Reserve is deservedly one of Kenya’s most popular safari spots. Animals present in the reserve include the big five (lions, elephants, Cape buffaloes, leopards and rhinoceros), various grazing mammals which attract carnivores such as cheetahs, hyenas and jackals, and over 500 recorded species of birds.This morning we leave camp early for a second game drive, which will last the full day, visiting the mighty Mara River and other corners of the reserve. During the annual Great Migration, this is the setting for the thunderous display of thousands of wildebeest crossing the river while canny crocodiles lie in wait. At any time of year, the river is vitally important to the ecosystem and a good spot to view animals. You will also have the opportunity to visit a local Masai village, learning about the vibrant, semi-nomadic herders’ way of life and join them in a local dance.Today we leave the incredible Masai Mara behind and head back to Nairobi where you have the rest of the day free at your leisure.Time permitting, it’s possible to visit the David Sheldrick Elephant Orphanage or the Nairobi Giraffe Centre. Both establishments work towards the conservation of these beautiful animals and offer the chance to see them up close.This morning we continue the adventure as we move onto Karatu - a town in northern Tanzania which makes for the perfect base to explore the Serengeti Nature Reserve and Ngorongoro Crater. After reaching Arusha, we say goodbye to the truck and transfer into 4WD vehicles to continue the last 2 hours to reach Karatu. Upon arrival you are free to relax before the exciting upcoming game drives. Karatu is a charming small town that’s bursting with safari vehicles and keen safari goers. There is a great selection of restaurants and bars to spend the evening in too.A place that needs no introduction, the Serengeti National Park is the most famous safari destination in Africa. We’re picked up after breakfast and taken by 4WD to the national park.The afternoon is spent game driving to our lodge, located inside the national park to maximise our time and wildlife viewing opportunities.Our second day in the park is a full morning of game driving, trying to spot the more elusive members of the animal kingdom before heading back to Karatu.Every safari is unique and you will never know what’s in store for you until you arrive. Among the hundreds of species in the park, you may encounter zebra, giraffe, wildebeest, buffalo, lion, cheetah, leopard, hippopotamus, hyena, elephant, vulture, monkey, warthog, gazelle and impala. Each season offers a different highlight.This morning we will experience the stunning vista overlooking the Ngorongoro Crater, the largest unbroken, unflooded caldera in the world. The vast 300 square kilometre crater stretches out in front of you in a kaleidoscope of blues and greens and it’s not until you spot the barely discernible grey speck of an elephant that you truly grasp its scale. We will also enjoy a game drive within the crater itself before continuing onto Arusha.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/kenya_125/kenya_giraffe_mara_20161116_1936177102.jpg", "countries": "Kenya, Tanzania"}