{"title": "Kenya to Cape Town", "link": "https://www.tucantravel.com/tour/kenya-to-cape-town/anc/", "dates": {"2021-01-20": "USD 1600.00", "2021-02-10": "USD 1600.00", "2021-03-10": "USD 1600.00", "2021-03-24": "USD 1600.00", "2021-03-31": "USD 1600.00", "2021-04-14": "USD 1600.00", "2021-04-21": "USD 1600.00", "2021-05-05": "USD 1600.00", "2021-05-12": "USD 1600.00", "2021-05-26": "USD 1600.00", "2021-06-02": "USD 1600.00", "2021-06-16": "USD 1600.00", "2021-06-23": "USD 1600.00", "2021-07-07": "USD 1600.00", "2021-07-14": "USD 1600.00", "2021-07-28": "USD 1600.00", "2021-08-04": "USD 1600.00", "2021-08-18": "USD 1600.00", "2021-08-25": "USD 1600.00", "2021-09-08": "USD 1600.00", "2021-09-29": "USD 1600.00", "2021-10-20": "USD 1600.00", "2021-11-10": "USD 1600.00", "2021-12-01": "USD 1600.00", "2021-12-22": "USD 1600.00"}, "days": "35", "description": "A We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Nairobi and the start of your adventure! Kenya’s capital city is a hub for business and culture with an inner population of around 3.5 million.You are free to arrive today at your leisure. If you wish to go exploring, we recommend seeking local advice from the hotel about where is safe to walk. Petty theft is unfortunately common in Nairobi and you should remain vigilant at all times.There will be a pre departure meeting tonight to meet your tour leader and fellow travellers. Please look out for information on reception.Today we head to Lake Naivasha where we will spend two nights. After a short three hour journey you will have a full free afternoon to explore the area and choose from many of the optional activities on offer.Due to our location at Lake Naivasha you may awake to some unusual sound effects in the morning as the wildlife roam.Today is another free day to enjoy the area. We recommend exploring the nearby Hell's Gate National Park on foot or by bicycle on a half day tour. With no predators present this is one of the few parks in Africa where you can enter on foot and walk beside wildlife such as giraffes, zebra, gazelle and warthogs, to mention a few, while taking in the amazing scenery that surrounds you. Don’t miss a walk through the beautiful and impressive Hell’s Gate Gorge and see why it inspired the stampede scene in Disney’s Lion King.You can also visit Elsamere, the former home of the late Joy Adamson, who became famous for her relationship with the lioness Elsa in the film Born Free.We depart Naivasha early and head to the Masai Mara Nature Reserve. On arrival at the lodge we will enjoy lunch before we get straight into our first game drive in one of the world's most famous and expansive wildlife reserves.Covering over 1,500 square kilometres and providing habitat for thousands of animals, the Masai Mara Nature Reserve is deservedly one of Kenya’s most popular safari spots. Animals present in the reserve include the big five (lions, elephants, Cape buffaloes, leopards and rhinoceros), various grazing mammals which attract carnivores such as cheetahs, hyenas and jackals, and over 500 recorded species of birds.This morning we leave camp early for a second game drive, which will last the full day, visiting the mighty Mara River and other corners of the reserve. During the annual Great Migration, this is the setting for the thunderous display of thousands of wildebeest crossing the river while canny crocodiles lie in wait. At any time of year, the river is vitally important to the ecosystem and a good spot to view animals. You will also have the opportunity to visit a local Masai village, learning about the vibrant, semi-nomadic herders’ way of life and join them in a local dance.Today we leave the incredible Masai Mara behind and head back to Nairobi where you have the rest of the day free at your leisure.Time permitting, it’s possible to visit the David Sheldrick Elephant Orphanage or the Nairobi Giraffe Centre. Both establishments work towards the conservation of these beautiful animals and offer the chance to see them up close.This morning we continue the adventure as we move onto Karatu - a town in northern Tanzania which makes for the perfect base to explore the Serengeti Nature Reserve and Ngorongoro Crater. After reaching Arusha, we say goodbye to the truck and transfer into 4WD vehicles to continue the last 2 hours to reach Karatu. Upon arrival you are free to relax before the exciting upcoming game drives. Karatu is a charming small town that’s bursting with safari vehicles and keen safari goers. There is a great selection of restaurants and bars to spend the evening in too.A place that needs no introduction, the Serengeti National Park is the most famous safari destination in Africa. We’re picked up after breakfast and taken by 4WD to the national park.The afternoon is spent game driving to our lodge, located inside the national park to maximise our time and wildlife viewing opportunities.Our second day in the park is a full morning of game driving, trying to spot the more elusive members of the animal kingdom before heading back to Karatu.Every safari is unique and you will never know what’s in store for you until you arrive. Among the hundreds of species in the park, you may encounter zebra, giraffe, wildebeest, buffalo, lion, cheetah, leopard, hippopotamus, hyena, elephant, vulture, monkey, warthog, gazelle and impala. Each season offers a different highlight.This morning we will experience the stunning vista overlooking the Ngorongoro Crater, the largest unbroken, unflooded caldera in the world. The vast 300 square kilometre crater stretches out in front of you in a kaleidoscope of blues and greens and it’s not until you spot the barely discernible grey speck of an elephant that you truly grasp its scale. We will also enjoy a game drive within the crater itself before continuing onto Arusha.Today we are bound for the enigmatic, intoxicating Isles of Zanzibar. We will transfer to Arusha Airport to take our flight to the paradise island. Arriving in Zanzibar we head to Stone Town where we will spend our first night on the Island.On arrival at our hotel in Stone Town you are free to explore the labyrinth of walled streets, winding alleys, bustling markets and grand crumbling architecture. This UNESCO-listed Stone Town has changed little over the past 200 years. If you enjoy shopping then there are plenty of crafts and colourful souvenirs to be purchased here. Admire the intriguingly decorated doors before sitting down to watch the sun set with a fresh juice, cold beer or cocktail. If the thought of fresh seafood gets the taste buds tingling, make sure you check out the excellent night market on the promenade which serves a feast not to be missed!Today we head to Nungwi Beach. On the way we will stop at one of the many spice plantations where we can discover the abundant plants that flourish in this verdant, tropical environment and sample spices picked straight from the source. We will also visit a small village, having the chance to interact with the locals and experience their kind hospitality; here we will enjoy a traditional lunch cooked by the community.We will arrive in Nungwi early afternoon and start enjoying this sun kissed paradise. Indulge in a cocktail or two while we watch the sunset over the crystal clear Indian Ocean.Today you are free to relax on the white coral sands or enjoy one of the many water based activities on the island. Snorkel with colourful marine life or simply kick back and soak up the sun. This beautiful setting will certainly provide you with a chance to relax and unwind!After breakfast we will head to the airport, where we will leave behind our paradise island and fly to Johannesburg in South Africa. This four hour flight connects east Africa with southern Africa. After arrival you will have the remainder of the day free.We have an early morning start to get to Kruger National Park where we search for the big five. The journey will take around six hours. Upon arrival we will immediately enjoy an afternoon game drive to start viewing the animals that call the reserve home.Kruger National Park is South Africa's premier game reserve, regarded as one of the finest in Africa. Here you'll have the chance to experience the vast diversity of wildlife as we explore some of the two million hectares of the park. The big five game animals of Africa are richly represented here – lion, leopard, African buffalo, African elephant and the white rhino in large numbers.This morning you will enjoy another game drive spotting more animal action in the national park. Learn all about the history of the park and animals and why conservation of these fantastic creatures is so important.We will depart Kruger National Park and take a flight to one of Africa’s greatest attractions and one of the most spectacular waterfalls in the world. With a length of over one kilometre and a height of over one hundred metres this magnificent natural wonder of cascading water defines the border separating Zimbabwe & Zambia. Depending on the wind direction you can hear the roar from the falls up to 4km away as it surges into Africa’s fourth biggest river, the mighty Zambezi.Tonight we will stay close to the action in the town of ‘Victoria Falls’You have a full free day to enjoy Victoria Falls and its activities.Today is a further free day to explore Victoria Falls and enjoy the abundance of activities on offer. Wonder the craft markets and pick up some unique souvenirs or chose from one of the many optional activities available in this area. Whether it be sunset cruises down the Zambezi, a visit to the Mukuni Cultural Village, riverboarding, white water rafting, canoeing, horse riding, abseiling, quad biking, kayaking, helicopter or microlight flights over the falls there is something for everyone.Next we head to Botswana. We stay close to Chobe National Park which is home to the most diverse wildlife in Botswana. 11,000 square kilometres of wilderness, floodplains, forests and swamps support all manners of animal and birdlife. To gain a different perspective of the animals we embark on a sunset cruise along the Chobe River. Wildlife is plentiful and common along the water’s edge; as we glide by you may see elephants, buffalos, kudu, bushbuck, hippo, giraffe and sable.Located in north west Botswana, Chobe is a diverse area spanning from the border at the Chobe River, to the now dry Savute Channel and beyond to the borders of the Moremi Game Reserve and Okavango Delta. The park is divided into four distinctly different eco systems: Serondela with its lush plains and dense forests in the Chobe River area, the Savuti Marsh, the Linyanti Swamps and the dry hinterland and it is famous for having one of the largest game concentrations in the African continent.Our next stop is spent in a very unique location. You will be staying at Elephant Sands, a bush lodge set on private conservancy in the north-east part of Botswana. It is home to a huge amount of wildlife that roams free, especially elephants. You can enjoy the swimming pool and if you are lucky catch a sighting of one of these gentle giants! Elephant Sands is located near two water holes which are only a few feet away.You will be staying in stilted tented camps and can enjoy a cocktail or two in the Elephant Sands bar.Driving across the top edge of the Kalahari Desert we reach the town of Maun, which will be our gateway for visiting the Okavango Delta, Africa's largest freshwater wetland.The Okavango Delta is a huge area of very slow flowing water fed by the Kavango River. The water fans out from the river into a labyrinth of channels, lagoons and palm-covered islands before evaporating over the sands of the Kalahari Desert.Today we will take a day trip to the small islands in the bush. We will travel by hand-crafted mokoros (small boats with shallow drafts similar to canoes) through the delta. The canoes glide silently along the reed-fringed waterways, steered by stealthy polers who earn their living transporting travellers along the delta. We will also have walking safaris through the bush and a chance for a swim before returning to the hotel in Maun.Departing Maun we drive through Botswana towards Namibia and cross the border through a narrow strip of land known as the Caprivi Strip. Keep your eyes peeled as we drive through Mahango Game Reserve as you may be lucky enough to spot zebra, giraffe, gazelle and elephants among other wildlife.Etosha National Park is one of the most memorable places you will visit on this trip with huge amounts of wildlife visiting the waterholes to drink. We have a full game drive to make the most of the fantastic wildlife-spotting opportunities.Today is a full day of driving to reach Etosha where you will enjoy a game drive tomorrow.Etosha National Park is one of the best places in Africa to spot cheetahs and the endangered black rhino. Keep your camera lens ready for rare antelope species, the Burchell's zebra and black-faced impala's which roam the wild savannah. You may spot the odd giraffe or two chewing through thorny acacia trees in the woodland areas. Etosha National Park is a bird watcher's paradise with some 340 species inhabiting the park at different times of the year. For a short period after seasonal rains Etosha's vast salt pan is covered by a layer of water which attracts massive flocks of pelicans, flamingoes and other wading birds. While the pan is dry it is notable for the way it dramatically changes colour during the early morning and late afternoon sun.This morning we leave the Etosha National Park area and make our way towards Otjiwarongo. We travel through the Namibian landscape for around four hours to reach the Cheetah Sanctuary where we will stop for a few hours. After arrival to the sanctuary we will enjoy an introduction to the centre and the work that they do, including a tour of the centre, museum, clinic and creamery. You will witness the cheetahs being fed and also meet the other livestock that live in the centre.Following this you can enjoy an optional Cheetah drive excursion where you have the opportunity to witness these beautiful creatures up close.Later in the afternoon we have a short drive to our final destination for the night, Otjiwarongo.Our next stop will be the charming coastal town of Swakopmund, a historic colonial German town surrounded by desert and sweeping sand dunes which meet with the Atlantic Ocean. It is Namibia's most popular holiday destination. We spend two nights here, so you can wander around town viewing the colonial architecture or perhaps enjoy a cold locally brewed beer or two. If you would prefer to fuel your thirst for adrenaline then there is a wide range of optional excursions available. The town also has a good selection of bars and restaurants to cater for every taste. The seafood here is great!Today you are free to enjoy more of Swakopmund.Departing the coast we drive towards the Tropic of Capricorn where we make a stop so that you can get that obligatory picture with the sign. From here we continue on to Solitaire, a small settlement in the Khomas Region of Central Namibia, close to the Namib-Naukluft National Park. This small desert community has only a gas station, post office, bakery and general store. As you step off the truck you will feel as though you have stepped back in time onto a movie set, surrounded by cacti and old vehicle carcasses partially submerged in the sand.An early start this morning as we make for our excursion into Sossusvlei and Dead Vlei - home of the iconic sand dunes in Namibia. After our excursion we will make our way towards Windhoek.At an elevation of 1650 metres, Windhoek lies in a beautiful valley and is surrounded by the Eros Mountains in the north and the Auas mountains to the south. This is the only city in Namibia and is home to a population of over 250,000 inhabitants. Like in Swakopmund there is a noticeable German influence here. German is still widely spoken and it is common to find traditional breads, sausage, and other delicacies, they even hold annual beer festivals.No tourist's visit to Windhoek is complete without paying a visit to Joe’s Beer house, a bar and restaurant providing a mix of warm Namibian and German hospitality. This place is full of old relics from ‘Joe’s’ travels and creates a great atmosphere for socialising and reminiscing about your journey so far. Here you can also opt to sample some delicious game meats or try out one of the many craft beers on offer.Situated on the south western tip of Africa and set between the Atlantic Ocean and the iconic Table Mountain, Cape Town is recognised as one of the most beautiful cities on Earth.The V&A Waterfront is the very epitome of African chic and offers a unique shopping and entertainment environment where you can soak up the cosmopolitan vibe of the city. Be sure to sample some of South Africa's famous wines with dinner and sit back with a hot cup of rooibos herbal tea afterwards.Included today is a Cape Town City Orientation Tour, visit to Table Mountain and a visit to Robben Island, where former South African President and Nobel Laureate Nelson Mandela was incarcerated among other political prisoners. Once a blight on the nation's history, the island is now seen as a national symbol of triumph over adversity and has been recognised by UNESCO as a World Heritage Site. Excursions to the island are weather dependent.Table Mountain is one of the New 7 Wonders of Nature and a highlight of any trip to South Africa.This morning you will be transferred to Cape Point, passing the scenic Atlantic coastal road on route. Pass the pristine beaches of Clifton and Camps Bay with their contrasting crystal blue waters and fresh white sand. With the Atlantic Ocean on one side and the alluring twelve Apostles mountain range to your other, this drive offers truly fantastic scenery of South Africa. After this, we will visit Boulders Beach where you will witness a colony of African penguins.Finally, enjoy a wine and cheese tasting sampling some of South Africa’s finest produce before returning to Cape Town to enjoy the final evening.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today. If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/kenya_125/kenya_giraffe_mara_20161116_1936177102.jpg", "countries": "Kenya, Tanzania, South Africa, Zimbabwe, Botswana, Namibia"}