{"title": "Myanmar Highlights", "link": "https://www.tucantravel.com/tour/myanmar-highlights/bumh/", "dates": {"2020-10-08": "USD 150.00", "2020-11-05": "USD 150.00", "2020-12-31": "USD 150.00", "2021-01-28": "USD 160.00", "2021-02-25": "USD 160.00", "2021-03-25": "USD 160.00", "2021-10-07": "USD 160.00", "2021-11-04": "USD 160.00", "2021-12-30": "USD 160.00"}, "days": "9", "description": "V We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Myanmar, more formally named the Republic of the Union of Myanmar and previously and possibly better known in many countries as Burma.Mandalay, a name that evokes splendours of old Burma, captured by Rudyard Kipling in poem Mandalay. “This is Burma” he wrote, “and it is quite unlike any place you know about!” Destroyed by a fire and heavily bombed during World War Two, the Burma of old is more difficult to find but when you do, it astounds you.With a turbulent history, after thousands were killed in a military uprising, Burma changed its name to Myanmar in 1989.  Myanmar today has only recently opened its border to travellers after the Military Junta, in control since 1962 was dissolved after years of internal struggle as recently as 2011. As this largely rural country remains unaffected by long term tourism it offers us a wonderful insight into Southeast Asian life.Why not visit the Mahamuni Pagoda with its old Buddha statue. Typically a lively temple, men put gold leaves into the statue. Here you can also shop around for the perfect souvenir, your own small statue made of bronze or wood. If you can't find what you are looking for, the marble carving street should have a treat in store. Walking through the Mahagandayon monastery complex, see hundreds of monks heading to prayers.Tonight, you can visit the Yadanar night market to get a feel for the real Mandalay. Grab some traditional snacks before enjoying a beer at a famous beer station and a delicious meal at one of Mandalay's traditional BBQ restaurants.Bagan is home to more Buddhist temples than anywhere in the world. They poke out of the trees and have a graceful aging process. It is here that the sunsets are some of the best in the world.On arrival, we enjoy a half day guided orientation tour of the area where you will see some of the best temples in the region. Discover Ananda, Sulamani, and Thatbyinnyu, the latter being one of the highest monuments in Bagan.The best way to see the many hundreds of temples in the area of Bagan is by bicycle and the day after arriving in Bagan, we take a guided tour of the site by bicycle The flat landscape makes a bike tour an easy excursion and your guide will show you some of the most spectacular ancient temples away from the crowds. Cycle through the palm trees and bamboo huts finding temples along the way.Today is free to explore. Should you want to visit the surrounding areas, you can take optional excursions to see what else the region has to offer. You can visit Mount Popa, the birthplace of the 37 'nats' of Myanmar which are the protective spirits. You can get off the beaten track by visiting rural villages as well as fruit and flower markets.One of the highlights of Bagan enjoyed by many, is a sunrise hot air balloon ride offering stunning views over the temple zone. Of course seats are limited and can book up early so booking in advance is recommended to avoid disappointment. Your Adventure Specialist will be able to advise on the best ride for you and how to book.Leaving Bagan, on the way to Kalaw we visit the Elephant Conservation Centre. A community project only recently established here, protects the jungle, the wildlife that resides in it and the traditions of the local people living in the area. The project also protects some of Myanmar’s endangered elephants which, without this protection, may have been hunted down and killed or sold into the tourism trade.These elephants are ‘retired’ from working life and we will have the opportunity to wash and feed the elephants but riding them is strictly not allowed. Returning to the camp, we will enjoy lunch before continuing our journey to Kalaw. Travelling by private vehicle, we might make multiple stops on the way to Kalaw in local villages. We may learn how to make toddy and jaggery (palm sugar) from the sap of the toddy palm.Leaving Kalaw we make our way to the picturesque colonial train station where we board our train to Inle Lake and the town of Shwe Nyaung. This scenic journey travels over the Shan mountains and through the valleys towards Inle Lake. A unique local experience that offers great views and a glimpse of local life in the Shan mountains en route. The train has been used by locals and westerners alike for over 100 years and has a distinctive colonial feel to it. This train can't be prebooked so you may be seated in the \"ordinary class\" giving you a real taste of how locals travel by train. An interesting and sustainable way to travel!Arriving at Shwe Nyaung a transfer will take us to our hotel. The following day, we spend a full day on the lake, travelling by boat between traditional villages built on stilts and inhabited by the Intha people. We visit floating gardens, pass some of the fishermen who row their boats using their legs, balancing precariously on the other. One of the main highlights of the excursion is the lunch made by a local family. You will experience authentic Intha food including the famous tomato salad, meat cakes steamed in banana leaves and more. You will also visit traditional markets in different villages depending on the day we travel. If time allows, we will also visit a cheroot factory where Burmese cigars are made, floating tomato gardens, Phaung Daw Oo Pagoda and Intha Heritage House where Burmese cats are bred.Well known for its weaving, on Inle Lake we have the chance to purchase souvenirs including the Burmese tote-bags and high quality silk fabrics. You can also try traditional Shan cuisine including Htamin Jin, a delicious meal of rice, tomato, potato or fish in round balls, wrapped in crisp fried onion and marinated in garlic.Today we fly to Yangon, a city filled with British, Burmese, Chinese and Indian influences. Despite being a city, here it is common to see locals walking down the street barefoot with natural sunblock from the Thanaka tree rubbed on their faces. There is plenty to do in this bustling city from food tours, local markets, lakes and pagodas.The largest and most beautiful pagoda is the Shwedagon Pagoda and it is the most religion site in Myanmar. It was originally built in the 6th century AD and has been rebuilt and developed over time to become the sprawling, golden site of today. It is also a meeting point for locals. Children play, monks chat and women gossip while it is possible to pick up some souvenirs from the shops outside the site.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}