{"title": "Myanmar & Thailand", "link": "https://www.tucantravel.com/tour/myanmar-and-thailand/bumt/", "dates": {"2020-10-08": "USD 200.00", "2020-11-05": "USD 200.00", "2020-12-31": "USD 200.00", "2021-01-28": "USD 210.00", "2021-02-25": "USD 210.00", "2021-03-25": "USD 210.00", "2021-10-07": "USD 210.00", "2021-11-04": "USD 210.00", "2021-12-30": "USD 210.00"}, "days": "16", "description": "I We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Myanmar, more formally named the Republic of the Union of Myanmar and previously and possibly better known in many countries as Burma.Mandalay, a name that evokes splendours of old Burma, captured by Rudyard Kipling in the poem Mandalay. 'This is Burma' he wrote, 'and it is quite unlike any place you know about!' Destroyed by a fire and heavily bombed during World War II, the Burma of old is more difficult to find but when you do, it astounds you.With a turbulent history, after thousands were killed in a military uprising, Burma changed its name to Myanmar in 1989. Myanmar today has only recently opened its border to travellers after the Military Junta, which was in control since 1962 and dissolved after years of internal struggle as recently as 2011. As this largely rural country remains unaffected by long term tourism it offers us a wonderful insight into Southeast Asian life.A highlight it to visit the Mahamuni Pagoda with its old Buddha statue. Typically a lively temple, men put gold leaves into the statue. Here you can also shop around for the perfect souvenir, your own small statue made of bronze or wood. If you can't find what you are looking for, the marble carving street should have a treat in store. Walking through the Mahagandayon monastery complex, see hundreds of monks heading to prayers.Tonight, you can visit the Yadanar night market to get a feel for the real Mandalay. Grab some traditional snacks before enjoying a beer at a famous beer station and a delicious meal at one of Mandalay's traditional BBQ restaurants.This morning we take a local bus to Bagan. Bagan is home to more Buddhist temples than anywhere in the world. They poke out of the trees and have a graceful aging process. It is here that the sunsets are some of the best in the world.On arrival, we enjoy a half day guided orientation tour of the area where you will see some of the best temples in the region. Discover Ananda, Sulamani, and Thatbyinnyu, the latter being one of the highest monuments in Bagan.With so much to see and hundreds of temples waiting to mesmerise you, today we take a bicycle tour of Bagan. The flat landscape makes a bike tour an easy excursion and your guide will show you some of the most spectacular ancient temples away from the crowds. Cycle through the palm trees and bamboo huts finding temples and ruins along the way.The rest of the afternoon is free to further explore. You can visit Mount Popa, the birthplace of the 37 'nats' of Myanmar which are the protective spirits. Or you could get further off the beaten track by visiting rural villages as well as fruit and flower markets.One of the highlights of Bagan enjoyed by many, is a sunrise hot air balloon ride offering stunning views over the temple zone. Of course seats are limited and can book up early so booking in advance is recommended to avoid disappointment. Your Adventure Specialist will be able to advise on the best ride for you and how to book.Leaving Bagan, on the way to Kalaw we visit the Elephant Conservation Centre. A community project only recently established here, it protects the jungle, the wildlife that resides in it and the traditions of the local people living in the area. The project also protects some of Myanmar?s endangered elephants which, without this protection, may have been hunted down and killed or sold into the tourism trade.These elephants are retired from working life and we will have the opportunity to wash and feed the elephants but riding them is strictly not allowed. Returning to the camp, we will enjoy lunch before continuing our journey to Kalaw. Travelling by private vehicle gives us the opportunity to make multiple stops on the way to Kalaw in local villages. We can learn how to make toddy and jaggery (palm sugar) from the sap of the toddy palm.Leaving Kalaw after breakfast, we board our train to take us to Inle Lake. This scenic journey travels through the Shan mountains and you can glimpse the local life as you travel en route. The train has been used by locals and westerners alike for over 100 years and has a distinctive colonial feel to it. This train can't be pre-booked so you may be seated in the 'ordinary class' giving you a real taste of how locals travel by train.Arriving at Inle Lake in the early afternoon, there is time to enjoy a peaceful afternoon by the lake. Tomorrow we will enjoy a full day excursion to experience all the area has to offer.Today we spend a full day on the lake, travelling by boat between traditional villages built on stilts and inhabited by the Intha people. We visit floating gardens, pass some of the fishermen who row their boats using their legs, balancing precariously on the other. One of the main highlights of the excursion is the lunch made by a local family. You will experience authentic Intha food including the famous tomato salad, meat cakes steamed in banana leaves and more. You will also visit traditional markets in different villages depending on the day we travel. If time allows, we will also visit a cheroot factory where Burmese cigars are made, floating tomato gardens, Phaung Daw Oo Pagoda and Intha Heritage House where Burmese cats are bred.Well known for its weaving, on Inle Lake we have the chance to purchase souvenirs including the Burmese tote-bags and high quality silk fabrics. You can also try traditional Shan cuisine including Htamin Jin, a delicious meal of rice, tomato, potato or fish in round balls, wrapped in crisp fried onion and marinated in garlic.Today we fly to Yangon, a city filled with British, Burmese, Chinese and Indian influences. Despite being a city, here it is common to see locals walking down the street barefoot with natural sunblock from the Thanaka tree rubbed on their faces. There is plenty to do in this bustling city from food tours, local markets, lakes and pagodas.The largest and most beautiful pagoda in the area is the Shwedagon Pagoda and it is also the most religion site in Myanmar. It was originally built in the 6th century AD and has been rebuilt and developed over time to become the sprawling, golden site of today. It is also a meeting point for locals. You can experience the local hustle and bustle of the area while it is also possible to pick up some souvenirs from the shops outside the site.This morning is free to relax or tick off some last minute sites in Yangon before we transfer to the airport and catch an afternoon flight to Bangkok.This loud, vibrant and tantalizing city is the centre of economics in Thailand and is seen as the gateway to South East Asia for most travellers.Bangkok is one of those cities that is just as alive come night as it is in the day. Arriving to the hotel in the evening you could explore the various night markets that are dotted around or visit the bars and restaurants in the area. There is something for every taste in this city - from quirky live music venues to high end rooftop bars.Today marks the first day of the weekend and is therefore the perfect opportunity to venture to the famous Chatuchak Weekend Market, Bangkok's largest which is also said to be the largest market in the world. There are over 15,000 stalls offering anything and everything that you could dream of. Mingle with the locals and immerse yourself in the bustle of vendors and shoppers going about their daily lives.You could take your own street food walking tour, enjoying delicacies from the many vendors dotted around the city. Foods to look out for include green papaya salad, Thai fried rice, Pad thai and pork skewers. You could even take a Thai cookery course and learn more about the secrets behind these mouth watering foods.One of the biggest highlights of the city and a must see is the opulent Grand Palace, which was built in 1782 and was home of the Thai King for over 150 years. The palace complex has several impressive buildings such as the Temple of the Emerald Buddha. Just walking around this vast area will give you an idea of the spectacular Thai architecture and vibrant colours. Another must see is the temple of Wat Pho, which houses the impressive reclining Buddha. The position of the Buddha represents entry into Nirvana and the end of reincarnations and is an important symbol for Thai people.For some of the most impressive city skylines, Bangkok has a huge host of rooftop bars waiting to be enjoyed. For some luxury, head to the ones located in Sukhumvit. You can also enjoy city views by walking to the top of Phu Khao Thong, or The Golden Mountain. The area is a small jungle oasis in the centre of Bangkok and perfect if you need away from the hustle and bustle of the city.This morning we enjoy a short riverboat trip experiencing a different perspective of the Bangkok skyline. We disembark at Wat Pho and visit the famous reclining Buddha.This afternoon perhaps spend time soaking up the culture and art scene in one of the many museums dotted around the city. For history buffs, you could easily spend hours soaking up the information in the National Museum, which was Thailand's only museum until the mid 1970?s and has a large and very impressive collection. The Bangkok Art and Culture Centre is a work of art in itself, and you can explore the exhibits which range from photographs to paintings. The Tonson Gallery is excellent for those interested in contemporary art, while the Baan Kamthieng House Museum is perfect for learning more about rural life in Thailand.In the early evening we will meet our group and tour leader back at the hotel and head to the train station for the overnight train to southern Thailand!Arriving to the train station early in the morning we will then take a minivan towards Khao Sok National Park, driving for a further three hours to reach our hotel. Staying nearby you have the chance to visit the national park and tropical rainforest, which is older than the Amazon Jungle. The area of Khao Sok National Park is an incredible 739 square kilometres, including the 165 square kilometre Cheow Lan Lake. The park is the most biodiverse jungle in Thailand and as well as holding many wild animals has an amazing array of flora and fauna, as well as various bird species. Mammals found in the rainforest include the tapir, Asian elephant, sambar deer, wild boar, white handed gibbons and bears.The landscapes are beautiful, with lush jungle complimented with breath-taking limestone cliffs and hidden waterfalls. It is also home to the rare Rafflesia Kerrii, the world's largest flower. Khao Sok is the only place in Thailand to find it.After an orientation of the surrounding area you are free to explore the park or simply wander around the breathtaking area. While the area is rural and tranquil, there are various restaurants and hotels in the area serving fresh and good quality local food.Spend today enjoying the rainforest and everything on offer in the area. The lake is a popular base for many activities including kayaking, canoeing and bamboo rafting. The views from the water are stunning as you pass limestone cliffs and see various fish swimming below.For those who enjoy hiking there are various paths around the park to follow, many of which lead to beautiful waterfalls. A great way to experience this is to hire a local guide who can talk you through the animals that live in the area and show you the best places to see in the rainforest.Caves in the area, such as Diamond Cave, Khang Cow Cave and Nam Talu Cave, all connect to the lake and can be explored on a boat trip.This morning we leave behind the rainforest for a different type of scenery just as spectacular; the beaches of Phuket. Thailand's largest island, Phuket offers some of the country's most popular beaches and is located close to popular islands including James Bond Island (Khao Phing Kan) or Racha Island (Ko Racha Yai) famed for its diving and snorkelling.We hop on a private minibus and travel for around three hours to reach our hotel in Phuket. The rest of the afternoon is free to start enjoying the sunshine filled beaches and glistening waters. The hardest decision of today will be whether you snorkel or paddle board first!Phuket comes alive at night with various restaurants, bars and live music venues. From all night laser nightclubs to laid back beach bars, there is something for every taste and every budget on the island. The food choices are endless, you could enjoy the fresh seafood on offer or the various small eateries serving up typical Thai dishes. Your tour leader will be able to recommend the best ones.Spend today soaking up the beauty of Phuket and the surrounding islands. Thailand's famed islands have been the set for many films over the years and hold a certain mystique. Take a boat trip and explore as many as your heart desires or snorkel around the bays amongst stunning exotic fish and other marine animals.Of course beaches and islands are not to everyone's taste, so why not visit the historical Old Phuket Town, small enough to stroll around but with an abundance of differing cultural histories. See the Big Buddha, a white, 45 metre tall effigy of Buddha with 360 degree views of the island. Wat Chalong is one of the most significant temples on the island and is beautifully decorated with many shimmering pieces on the pagodas.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}