{"title": "Colombia Encompassed", "link": "https://www.tucantravel.com/tour/colombia-encompassed/cce/", "dates": {"2020-04-11": "USD 360.00", "2020-04-25": "USD 360.00", "2020-05-09": "USD 360.00", "2020-05-23": "USD 360.00", "2020-06-06": "USD 360.00", "2020-06-20": "USD 360.00", "2020-07-04": "USD 360.00", "2020-07-18": "USD 360.00", "2020-08-01": "USD 360.00", "2020-08-15": "USD 360.00", "2020-08-29": "USD 360.00", "2020-09-12": "USD 360.00", "2020-09-26": "USD 360.00", "2020-10-10": "USD 360.00", "2020-10-24": "USD 360.00", "2020-11-07": "USD 360.00", "2020-11-21": "USD 360.00", "2020-12-05": "USD 360.00", "2020-12-19": "USD 360.00", "2021-01-02": "USD 380.00", "2021-01-16": "USD 380.00", "2021-01-30": "USD 380.00", "2021-02-13": "USD 380.00", "2021-02-27": "USD 380.00", "2021-03-13": "USD 380.00", "2021-03-27": "USD 380.00", "2021-04-10": "USD 380.00", "2021-04-24": "USD 380.00", "2021-05-08": "USD 380.00", "2021-05-22": "USD 380.00", "2021-06-05": "USD 380.00", "2021-06-19": "USD 380.00", "2021-07-03": "USD 380.00", "2021-07-17": "USD 380.00", "2021-07-31": "USD 380.00", "2021-08-14": "USD 380.00", "2021-08-28": "USD 380.00", "2021-09-11": "USD 380.00", "2021-09-25": "USD 380.00", "2021-10-09": "USD 380.00", "2021-10-23": "USD 380.00", "2021-11-06": "USD 380.00", "2021-11-20": "USD 380.00", "2021-12-04": "USD 380.00", "2021-12-18": "USD 380.00"}, "days": "20", "description": "T We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Bienvenido! We begin our tour in Bogot&#225;, the capital and largest city of Colombia. Colonial buildings give way to modern skyscrapers, the Andean peaks sit tranquilly in the backdrop and the many parks provide sanctuary from the hustle and bustle. You are free to arrive today at your leisure and start enjoying this wonderful city. There will be a pre departure meeting tonight to meet your tour leader and fellow travellers.We will be staying in the Candelaria district, an excellent location within walking distance of many of the main sights including the main square - Plaza Bol&#237;var, the Cathedral and Sim&#243;n Bol&#237;var's house. You may like to take the funicular to Monserrate for the incredible city views, or visit the world famous gold museum. A recommended activity would be the graffiti tour where you can explore some of the famous street art that adorns the city&#39;s walls. Another highlight is visiting the Botero Museum to see some of the artist&#39;s work depicting people and objects in large formats.Leaving Bogot&#225; we drive to Zipaquira Salt Cathedral, a wonderful cathedral built underground within the tunnels of a salt mine. It is often a place of pilgrimage and on Sundays can attract 3000 people to worship. After exploring this unique church we will continue our journey, driving to the quaint town, Villa de Leyva.This attractive town was founded in 1572 and has been preserved well, with virtually no modern architectural influences at all, as a National Monument by the Colombian Government. You'll have time to enjoy its charming colonial plaza, exploring the narrow streets and private courtyards. Get talking to some of the locals, Colombians are some of the friendliest people in South America and are always happy to show you their way of life.Today you are free to enjoy the town. You could opt to book a day tour which visits various locations that surround Villa de Leyva including the unique dinosaur fossil museum. The countryside here is famous for its fossil discoveries and the museum houses many bones which have been collected over the years. You can also visit the fascinating Terracotta House which wouldn&#39;t look out of place in The Flintstones. The house is made entirely of red clay and makes for some really unique photos!You can also take hikes or biking tours around the area to admire the countryside.Leaving Villa de Leyva, we drive back to Bogot&#225; where we catch a short flight to Neiva. From here we will drive to Villavieja, a small town which is the gateway for visiting the Tatacoa Desert. Actually a tropical dry forest, the Tatacoa is the second largest arid area in Colombia and is a popular attraction for those wanting to experience its surreal rock formations and unique landscape. Red hues stretch out as far as the eye can see and it's hard to believe this region was once a lush forest overflowing with vegetation!We visit the desert where you will have time to capture some great photos and learn more about the area. We will then return to our accommodation in Villavieja for the evening. Villavieja itself is a lovely authentic Colombian town which offers unparalleled tranquillity and a unique insight into this lesser known area of Colombia.We have a scenic journey, travelling for approximately seven hours to San Agust&#237;n, an area known for the pre-Columbian sites with many fascinating statues. A UNESCO World Heritage Site, little is known about the communities that carved these statues apart from the few traces of their existence that they left behind. Arriving in the late afternoon, you will have the remainder of the day to relax.When you are not exploring the archaeological site, you can enjoy the stunning green landscape, hike through the hills or take a jeep tour.Today we will have a guided tour through the San Agust&#237;n Archaeological Park. There are hundreds of these statues to see spread over a huge area as well as many ancient burial sites. The pre-Columbian community was eventually replaced by a new group of people who arrived possibly from the Amazon region in the late eighth century bringing in more complex agriculture practises. The parks also have some amazing views of the valley.Famous for their obsession with salsa, Cali has a large Afro-Colombian culture and a passion for Latin music. Admire La Ermita, a church famous for its Gothic style architecture before soaking up the lively atmosphere in the Barrio de San Antonio area. Here you can get great views of the city from the top of the hill as well as having a host of restaurants and bars. Cali also has the perfect climate for growing all sorts of fruits and you will find vendors selling everything from green mango to mora (a cross between a raspberry and blackberry) with plenty more exotic fruits on offer. Or why not try the local delicacy of pandebono, a cheesy bread sold in bakeries and cafes throughout the city.On our journey to Cali, we will pass the Parque Nacional de Puracé, a beautiful national park which features the active Puracé – one of Colombia's only active volcanoes. The unique ecosystem here is also home to frailejones, a member of the sunflower family that produces more than 10 litres of water per day. These magnificent plants capture water vapor from the clouds above and release it through their roots.We will arrive into Cali in the evening, just in time to follow the infectious sounds of the city and join in with a nightclub salsa dance as the locals shimmy the night away. If dancing is not your thing, you can still experience the atmosphere by watching a local show!Today you are free to enjoy the sights and sounds of Cali. Why not take a guided city tour to learn about the history and culture of this spirited corner of the world, or if you prefer to learn about a destination through your taste buds you could book onto a foodie tour and learn the secrets behind some of the most popular Colombian cuisine.If you would like a more tranquil activity you could visit Andoke, a huge butterfly farm located just outside of the city. It is home to 15 different species with a series of walkways connecting the different parts. A staff nember will explain everything about the flora and fauna of the garden and you could even see all stages - from cocoons to caterpillars!This morning we take off our dancing shoes and head to the more peaceful archaeological ruins of Taironaka. After our flight we arrive in the early afternoon with plenty of time to explore these ancient wonders.Taironaka is a relatively unknown area in northern Colombia and the perfect place to get off the beaten track. Located in the foothills of the Sierra Nevada de Santa Marta, the stunning nature reserve is home to a lush and tropical landscape that echos Colombian beauty.Taironaka was home to the ancient Tayrona civilisation and the ruins remain to this day, with small buildings arranged around terraced stone circles showing the social hierarchy at the time. The reserve is reached by a short boat trip heading up the Don Diego river, another perfect opportunity to experience the tranquility of the rainforest. If you’re still spinning from the rhythm of Cali, take this opportunity to relax in one of the many hammocks on the grounds with your favourite book.Come evening enjoy an included group meal, choose from various typical dishes from the region. Kick back to the sounds of nature and enjoy your peaceful night as we stay in the heart of the rainforest in the quaint Ecohotel. Inspired by the indigenous constructions with their thatched roofs and rustic architecture, we guarantee the authentic charm of the place will draw you in.A short transfer from Taironaka will bring us to our day trip to Tayrona National Park which boasts some of the best coastline on the whole continent. It is a few hours of moderate hiking to reach the secluded beaches where roads and cars have no access. The guided walk will take us through the dense rainforest, stumbling across its many residents from the animal and bug kingdom. You can snorkel in the reefs with magnificent tropical fish and marine life or enjoy fresh food from the local food stalls. Tayrona National Park is a chance to recharge your batteries. To enter Tayrona National Park it is suggested you have a valid yellow fever certificate, however this is not necessary.After a day in the park we arrive at the oldest city in Colombia and the first one settled by the Spanish, Santa Marta. The city has an important historical centre and a beautiful old town, and is a popular destination for Colombian tourists.IMPORTANT:  In 2020 between the dates of 1st and 29th February, 1st and 15th June, and 19th October and 2nd November , Tayrona National Park will be closed while the indigenous communities are given the time to clean the park and perform traditional rituals within its parameters. If you are travelling while the park is closed you will have a different but equally exciting tour inside Taironaka Nature Reserve where you will be escorted by a local guide for a short walk through the lush rainforest, and will then have the relaxing experience of tubing down the Dondieguito river while taking in the local flora and fauna. The river is shallow and very calm so it is not necessary to be an advanced swimmer to enjoy this unique experience.Today you are free to enjoy Santa Marta. Due to its coastal location Santa Marta was the first Spanish settlement in Colombia.You could opt to book a day trip visiting Minca, where you can get up close and personal with nature. Think organic coffee farms, breath-taking waterfalls and exciting jungle hikes. Part of the Sierra Nevada mountain range, the trip offers various activities that give you another taste of the beautiful Colombian countryside.Cartagena is one of the most interesting colonial towns on the continent and where the film Romancing the Stone was based. Founded in 1533, it was strategically placed so that it could act as the main port for trade between Spain and the Spanish Empire.You have time to wander the fascinating narrow streets adorned with wooden balconies and hanging plants. There are several interesting sites to see such as a visit to Castillo San Felipe and the fortress on San Lazaro hill. Beneath this fortress is a maze of tunnels and there are still cannons in place along the battlements.Today is free at your leisure to enjoy Cartagena. Worthwhile is a trip up La Popa hill to visit the colourful convent with great views over the city.The Boca Grande area of Cartagena is where Colombians come for their beach holidays and it is full of shops, nightclubs and bars. Near Cartagena is the Volc&#225;n de Lodo El Totumo, a mud volcano where you can relax and wallow in the mud, which is believed to be a good treatment for the skin.You could also visit the Rosario Islands, located around one hour from Cartagena. Picture crystal blue waters, lush greenery, straw beach huts and delicious fresh seafood. These islands are essentially a Caribbean paradise - all accessible on a short day trip from Cartagena!This morning we say goodbye to the sounds of the Caribbean and head to Colombia's second largest city, Medellin. Also known as “The City of Eternal Spring” due to its year round pleasant weather, Medellin has flourished in recent years and now has one of the fastest growing economies on the continent. Once known as the playground for infamous drug lords, the city has since shed its reputation and welcomes travellers from far and wide who are eager to experience what this progressive and exciting city has to offer.There are numerous parks and plazas in Medell&#237;n waiting to be explored, such as Parque Berrio, Jardin Botanico or Parque Explora, which features Latin America's largest freshwater aquarium.Spend your evening in Parque Lleras, the best place in the city for restaurants, bars or nightclubs. Try Medell&#237;n’s most traditional dish, the bandeja paisa. A hearty plate of rice, eggs, meat, beans and avocado, the servings are usually huge and can be shared between two, but are one of the most important dishes in the region and should not be missed!Today is free to further explore Medell&#237;n! Why not try using the world renowned public transportation system? The cable car connects the city centre to the outskirts and results in some of the best views of the city once you reach the end of the line, Parque Arv&#237;.You could visit the Metropolitan Cathedral in Bolivar park which holds the record for the most clay bricks on any building in the world, with an impressive 1.1 million bricks being used in the building process! Also worth exploring is the Plaza Botero, where you can see many of the figures by the sculptor Fernando Botero. Botero is one of the most famous artists to come out of Colombia, known for his still life images of plump figures.Another option is to take a day trip to the colourful village of Guatap&#233;. Here you will find the famous Pe&#241;ol Boulder, a 200 metre high rock which you can climb for some incredible views of the surrounding area! Or if art is more your thing, book onto the Comuna 13 graffiti tour! Comuna 13 was once known as the most dangerous neighbourhood in Colombia, but has been transformed with unique street art around every corner.No trip to Colombia would be complete without an immersive coffee experience. Today we head to a local coffee plantation where we will stay the evening on the grounds to learn everything there is to know about this well loved beverage. Your time will be spent learning about the culture, history and variety of coffee, as well as the coffee making process. Witness the roasting process, experiment with the flavours and walk through the plantation where you can see the packaging take place. Arriving late in the day, your coffee experience will normally take place tomorrow morning.Tonight we stay in a Hacienda, the main house on the plantation. With over 100 years of tradition the coffee farm is the perfect place to relax and take in the lush scenery. Enjoy a local dinner prepared by your hosts and spend the evening relaxing by the pool.After our coffee tour we head for Salento, nestled in the Zona Cafetera region of Colombia. Salento is a beautiful and colourful town, having managed to keep it’s slow and relaxing pace due to the main route between Cali and Bogota being diverted which meant the town did not develop as fast as others in the region.Hike to the viewpoint at the end of Calle Real for some of the best views over the valley, and don’t forget to walk around the charming and humble town square.We take a jeep from town to the Cocora Valley and spend a whole day hiking through the lush green hills. Our jeeps are true classic cars with bright colours and can date as far back as the 60’s; riding in them in a truly unique experience. The hike provides sweeping views of the valley and the iconic wax palms, Colombia's national symbol. In the evenings, make sure you try the region´s speciality, trucha, a fish normally served with rice but cooked many different ways.Head back to Salento for the evening and perhaps enjoy a game of Tejo, a traditional Colombian throwing sport.We then return to Bogot&#225; for the final evening. Tick off any last sightseeing or enjoy the nightlife with your new travel buddies.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}