{"title": "Colombia Express", "link": "https://www.tucantravel.com/tour/colombia-express/ccx/", "dates": {"2020-04-09": "USD 150.00", "2020-04-23": "USD 150.00", "2020-05-07": "USD 150.00", "2020-05-21": "USD 150.00", "2020-06-04": "USD 150.00", "2020-06-18": "USD 150.00", "2020-07-02": "USD 150.00", "2020-07-16": "USD 150.00", "2020-07-30": "USD 150.00", "2020-08-13": "USD 150.00", "2020-08-27": "USD 150.00", "2020-09-10": "USD 150.00", "2020-09-24": "USD 150.00", "2020-10-08": "USD 150.00", "2020-10-22": "USD 150.00", "2020-11-05": "USD 150.00", "2020-11-19": "USD 150.00", "2020-12-03": "USD 150.00", "2020-12-17": "USD 150.00", "2020-12-31": "USD 150.00", "2021-01-14": "USD 160.00", "2021-01-28": "USD 160.00", "2021-02-11": "USD 160.00", "2021-02-25": "USD 160.00", "2021-03-11": "USD 160.00", "2021-03-25": "USD 160.00", "2021-04-08": "USD 160.00", "2021-04-22": "USD 160.00", "2021-05-06": "USD 160.00", "2021-05-20": "USD 160.00", "2021-06-03": "USD 160.00", "2021-06-17": "USD 160.00", "2021-07-01": "USD 160.00", "2021-07-15": "USD 160.00", "2021-07-29": "USD 160.00", "2021-08-12": "USD 160.00", "2021-08-26": "USD 160.00", "2021-09-09": "USD 160.00", "2021-09-23": "USD 160.00", "2021-10-07": "USD 160.00", "2021-10-21": "USD 160.00", "2021-11-04": "USD 160.00", "2021-11-18": "USD 160.00", "2021-12-02": "USD 160.00", "2021-12-16": "USD 160.00", "2021-12-30": "USD 160.00"}, "days": "8", "description": "Say hola to Colombia on this short tour, done on comfortable private transport throughout. Enjoy a coffee tour through the leafy plantations and discover the buzzing highlights that have made this country so popular in recent years. From the metropolis of Medellín where you can enjoy the sights via cable car, to the buzzing hub of Bogotá, we travel through Colombia hiking through stunning valleys and meeting locals along the way. We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Drenched in old town charm, Cartagena de Indias lies on the northern coast of Colombia and is one of the most picturesque colonial towns on the continent. Founded in 1533, the town was named after Cartagena, Spain, and subsequently became a key factor in the expansion of the Spanish Empire, playing a political, economic and administrative role during the colonial period. Relics of the Spanish Empire can be seen far and wide in the beautifully preserved churches, monasteries, plazas and palaces.The old city is considered the heart of Cartagena, echoing the city's long history while incorporating true Colombian culture. Vibrant narrow streets are adorned with wooden balconies and hanging plants, while brightly coloured houses can be seen in every turn. Keep an eye out for the elaborate door knockers, which are designed in the shapes of seahorses, lizards, turtles and more. In Cartagena society, doors were considered a status symbol.While simply getting lost in the charming streets is the best way to discover the allure of Cartagena, important sites include Castillo San Felipe and the fortress on San Lazaro hill. Beneath the fortress you can find a maze of tunnels where cannons still stand along the battlements. For some of the best views of the city, head up La Popa hill and visit the vibrant convent. For a unique trip out of the city, head to the mud volcano.With a Caribbean climate and some of the most stunning beaches in the Americas, Cartagena is also the perfect place to dip your toes in the ocean and admire this fascinating corner of the globe. End your evening sampling true Colombian delicacies at a local market stall or high end eatery. Whatever your taste; Cartagena won’t disappoint.This morning we say goodbye to the sounds of the Caribbean and head to Colombia's second largest city, Medellin. Also known as “The City of Eternal Spring” due to its year round pleasant weather, Medellin has flourished in recent years and now has one of the fastest growing economies on the continent. Once known as the playground for infamous drug lords, the city has since shed its reputation and welcomes travellers from far and wide who are eager to experience what this progressive and exciting city has to offer.There are numerous parks and plazas in Medell&#237;n waiting to be explored, such as Parque Berrio, Jardin Botanico or Parque Explora, which features Latin America's largest freshwater aquarium.Spend your evening in Parque Lleras, the best place in the city for restaurants, bars or nightclubs. Try Medell&#237;n’s most traditional dish, the bandeja paisa. A hearty plate of rice, eggs, meat, beans and avocado, the servings are usually huge and can be shared between two, but are one of the most important dishes in the region and should not be missed!Today is free to further explore Medell&#237;n! Why not try using the world renowned public transportation system? The cable car connects the city centre to the outskirts and results in some of the best views of the city once you reach the end of the line, Parque Arv&#237;.You could visit the Metropolitan Cathedral in Bolivar park which holds the record for the most clay bricks on any building in the world, with an impressive 1.1 million bricks being used in the building process! Also worth exploring is the Plaza Botero, where you can see many of the figures by the sculptor Fernando Botero. Botero is one of the most famous artists to come out of Colombia, known for his still life images of plump figures.Another option is to take a day trip to the colourful village of Guatap&#233;. Here you will find the famous Pe&#241;ol Boulder, a 200 metre high rock which you can climb for some incredible views of the surrounding area! Or if art is more your thing, book onto the Comuna 13 graffiti tour! Comuna 13 was once known as the most dangerous neighbourhood in Colombia, but has been transformed with unique street art around every corner.No trip to Colombia would be complete without an immersive coffee experience. Today we head to a local coffee plantation where we will stay the evening on the grounds to learn everything there is to know about this well loved beverage. Your time will be spent learning about the culture, history and variety of coffee, as well as the coffee making process. Witness the roasting process, experiment with the flavours and walk through the plantation where you can see the packaging take place. Arriving late in the day, your coffee experience will normally take place tomorrow morning.Tonight we stay in a Hacienda, the main house on the plantation. With over 100 years of tradition the coffee farm is the perfect place to relax and take in the lush scenery. Enjoy a local dinner prepared by your hosts and spend the evening relaxing by the pool.After our coffee tour we head for Salento, nestled in the Zona Cafetera region of Colombia. Salento is a beautiful and colourful town, having managed to keep it’s slow and relaxing pace due to the main route between Cali and Bogota being diverted which meant the town did not develop as fast as others in the region.Hike to the viewpoint at the end of Calle Real for some of the best views over the valley, and don’t forget to walk around the charming and humble town square.We take a jeep from town to the Cocora Valley and spend a whole day hiking through the lush green hills. Our jeeps are true classic cars with bright colours and can date as far back as the 60’s; riding in them in a truly unique experience. The hike provides sweeping views of the valley and the iconic wax palms, Colombia's national symbol. In the evenings, make sure you try the region´s speciality, trucha, a fish normally served with rice but cooked many different ways.Head back to Salento for the evening and perhaps enjoy a game of Tejo, a traditional Colombian throwing sport.Our final Colombian stop is of course the bustling capital city, Bogota. With a population of 7 million, it is also the largest city in the country and the centre of everything from politics to sport. With the dramatic Andean peaks looming in the background, Bogota radiates classic colonial charm while modern and sophisticated businesses are popping up by the second.We will be staying in the Candelaria district which is an excellent location within walking distance of many of the main sights including the main square - Plaza Bolívar, the Cathedral and Simón Bolívar's house. You may like to take the funicular to Monserrate for the incredible city views, or visit the world famous gold museum.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}