{"title": "Mexico & Cuba Adventure", "link": "https://www.tucantravel.com/tour/mexico-and-cuba-adventure/cmh/", "dates": {"2020-04-12": "USD 140.00", "2020-04-26": "USD 140.00", "2020-05-10": "USD 140.00", "2020-05-24": "USD 140.00", "2020-06-07": "USD 140.00", "2020-06-21": "USD 140.00", "2020-07-05": "USD 140.00", "2020-07-19": "USD 140.00", "2020-08-02": "USD 140.00", "2020-08-16": "USD 140.00", "2020-08-30": "USD 140.00", "2020-09-13": "USD 140.00", "2020-09-27": "USD 140.00", "2020-10-11": "USD 140.00", "2020-10-25": "USD 140.00", "2020-11-08": "USD 140.00", "2020-11-22": "USD 140.00", "2020-12-06": "USD 140.00", "2020-12-20": "USD 140.00", "2021-01-03": "USD 150.00", "2021-01-17": "USD 150.00", "2021-01-31": "USD 150.00", "2021-02-14": "USD 150.00", "2021-02-28": "USD 150.00", "2021-03-14": "USD 150.00", "2021-03-28": "USD 150.00", "2021-04-11": "USD 150.00", "2021-04-25": "USD 150.00", "2021-05-09": "USD 150.00", "2021-05-23": "USD 150.00", "2021-06-06": "USD 150.00", "2021-06-20": "USD 150.00", "2021-07-04": "USD 150.00", "2021-07-18": "USD 150.00", "2021-08-01": "USD 150.00", "2021-08-15": "USD 150.00", "2021-08-29": "USD 150.00", "2021-09-12": "USD 150.00", "2021-09-26": "USD 150.00", "2021-10-10": "USD 150.00", "2021-10-24": "USD 150.00", "2021-11-07": "USD 150.00", "2021-11-21": "USD 150.00", "2021-12-05": "USD 150.00", "2021-12-19": "USD 150.00"}, "days": "17", "description": "C We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Mexico and the country's most populated city with a staggering 9 million residents! Mexico City is a dizzying blend of culture and tradition with a huge variety of activities to suit every traveller.Today is free to arrive at your leisure and immerse yourself in the city. Head to the Zocalo, the huge central square where you can find Aztec ruins and colonial architecture, including the beautiful main cathedral. Remember to look through the glass flooring outside of the church to see the ancient Aztec city beneath. Just behind the cathedral are the Aztec ruins of the ancient Teocali, which were only discovered in 1978. You can also visit the world famous Anthropology Museum and the National Palace where you can see murals depicting the history of Mexico by one of the country's most famous artists Diego Rivera. Check out his equally famous wife at the Frida Kahlo Museum. (advisable to book tickets in advance online).In the evening you can enjoy a spicy Mexican dinner and maybe a few tequilas in the Zona Rosa while enjoying music performed by a mariachi band.Please note there will be a pre departure meeting at 6pm tonight to meet your tour leader and fellow group members.This morning we take a short journey in a private vehicle to the ancient site of Teotihuacan where we enjoy a guided tour. Here you will see an amazing abandoned city built around 300 BC by a civilisation now lost in the mists of time. The historic complex is a fascinating combination of ceremonial pyramids, such as the Pyramids of the Sun and the Moon. Other landmarks include the Ciudadela, which is connected by the Street of the Dead, palaces, old temples and the Plaza of the Sun. The buildings are decorated with friezes and other ornate artworks.We continue to one of Mexico's oldest towns, Puebla, which means \"City of the Angels\". Set in a valley with a dramatic backdrop of volcanoes and snow-capped peaks, Puebla is a fascinating old colonial town founded in 1531. The historic city centre has been listed as a UNESCO World Heritage site, partly due to its impressively preserved Spanish colonial architecture. Puebla is the best place to try mole poblano, a rich, spicy sauce containing chocolate, cinnamon and nuts, as well as different types of hot peppers, often served over chicken.Today we journey to Oaxaca (pronounced wa-ha-ka), a beautiful city bordered by mountains and thick forests, with a very pleasant Plaza de la Constitución where you can eat, drink and watch the world go by.Explore the beautiful Templo de Santo Domingo, a 16th century church with a Baroque style facade. Built between the 15th and 16th centuries as part of the city’s Dominican monastery, the building has extremely thick stone walls since the region is prone to earthquakes.Oaxaca City is also well known for having some amazing art galleries, especially smaller independent ones hidden down the cobbled streets. The food here is some of the best you will find in Mexico, be sure to try a tlayudas, a large crispy tortilla topped with beans, cheese and avocado.Today we enjoy an included excursion to the spectacular temples of Monte Alban just outside the city. This pre-Columbian archaeological site is the only pyramid in Mexico that sits 400 meters above the valley. There are many structures to explore around the Grand Plaza including numerous tombs, ceremonial altars, tunnels, pyramids and palaces, many decorated by glyphs, paintings and intricate carvings.We return to Oaxaca City to enjoy a free evening.Today we head to the airport and fly to Merida. Capital of the Yucatan province, the 'white city' of Mérida is a pleasant mixture of colonial buildings, churches and plazas. The city boasts rich culture, history and traditions, with markets overflowing with beautiful weaving and handmade crafts. A walk through the city’s downtown buildings is an attraction in itself, as you witness the brightly painted houses which mirror it’s colonial past.For art lovers, check out the Museum of Modern Art which is located next to the Cathedral. The museum regularly exhibits Yucatan artists who promote their country and local traditions. The Lucas de Galvéz market is another must see. The largest market in town, it sells plenty of local produce and is the ultimate place to try dishes typical of Yucatan. Have a sopa de lima (lime soup), or frijol con puerco (beans with pork) both which are specialities of the region.Evening is often the best time to explore as the city comes alive with night markets or music and dancing in many of the squares.Today is free to further explore the city and surrounding area. You could visit the small fishing town of Celestún, with its secluded beaches and home to the Biosphere Reserve which has a large flamingo population. You could also take a swim in the local 'cenotes' (sen-o-tays), fresh-water swimming holes connected by spectacular limestone caverns and deep underwater rivers once sacred to the ancient Maya, covering the entire Yucatan peninsula.We travel to Chichén Itzá, an impressive Maya/Toltec site recently voted as one of the New 7 Wonders of the World. Constructed between the 7th and 10th century AD, Chichén Itzá was a centre of pilgrimage for the Maya for over 1000 years. The most famous attraction is the great Pyramid of Kukulkan, dedicated to the feathered serpent god Kukulkan and built with such precision that a shadow serpent descends down the steps during the equinox. After soaking up the beauty of Chichén Itzá, we will continue onto Playa del Carmen.Playa del Carmen is the perfect place for relaxation. The beaches are coated with sugar-white sand with shimmering turquoise waters to swim in. You have the rest of the day to relax by the pool, beach, or simply explore the area.This morning you will transfer to Cancun for your flight to Havana. Upon arrival you will be transferred to your accommodation and you will meet your guide and group in the evening.Cuba is the largest island in the Caribbean and it sure does pack a punch - drawing eager travellers from all over the world. Cuban days consist of sunshine, music, beaches and an overall contagious atmosphere. From the colourful colonial buildings to the picture perfect 1940's cars, the streets of Havana are taken straight from a postcard.Havana is considered the beating heart of Cuba. The UNESCO Old Town is a wonderful place to stroll around, taking in the architecture and colours that surround you. Wander Centro Habana, the most colourful district in Havana and check out Havana Viego, where the majority of UNESCO sites are situated. Learn from the Revolution Museum or explore the National Museum of Fine Arts.Today we make our way to Cienfuegos, stopping off at the Bay of Pigs en route This infamous site was where the US attempted a military invasion of Cuba in 1961 &#45; ultimately failing. There is a museum where you will further learn about the history, and you will then have some time to swim or snorkel in what can only be described as one of Cuba&#39;s best reefs!We then continue onto Cienfuegos, also known as the Paris of the Caribbean due to its wide boulevards and expansive parks. In 1819 the city was settled by French migrants who made it their home. French influence can be widely seen throughout the city and many of the streets reflect the French language in their name: Bouyon and D&#39;Clouet for example.Upon arrival we will enjoy an orientation walk of the city. Get your camera ready for the charm and history that will be found throughout! We will visit the Castillo de Jagua, the ancient fort that once protected Cuba from pirate attacks. We will stroll through the picturesque Parque Jos&#233; Mart&#237; before relaxing by the oceanfront walkways of Malecon. Finally, we will make a stop at the gorgeous Palacio de Valle, a historic villa designed by an Italian architect, where we will enjoy an included drink.After breakfast we will travel towards Trinidad, making a stop at Santa Clara on the way. Santa Clara holds a special place in the revolutionary history of Cuba and today oozes a youthful culture and lively nightlife due to having one of Cuba&#39;s largest universities.Santa Clara is infamous for being one of the final and bloodiest battles in the revolution, and is the final resting place of Che Guevara &#45; a hero of the Cuban Revolution. Guevara arrived on New Years Eve in 1958, fighting against the regime of General Batista. A mere 12 hours into the battle, Batista fled Cuba and the revolutionaries claimed victory. Guevera quickly became a key figure in the Cuban Revolution and later attempted to incite the same in Bolivia - ultimately leading to his execution. His body was returned to Santa Clara and laid to rest in what is now known as the Che Guevara Mausoleum.We then continue to Trinidad, one of Cuba&#39;s most alluring destinations. The town was placed on the UNESCO World Heritage list in 1988 and we guarantee you will find beauty around every corner, from the cobbled streets to the smiling residents. You will enjoy a guided Trinidad Township walk, learning about the history and culture of this fascinating town.Today you are free to enjoy Trinidad and the many activities on offer. Options include scuba diving or snorkelling in the crystal waters, moped or bike rental to further explore on land or perhaps a train ride through the valley of the sugar mills!You could also catch a bus to Playa Ancon beach - the perfect spot for some relaxation. When the sun goes down, we get on our dancing shoes and enjoy a fun salsa class!The charming village of Vi&#241;ales offers a different side of Cuban life. As you drive towards this rural area you will see more of the quaint Cuban countryside, where farmers grow tobacco for Cuban cigars in the heart of the Pinar del Rio Valley. Arriving late afternoon you can enjoy getting acquainted with the village and all it has to offer.Located in Western Cuba, Vi&#241;ales was established in 1878 and consists of wooden houses and picturesque valleys as far as the eye can see. Don&#39;t be fooled by the quiet atmosphere though - when the sun goes down the rum comes out and the residents will be dancing the night away!Today we enjoy a walking tour of the local area so we get further acquainted with Vinales. We will visit a tobacco farm and drying house to learn all about the tobacco process and lives of the farmers in the region. Enjoy lunch at an organic farm before having a free afternoon.You could book onto the Santo Tomas caving excursion, where you will experience the largest cave in Cuba and second largest in Latin America! Or perhaps you would like to rent a bike and explore the local valleys, taking in the peaceful scenery and tobacco farms in the region. You could also opt for a local cooking class and learn the secrets behind some of the most loved foods in Cuba.Head back to Havana for the last days of tour. There will be plenty of activities to keep you occupied, including a tour of the city in a classic American car. Get your camera ready for some perfect photo-shoots! We will then visit a lovely roof terrace in the Old Town where you will learn the secrets behind the delicious Mojito in a cocktail class.Get your walking shoes on as today we will take a walking tour of Havana&#39;s Old Town. Explore the hidden streets, charming plazas and even visit the Callejon de Hammel. This hidden gem is where a number of local artists live and work - essentially creating one long creative studio complete with elaborate street art.In the afternoon you are free to take part in a host of different activities, or simply take time to wander Havana yourself and soak up the atmosphere. If you need some time to relax and recharge - the beach is waiting!What comes to mind when you think of Cuba? Apart from relaxed beach filled days and electric nights, cigars and rum are more than likely to make the list. Today you will get acquainted with Cuba&#39;s finest products, with a tour to the Cigar Factory and Rum Museum. The popular Havana Rum Museum is housed in a colonial mansion located in the heart of the city. Of course you will be able to sample the rum too!Next you will visit the Partagas Cigar Factory and learn about the history and the making of the famous Cuban cigar. The cigar is an iconic symbol of Cuba and the care and effort that goes into making each one can only be appreciated on a tour of the factory.The remainder of the day will be free at your leisure.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}