{"title": "Mexico Beach to Costa Rica Jungle", "link": "https://www.tucantravel.com/tour/mexico-beach-to-costa-rica-jungle/cps/", "dates": {"2020-04-05": "USD 280.00", "2020-04-19": "USD 280.00", "2020-05-03": "USD 280.00", "2020-05-17": "USD 280.00", "2020-05-31": "USD 280.00", "2020-06-14": "USD 280.00", "2020-06-28": "USD 280.00", "2020-07-12": "USD 280.00", "2020-07-26": "USD 280.00", "2020-08-09": "USD 280.00", "2020-08-23": "USD 280.00", "2020-09-06": "USD 280.00", "2020-09-20": "USD 280.00", "2020-10-04": "USD 280.00", "2020-10-18": "USD 280.00", "2020-11-01": "USD 280.00", "2020-11-15": "USD 280.00", "2020-11-29": "USD 280.00", "2020-12-13": "USD 280.00", "2020-12-27": "USD 280.00", "2021-01-10": "USD 290.00", "2021-01-24": "USD 290.00", "2021-02-07": "USD 290.00", "2021-02-21": "USD 290.00", "2021-03-07": "USD 290.00", "2021-03-21": "USD 290.00", "2021-04-04": "USD 290.00", "2021-04-18": "USD 290.00", "2021-05-02": "USD 290.00", "2021-05-16": "USD 290.00", "2021-05-30": "USD 290.00", "2021-06-13": "USD 290.00", "2021-06-27": "USD 290.00", "2021-07-11": "USD 290.00", "2021-07-25": "USD 290.00", "2021-08-08": "USD 290.00", "2021-08-22": "USD 290.00", "2021-09-05": "USD 290.00", "2021-09-19": "USD 290.00", "2021-10-03": "USD 290.00", "2021-10-17": "USD 290.00", "2021-10-31": "USD 290.00", "2021-11-14": "USD 290.00", "2021-11-28": "USD 290.00", "2021-12-12": "USD 290.00", "2021-12-26": "USD 290.00"}, "days": "16", "description": "F We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to the beachside paradise of Playa del Carmen! Today is free to arrive at your leisure and soak up some sun. We recommend booking pre tour accommodation to enjoy everything this activity packed location has to offer.Playa del Carmen is located along the Yucatan Peninsula Riviera Maya strip of the Caribbean shoreline. Known for its sugar white beaches and palm-lined shores, it’s the perfect destination to kick back and relax while enjoying a host of water based activities.Visit the island of Cozumel or the amazingly located Maya/Toltec ruins of Tulúm. There are also many 'cenotes' in the area. Cenotes (se-note-tays) are freshwater swimming holes connected to underground limestone cave systems once sacred to the ancient Maya.Please note there will be a pre departure meeting at 6pm tonight to meet your tour leader and fellow group members.This morning we take a private transfer to the border of Belize before hopping on a ferry to Caye Caulker. A small Caribbean island off the coast of Belize, Caye Caulker is the ultimate destination for beach relaxation. Cars are prohibited and the islands moto is go slow.Arriving early evening, you are free to spend time settling in to island way of life. Rent a bike to explore the island or take a walk along the beaches. Try out one of the local restaurants where you can sample fresh seafood, and enjoy tropical cocktails in the evening.Please Note: When departing Mexico you will need to pay a small departure fee of approximately MXN 550.Today is free to experience the crystal blue waters and beach activities. Your tour leader will be available to recommend various options to fill your day.You could take a boat out to Shark Ray Alley, where you can swim within a few feet of nurse sharks and majestic manta rays. If you are lucky you can also spot manatees. These peaceful creatures are often quite curious and will approach visitors. Another optional snorkelling tour takes you out to Hol-Chan Marine Reserve where you are guaranteed to see lots of colourful fish and interesting reef formations. Qualified divers can explore the so-called bottomless \"Blue Hole\", made famous by the explorer Jacques Cousteau (please note: this optional excursion does not go every day, check locally for availability). Other options include sunning yourself, riding a bike around the island, or trying your luck at fishing. If you are lucky, you can take your catch to one of the local restaurants so they can BBQ it for you.This morning we hop back on the ferry and travel to Belize City, before continuing our journey to San Ignacio by local bus.San Ignacio is a town in western Belize and forms the main population centre of Cayo District. It is situated on the banks of the Macal River and joins the neighbouring town of Santa Elena by suspension bridge.The surrounding jungle, wildlife, waterfalls, rivers and caves, have created the ideal location for the numerous optional adventure excursions. The town itself is small and charming, with various restaurants dishing up traditional cuisine.Today is free to enjoy more of the adventure activities in the area. A popular excursion is visiting the Caracol Ruins, the largest and most important ancient Maya archaeological site in Belize.Other great options are to canoe down the river, tube through caves, or visit the famous caves Actun Tunichil Muknal, where they found untouched Mayan ceremonial and sacrificial remains.Saying goodbye to Belize we cross into Guatemala to the charming island-town of Flores. When departing Belize you will be required to pay a small fee of $40.00BZD, and on arrival in Guatemala another small payment of 10q is required.Flores was the last town to be conquered by the Spanish and is situated in the centre of Lake Peten Itzá. On the way to Flores we stop at the breathtaking Maya site of Tikal. It is regarded as the greatest city of the Maya world and is nestled deep in the jungle. This complex is one of the biggest Maya sites discovered, and you will have most of the day to explore and learn about the flora, fauna, and amazing Mayan history with our knowledgeable local guide.The area around Tikal has been declared as the Tikal National Park and the preserved area covers 570 square kilometres. The ancient city has been completely mapped and at its height covered an area greater than 16 square kilometres, with more than 3000 structures. Today the main centre covers an area of approximately two and a half square kilometres. As you wander the site, you will see several tall mounds which have not yet been excavated, and you will have the opportunity to climb some of the tallest Mayan temples.The emphasis was on height when creating these imposing structures because the Maya believed the higher the building, the closer they were to the gods. Around Tikal there is a lot of animal life, and if you're lucky, you will have the chance to spot the noisy howler monkeys, pizotes (a racoon-like animal), exotic birds such as toucans, and much more!After plenty of time spent exploring Tikal you will arrive to Flores in the early evening where you have the chance to relax before flying to Antigua tomorrow.Today we fly to Guatemala City and then have a short private transfer to nearby Antigua. A UNESCO World Heritage Site, Antigua is one of the most delightful colonial towns in Central America and the capital city of Guatemala.The local indigenous can be seen throughout the cobbled streets and plazas of the city in their colourful costumes, selling their crafts and textiles. As the cultural centre of Guatemala, Antigua is an ideal place to experience the traditional music, architecture and art of the country. Rich in ornate churches, convents, parks, plazas, cafés, restaurants, bars and colourful street markets and surrounded by awe-inspiring volcanoes, Antigua is one place you will never forget.Hello Costa Rica! This morning a representative will transfer you to the airport for your flight to San José. Nestled in a valley among coffee and sugar cane farms, San José is distinguished by its beautiful National Theatre and Plaza de la Cultura. While you can still see remnants of Spanish colonialism throughout the city, many of the buildings have been destroyed by earthquakes over the years.San José is also home to many interesting and unique museums and galleries. Worth exploring are The Gold Museum, Jade Museum and the National Gallery of Contemporary Art.Today we travel through lush green countryside to the small village of Manuel Antonio, the base for Manuel Antonio National Park. The journey takes around three hours by local bus and you will start to witness the tropical countryside. After check in the rest of the day is free to relax and recharge, wander the charming streets or beachfront and start to experience the beauty of Costa Rica.Today we explore Costa Rica&#39;s most celebrated and beautiful nature reserve, Manuel Antonio National Park. The area consists of around 1,680 acres of rainforest containing lush vegetation and white sandy beaches. Even though Manuel Antonio National Park is one of the smallest in the country, it is considered the most biodiverse with more than 100 species of mammals and almost 200 species of birds.  While exploring one of the many hiking trails you may come across the three toed sloth, pelicans, white-faced monkeys, anteaters and iguanas.Other activities in the area include horse riding, kayaking, hiking, guided tours and plenty other water sports such as white water rafting and sailing tours.We travel to the old town of Quepos, once a very important port for the exportation of bananas. We then ascend a steep and bumpy mountain road that offers great views over lush green hills that flatten to meet the Pacific Ocean. We reach the small town of Santa Elena, nestled up in the clouds and established by American Quakers in the 1950's.Santa Elena is the base for the Monteverde Cloud Forest Reserve which we will visit tomorrow.Today we visit Monteverde Cloud Forest Reserve on a private transfer. There are several paths to explore in this privately owned reserve, one of which takes you to the continental divide. On a clear day both the Atlantic and Pacific Oceans can be seen! We'll also stop at the Hummingbird Gallery where you can grab a drink and a slice of cake. Here you can watch dozens of these energetic birds buzz around sipping on nectar. The area around Santa Elena is famous for its ziplines and hosts the longest zip line in the world. Here you'll have the option to go flying over the cloud forest on a series of cables strung out between the giant trees. For the less courageous, you may opt for a sky walk along a series of suspension bridges above the forest canopy. Along with the lovely horse treks, nature-spotting twilight walks, visits to coffee and dairy farms, you may find it hard to choose between all of the exciting excursions!Our next journey takes us through the mountains of the cloud forest using a combination of minivans and boats. The first leg to Lake Arenal takes about one hour 30 minutes and the landscape is truly spectacular. Rolling hills eventually give way to the distant views of Arenal Volcano and we can stop for photos at some of the best lookouts. Stopping by the side of the road one last time, we walk down a dirt path to our boat on the shores of Lake Arenal. The scenery is truly stunning from the lake and we travel for approximately an hour slowly approaching Arenal Volcano. Once we reach the other side, where we board another minibus and travel for thirty minutes to La Fortuna.After checking in you have time for lunch and to explore the town. Kick back and relax, you then have two full days to enjoy all the wonderful excursions in the area! You are free to enjoy the hiking trails, horseback riding, butterfly gardens or zip-line tours.The main attraction in La Fortuna is the nearby Arenal Volcano, which was constantly erupting between 1968 and 2010. Although not erupting any more, the occasional puff of steam can be seen. The National Park consists of lush forests bursting with wildlife, gushing waterfalls and hanging bridges. You are free to enjoy the hiking trails, horseback riding, butterfly gardens or zip-line tours.Today is your last day to make sure you have soaked up the beauty of La Fortuna. If you have not already, perhaps hike to the spectacular La Fortuna Waterfall where you can swim in the pool beneath the cascading water. On your hike you will likely see toucans, monkeys and sloths enjoying this peaceful way of life.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}