{"title": "Baltic Capitals", "link": "https://www.tucantravel.com/tour/baltic-capitals/eebc/", "dates": {"2020-04-10": "EUR 110.00", "2020-04-24": "EUR 110.00", "2020-05-08": "EUR 110.00", "2020-05-22": "EUR 110.00", "2020-06-05": "EUR 110.00", "2020-06-19": "EUR 110.00", "2020-07-03": "EUR 110.00", "2020-07-17": "EUR 110.00", "2020-07-31": "EUR 110.00", "2020-08-14": "EUR 110.00", "2020-08-28": "EUR 110.00", "2020-09-11": "EUR 110.00", "2020-09-25": "EUR 110.00", "2020-10-09": "EUR 110.00", "2020-10-23": "EUR 110.00", "2021-03-26": "EUR 120.00", "2021-04-09": "EUR 120.00", "2021-04-23": "EUR 120.00", "2021-05-07": "EUR 120.00", "2021-05-21": "EUR 120.00", "2021-06-04": "EUR 120.00", "2021-06-18": "EUR 120.00", "2021-07-02": "EUR 120.00", "2021-07-16": "EUR 120.00", "2021-07-30": "EUR 120.00", "2021-08-13": "EUR 120.00", "2021-08-27": "EUR 120.00", "2021-09-10": "EUR 120.00", "2021-09-24": "EUR 120.00", "2021-10-08": "EUR 120.00", "2021-10-22": "EUR 120.00"}, "days": "7", "description": "T We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Tallinn! You are free to arrive at your leisure. We highly recommend booking pre tour accommodation or arriving on an early flight so that you can fully explore this beautiful city.Famous for its enchanting historic centre, the city is a popular holiday destination on the Gulf of Finland. Roam the cobbled streets and explore scenic ruins or climb the hill of Toompea, which is filled with medieval buildings, 14th century churches, turrets, spires and enticing alleyways.Estonia has a long and fascinating history, having been inhabited since at least 9000 B.C. It has been ruled by Germans, Danes, Swedes, Poles and Russians, with the more distinctive Estonian identity coming to light in the late 19th century. During World War II, Estonia was ultimately incorporated into the Soviet Union after years of contest, which lead to years of communist rule. On August 20th, 1991, Estonia gained its independence.Modern day Estonia is progressive and traditional all in one. In 2005, they became the first country to hold elections over the internet, and in 2014 the first country to make e-residency possible. The city of Tallinn has been listed as one of the most digitally advanced in the world, with the likes of Skype emerging from the small city. Nevertheless, the old quarter of Tallinn is one of the most charming and other wordly corners of Europe!Saying goodbye to Tallinn we make our way to the next Baltic city, Riga. Riga is more than 800 years old and its clever blend of medieval centre and modern city infrastructure will enchant you. The UNESCO World Heritage listed Old Town has its own particular charm, while the city is also famous for its fascinating Art Nouveau architectural heritage which you can discover as you wander the streets of this 'Paris of the East'.Arriving just after lunchtime, we will take a short orientation of the city before you have free time to start enjoying the sights. Start by exploring the Old Town and its many hidden alleys, looking out for the historical buildings and quaint churches.Come evening, find a local medieval style basement restaurant and enjoy the atmosphere as you dig into a hearty stew.Spend today soaking up the sights in Riga. A must-do is a visit to Riga's most famous Gothic church, St Peter's, thought to be about 800 years old. Its famous spire has been rebuilt three times in the same form since 1667, with its latest rebuild completed in 1973. Climb the spire (or take the lift!) and enjoy spectacular views over the city.You could also take a walking tour of the unique Art Nouveau district, enjoy a kayaking or boat tour along the river or check out the biggest market in the city - The Riga Central Market. Watch the world go by as you enjoy a beetroot soup, or maybe even a traditional black balsam!The adventure continues as we pack our bags and head for the next Baltic city! The capital of Lithuania, Vilnius boasts an attractive baroque Old Town ,which is the largest in Eastern Europe and is praised as the 'New Prague'. Located on the edge of the Neris River, with its pine covered hills, friendly people, and blend of old and new, this is a picturesque city well worth exploring. You will have time to explore the main sights of the city including Gediminas Castle on the top of Gediminas Hill and Cathedral Square at the base of the hill, which is dominated by Vilnius Cathedral and its 57 metre-tall belfry.While you're exploring the square between the cathedral and the tower you should hunt for the secret stebuklas (miracle) tile. The tile marks the southern end of the 2 million person, 650 kilometre long human chain between Tallinn and Vilnius, which was formed in protest against Soviet occupation in 1989. Local legend has it that if you find the pretty mosaic-covered tile you should stand on it and turn around three times clockwise while making a wish, which shall then be granted.Today we will visit the nearby attraction of Trakai Castle, a fairytale building with surrounding mote. The castle is steeped in history and we will explore it on a guided tour.Constructed in the 14th century, Trakai held a strategic position and was one of the main centres of the Grand Duchy of Lithuania. The rest of the day is free for you to enjoy Vilnius.Taking a packed breakfast, will leave Vilnius early in the morning to make our way to Warsaw.Warsaw is the heart of Poland, the business and intellectual centre and a city bursting with culture and history. After being left in 85% rubble from the war, the Old Town has risen from the ashes and showcases beautiful, coloured buildings and traditional restaurants. We will arrive in the afternoon where the remainder of the day is free for you to enjoy.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}