{"title": "Eastern Europe Discovery", "link": "https://www.tucantravel.com/tour/eastern-europe-discovery/eeed/", "dates": {"2020-04-03": "EUR 1020.00", "2020-04-17": "EUR 1020.00", "2020-05-01": "EUR 1020.00", "2020-05-15": "EUR 1020.00", "2020-05-29": "EUR 1020.00", "2020-06-12": "EUR 1020.00", "2020-06-26": "EUR 1020.00", "2020-07-10": "EUR 1020.00", "2020-07-24": "EUR 1020.00", "2020-08-07": "EUR 1020.00", "2020-08-21": "EUR 1020.00", "2020-09-04": "EUR 1020.00", "2021-04-02": "EUR 1080.00", "2021-04-16": "EUR 1080.00", "2021-04-30": "EUR 1080.00", "2021-05-14": "EUR 1080.00", "2021-05-28": "EUR 1080.00", "2021-06-11": "EUR 1080.00", "2021-06-25": "EUR 1080.00", "2021-07-09": "EUR 1080.00", "2021-07-23": "EUR 1080.00", "2021-08-06": "EUR 1080.00", "2021-08-20": "EUR 1080.00", "2021-09-03": "EUR 1080.00"}, "days": "66", "description": "T We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Moscow! You are free to arrive today at your leisure and start enjoying all that Moscow has to offer.Golden onion domes and towering skyscrapers, cosy cafes and hushed churches, Russia's capital city is beautiful, atmospheric and overflowing with history. There is plenty to see and do here, including numerous cathedrals, museums, art galleries, palaces, the State History Museum and the iconic St Basil's Cathedral, towers and monuments. We highly recommend arriving in Moscow a day or so earlier to make the most of this fascinating city.Moscow's Red Square (Krasnaya Ploshad) is the main centre of the city and was a market place during the fifteenth century. The red part of its name does not refer to Communism or to the colour of the stone (which is actually grey) but derives from the old Russian word krasniy meaning beautiful. During the Soviet regime the square was known for its May Day parades and is the site of Lenin's Mausoleum.It is said that soon after January 21, 1924, the day that Vladimir Lenin died, the Soviet government received more than 10,000 telegrams from all over Russia, which asked the government to preserve his body somehow for future generations. Lenin's tomb, and final resting place, was then promptly set about being designed and a wooden tomb was constructed within 6 days of his death. A larger mausoleum was constructed later that year and stands today in the centre of the city in the prominent Red Square.There will be a pre departure meeting held in your hotel at 6pm tonight. Please check reception for details.Today you will have a guided tour of the Kremlin. The famous building is listed as a UNESCO World Heritage site and a main focus of Russia's political and historical heritage since the 13th century, housing both royalty and religious figures. The Kremlin wall contains a mass grave of Bolsheviks who perished during the battle for Moscow in 1917, together with the ashes of a number of well-known Russians, including writer Maxim Gorky and Yuriy Gagarin, the first Russian man to visit space.You will have the rest of the day free to enjoy the many activities in Moscow.We have the whole day to spend in Moscow enjoying some last minute sightseeing before we next head to Veliky Novgorod by overnight train.Moscow's metro system is a network of beautifully and artistically decorated stations. Why not take a self-guided tour of the system and discover Moscow's original underground art scene.One of the oldest cities in Russia, Veliky Novgorod is steeped in history. It was one of the first hubs of religious, political and commercial activities in Russia and it is here where we find St Sophia's Cathedral, the oldest cathedral in Russia.Admire the five domed architecture that dominates the Kremlin in Novgorod, and visit the exhibition of the ancient bells that used to ring in St Sophia's bell tower. Previously, the bells were heard from a 50 mile radius and had a distinct melody in memory of the composer Sergey Rakhaminoff, born in Novgorod. The bells were damaged during World War II, so unfortunately they now are grounded, however you can still enjoy panoramic views of Veliky Novgorod from the bell tower itself.This morning we will make our way to St Petersburg. The cosmopolitan city of St Petersburg is known as the 'Venice of the North' because of its rivers and canals which are fascinating and easy to explore by boat. St Petersburg is the second largest city in Russia and sits on the port of the Baltic Sea. Often considered the country's cultural capital, St Petersburg has a UNESCO World Heritage Site listed historic centre and the Hermitage Museum; one of the largest art museums in the world!We will take an orientation walk around the key sights of the city, including a visit to the aforementioned Hermitage Museum to explore the extensive art collection there, and then you will be free to explore this great city at your leisure.Today you are free to further explore the city. There are many sights to see in this former capital including the Winter Palace, the famous Church of the Spilt Blood and the Hermitage museums. It is easy to spend hours wandering St Petersburg and taking in the city's European flare.Other highlights you could opt to visit are the unique Faberge Egg Museum or the Mariinsky Theatre to see a ballet performance.Saying goodbye to Russia we make our way into the Baltic region of Europe. Our first stop is Tallinn, Estonia's capital. Famous for its enchanting historic centre, the city is a popular holiday destination on the Gulf of Finland. Roam the cobbled streets and explore scenic ruins or climb the hill of Toompea, which is filled with medieval buildings, 14th century churches, turrets, spires and enticing alleyways.Estonia has a long and fascinating history, having been inhabited since at least 9000 B.C. It has been ruled by Germans, Danes, Swedes, Poles and Russians, with the more distinctive Estonian identity coming to light in the late 19th century. During World War II, Estonia was ultimately incorporated into the Soviet Union after years of contest, which lead to years of communist rule. On August 20th, 1991, Estonia gained its independence.Modern day Estonia is progressive and traditional all in one. In 2005, they became the first country to hold elections over the internet, and in 2014 the first country to make e-residency possible. The city of Tallinn has been listed as one of the most digitally advanced in the world, with the likes of Skype emerging from the small city. Nevertheless, the old quarter of Tallinn is one of the most charming and other wordly corners of Europe!You are free today to wander the charming city and check out the highlights. Climb St Olav's Church for some incredible city views, check out the splendid Alexander Nevsky Cathedral or stroll the gardens of Kadriorg Palace and Park.The city is full of artists and artisans so you may also find wonderfully made glass, weaving and pottery here. The cafe scene is thriving and you can find everything from sunlit street cafes to Art Deco style bakeries. Within the walls of the Old Town there are lots of excellent restaurants to enjoy and a thriving nightlife, with clubs open until the wee hours. Estonians are true beer lovers so you might like to try an authentic local brew. When darkness falls, why not opt for a ghost tour of the old town, where you will learn the myths and legends behind the spooky buildings in the town!Saying goodbye to Tallinn we make our way to the next Baltic city, Riga. Riga is more than 800 years old and its clever blend of medieval centre and modern city infrastructure will enchant you. The UNESCO World Heritage listed Old Town has its own particular charm, while the city is also famous for its fascinating Art Nouveau architectural heritage which you can discover as you wander the streets of this 'Paris of the East'.Arriving just after lunchtime, we will take a short orientation of the city before you have free time to start enjoying the sights. Start by exploring the Old Town and its many hidden alleys, looking out for the historical buildings and quaint churches.Come evening, find a local medieval style basement restaurant and enjoy the atmosphere as you dig into a hearty stew.Spend today soaking up the sights in Riga. A must-do is a visit to Riga's most famous Gothic church, St Peter's, thought to be about 800 years old. Its famous spire has been rebuilt three times in the same form since 1667, with its latest rebuild completed in 1973. Climb the spire (or take the lift!) and enjoy spectacular views over the city.You could also take a walking tour of the unique Art Nouveau district, enjoy a kayaking or boat tour along the river or check out the biggest market in the city - The Riga Central Market. Watch the world go by as you enjoy a beetroot soup, or maybe even a traditional black balsam!The adventure continues as we pack our bags and head for the next Baltic city! The capital of Lithuania, Vilnius boasts an attractive baroque Old Town ,which is the largest in Eastern Europe and is praised as the 'New Prague'. Located on the edge of the Neris River, with its pine covered hills, friendly people, and blend of old and new, this is a picturesque city well worth exploring. You will have time to explore the main sights of the city including Gediminas Castle on the top of Gediminas Hill and Cathedral Square at the base of the hill, which is dominated by Vilnius Cathedral and its 57 metre-tall belfry.While you're exploring the square between the cathedral and the tower you should hunt for the secret stebuklas (miracle) tile. The tile marks the southern end of the 2 million person, 650 kilometre long human chain between Tallinn and Vilnius, which was formed in protest against Soviet occupation in 1989. Local legend has it that if you find the pretty mosaic-covered tile you should stand on it and turn around three times clockwise while making a wish, which shall then be granted.Today we will visit the nearby attraction of Trakai Castle, a fairytale building with surrounding mote. The castle is steeped in history and we will explore it on a guided tour.Constructed in the 14th century, Trakai held a strategic position and was one of the main centres of the Grand Duchy of Lithuania. The rest of the day is free for you to enjoy Vilnius.Taking a packed breakfast, will leave Vilnius early in the morning to make our way to Warsaw.Warsaw is the heart of Poland, the business and intellectual centre and a city bursting with culture and history. After being left in 85% rubble from the war, the Old Town has risen from the ashes and showcases beautiful, coloured buildings and traditional restaurants. We will arrive in the afternoon where the remainder of the day is free for you to enjoy.Today you are free to enjoy Warsaw. You could learn about the fight against Nazi occupation at the interactive Warsaw Uprising Museum, a touching tribute to those who died while fighting for independence. There are various other museums to explore including the Marie Curie Museum, Ethnographic Museum, Museum of Modern Art of the National Museum in Warsaw. We recommend taking a walking tour of the Old Town, to learn about the history of Warsaw, events of the war and the rebuilding of the city. The Old Town was rebuilt between 1949 and 1963 in the Renaissance, Gothic and Baroque styles of architecture from the 17th and 18th centuries. The Old Town was even listed as a UNESCO World Heritage Site in 1980. You can also visit the Historical Museum of Warsaw and Royal Castle at nearby Old Town Square.Another highlight is the Science and Culture Observation Deck, where you can experience some of the best views of Warsaw. Be sure to sit down for some pierogis after all your exploring!This morning we depart Warsaw and hop on a local train to Kraków. Poland's more famous and cultural city, Kraków has managed to preserve centuries of amazing architecture and artistic traditions as most of the historic buildings and monuments emerged unscathed from World War II.Kraków was the royal capital for 500 years so a must-see is the royal Wawel Castle, a beautiful renaissance palace which now houses a museum. During the evening the cosmopolitan city offers a wild nightlife, with plenty of restaurants, music clubs and bars to explore.We highly recommend taking a guided tour of the famous Wieliczka Salt Mine. The mine produced salt until 2007, making it one of the world's oldest operating salt mines. With underground churches, chandeliers and beautifully made statues (all from salt!) the mine is something special to experience and a highlight of any trip to Kraków.Please Note: The salt mine requires pre-booking. Please advise your tour leader as soon as possible if you wish to take part in this.Please Note: If you wish to visit Oskar Schindler's Factory, pre-booking tickets in advance is essential.Kraków is our base to visit the UNESCO listed Auschwitz-Birkenau German Nazi Concentration and Extermination Camp, a sobering tribute to the people that perished there during the Holocaust. The camp was originally designed for Polish political prisoners but became the most notorious camp of World War II because an estimated 1.6 million people of 27 nationalities, including 1.1 million Jews, 150,000 Poles and 23,000 Roma were killed by the Nazis.You will be collected for your guided tour this morning and return to Kraków mid afternoon to enjoy the remainder of the day.This morning we will return to the station and hop on a train to the charming city of Wroclaw. Brimming with culture, the city was named a UNESCO City of Literature in 2019 after successfully hosting the Theatre Olympics, European Film Awards and being named the World Book Capital back in 2016. Upon arrival you are free to start exploring what is considered one of the prettiest cities in Europe. The beautiful main square encompasses colourful buildings and bars and restaurants, as well as the popular Town Hall which has become one of the main landmarks in the city.This morning we will continue the adventure to Prague. Also known as the City of a Thousand Spires, Prague is one of the most enchanting cities in Europe. Stroll the largest castle complex in Europe, admire the gothic church of St Vitus and watch as the unique Astronomical Clock strikes on the hour.Spend the rest of your day exploring the beautiful city, not forgetting to try one of Prague's tastiest pastries known as 'Trdelnik', a sweet rolled dough in the shape of a cone that is filled with anything from ice-cream to warm chocolate sauce.Prague is a town that loves to party so you may also want to experience the nightlife as there are many great bars and restaurants, as well as plenty of night clubs to enjoy. Czechs have been brewing beer since the 9th century and invented the world's first Pilsner, so Prague offers a great opportunity to sample some of the world's finest beers.You have a full day to enjoy Prague. For something a little unique, take the train to Kutna Hora where you can experience the \"Bone Church\" otherwise known as Sedlec Ossuary. The small Roman Catholic chapel is believed to contain between 40,000 to 70,000 bones which have been arranged in various artistic ways to decorate the chapel. The centrepiece is the huge chandelier of bones that hangs in the middle.Prague is one of the most picturesque cities in Europe, and because of this you can easily pass hours just wandering the narrow streets and checking out the local establishments. The Old Town is bursting with museums, restaurants and ancient architecture.Welcome to Austria!Arriving early afternoon, you will have the rest of the day to start appreciating the city. Vienna is a city worlds away from any other found in Europe. The city's grandeur can be instantly felt as you wander through the centre, admiring the mixture of architecture from Baroque to Roman and Gothic to Art Nouveau.Birthplace of some of the greatest classical musical compositions, Vienna charms with its cultural history and opulent beauty. Known as the city of music, many composers such as Mozart, Beethoven and Strauss were born or worked here and you can learn all about their works in places such as Haus der Musik and Mozarthaus, Mozart's main apartment in Vienna which holds an insight into his celebrated life.Highlights include the Museum quarter, where you can find the Museum of Contemporary Art as well as the renowned Leopold Museum. The complex of the Hofburg Palace is a must see and an experience in itself! This grand building is the former palace of the Habsburg dynasty and today serves as the workplace of the President of Austria. This is where you will also find the world famous Spanish Riding School, where you can opt to book a ticket for tomorrow mornings training session.Today you have the full day to soak up the sights of Vienna. Perhaps you would like to catch a jaw-dropping orchestra performance at the Vienna Philharmonic, or watch a ballet or opera performance at the Wiener Staatsoper? You may also choose to visit the Schloss Schonbrunn, the palace of the Habsburg family, and discover the Baroque grandeur of the Austrian dynasty.Once you have delighted in the culture and beauty of Vienna, there are a host of lively restaurants, cafes and bars to soak up as you watch the world go by in this vibrant city.Departing Austria this morning we take a short ferry ride along the Danube to Bratislava, the capital of Slovakia. Bursting with culture and an urban atmosphere, Slovakia has a modern feel that still manages to captivate the avid traveller through its post-socialist architecture such as the famous 1,400ft UFO Tower and bridge. You will have the day to explore the city, not forgetting to wander along the Danube River and the classic Old Town.This morning we depart Bratislava for one of the most popular destinations in Central Europe! Budapest, Hungary's stylish capital is known as the 'City of Spas' for its abundance of natural thermal springs. With a host of historical sights, buzzing nightlife and unique attractions, Budapest is a favourite for many travellers visiting the region.Straddling the Danube River, the city is comprised of two very different historic cities, Buda on the west bank and Pest on the east bank. Highlights here include Castle Hill, Matthias Church, Fisherman's Bastion, the Liberation Monument, the fabulous St Stephen's Basilica and the much photographed Parliament Building. An evening river cruise is an excellent way to see the parliament lit up at night.The perfect place to relax after a day of sightseeing is in a traditional bath. The Szechenyi Medicinal Baths are one of the city's more famous Neo Baroque-style baths with indoor and outdoor pools, thermal pools, saunas and massages in a beautiful setting.Don't leave Budapest without sampling the famous goulash, a stew made from meat and vegetables and one of the most known Hungarian dishes. After dinner a great way to spend the evening is in one of the famous ruin bars, once abandoned buildings and now a symbol of Budapest, these bars are unique and full of life and perfect for experiencing life as the locals do.The Terror House, Heroes Square, The Opera House, The Chain Bridge, Central Market Hall, The Great Synagogue. Budapest is home to an abundance of sites and attractions for every taste! Today is free to tick off as many as you wish. A hop on hop off bus tour is the perfect way to see as much as possible, allowing you to spend as little or as much time at each landmark.Or if you need a day to relax and recharge then spend the entire day in one of the aforementioned thermal baths!Serbia's cultural centre, Novi Sad, is overlooked by the magnificent Petrovaradin Fortress. Built during the 18th century, the fortress was repeatedly attacked but never taken by an enemy. These days Novi Sad is a quaint and welcoming city and travellers are blown away by its small world charm. Arriving early evening, you will have time tomorrow to enjoy some of the optional excursions listed.Novi Sad is also known for its international music festivals, with EXIT festival being by far the most popular which attracts thousands of music lovers from all over the world.This morning you will have a guided tour of the Petrovaradin Fortress. Explore the hidden alleys, old rooms and viewpoints, and learn all about the military history of Serbia. After lunch we will board a local bus and have a short journey to our next destination, Belgrade.Located at the crossing point of the Sava and Danube rivers, Belgrade is the capital and most populous city in Serbia, as well as one of the oldest cities in Europe. In the course of its long history, Belgrade has been captured 60 times, burned down around 40 times, and has risen like a phoenix from the ashes every time.Upon arrival we will take an orientation walk of the local area before you have free time to start exploring.Today is free to enjoy Belgrade. Explore the fortress and grounds, wander the flower filled cobbled streets of Skadarlija and check out the Church of St Sava; the largest Orthodox church in the Balkans. Don't forget to pop into a local bar for a taste of the famous Rakia, a fruit brandy popular in the region.When you're ready for a break, you can relax on the beach at 'Belgrade Hawaii', Ada Ciganlija, an island in the middle of the Sava River. During the summer the island attracts hundreds of people looking for a place to cool down.Belgrade is very well known for its nightlife and is a major draw card for Europeans looking for a party. There are countless nightclubs, bars, and cafes that stay lively into the wee hours of the night, many of which are located on river barges.Today we will move onto one of the newest countries in the world; the small yet fascinating country of Kosovo. En route, we will stop in the unique Serbian town of Djavolja Varos. More commonly known as Devil's Town, this natural phenomenon got its name from the strange formation of soil pyramids. Wonder amongst the stone-capped pillars and be sure to ask your tour leader about the folklore and tales from the town!We then continue our journey to Pristina. Europe's youngest capital, it has a buzzing energy and a small but fascinating number of attractions to see. Visit the Ethnographic Museum for exhibits on life in Kosovo between the 15th and 20th century and marvel at the iconic design of the National Library. Wander down Bill Clinton Boulevard and wave back at the 3m-tall bronze statue of the former president, before stopping for one of Pristina's famous coffees in any one of the numbers of cafes found here.With a full free day in Pristina why not head out of the city and visit the charming town of Prizren? Considered Kosovo's best kept secret, Prizren has a stunning location along the river with a mountainous backdrop. The city is easy to explore on foot and a short hike up to the castle ruins rewards you with incredible views of the area and Sharr mountain range. Don't forget to sample some of the delicious local food!Before heading to Skopje we enjoy a visit to Matka Canyon. Cruise down the river admiring the large rock walls towering beside the water. Keep an eye out for the fascinating caves that are found within the canyon.In Skopje, Macedonia's capital, you can enjoy 2,000 years of history spanning Oriental and Western cultures, neatly divided by the Vardar River through the centre of the city. Skopje has many historical monuments including the Kale Fortress dating back to the 6th century and the Daud Pasha Amam, a 15th century bathhouse now converted into the city art gallery. You can also see the Mustafa-pasha's mosque, the 16th century Clock Tower and the Kamen Most (Stone Bridge) over the Vardar River.With a full free day to enjoy Skopje your options are endless. You could wander the old bazaar, the largest outside of Turkey, picking up local souvenirs and sampling the delicious food. Or perhaps take a local walking tour to learn all about Skopje's unique history and the reason the city is home to hundreds of statues!Today we travel on to the gorgeous lake side town of Ohrid, perched on the border of Macedonia and Albania. This unassuming, picturesque settlement has been the setting of thousands of years of human history and the ancient churches, fortress walls, bazaars and old quarters are testimony to its past.Lake Ohrid itself is Europe's oldest lake having formed over three millions years ago. Wander the streets and squares of its compact centre before hiking up to the ancient walled fortress that overlooks the day to day life of the city and explore the famous old churches, monasteries and basilicas.Make the most of this escape from the cities and hop on a boat and sail 29km to the beautiful Monastery of Saint Naum, an orthodox church which dates back to the year 905. It is said that St Naum himself is buried in the church. The surrounding lakeside area is well worth a stroll, with restaurants and lush gardens it makes for a wonderfully tranquil afternoon away.Other options to fill your day including hiring a bike to cycle along the lake, visiting the Bay of Bones museum perched on the water, or simply strolling through the picturesque town and enjoying the views.Today we head to Tirana, the trendy capital and largest city of Albania, which has transformed from a grey, dismal ex-communist city, isolated by the regime until the 1990s, to a colourful capital buzzing with life.While the city has a long history, you can enjoy its modern outlook, with fashionable bars, clubs and boutiques. Wander boulevards lined with relics of the city's Ottoman, Italian and communist past.Tirana's massive main square, Skanderbeg Square, is bordered by the National History Museum, the Palace of Culture, the National Bank, the Et'hem Bey Mosque and Skanderbeg's statue. A short bus ride from the centre city, the Martyr's Cemetery offers marvellous panoramic views over the city. End your evening in the skybar, which offers excellent panoramic views over the city.On the way to Kotor we stop off at the small town of Kruja. Built on a mountainside, you can discover the old town and explore Kruja Castle where we include entry to the Skanderbeg Museum located inside. Skanderbeg was a war hero of Albania, helping defeat the Ottomans, and this museum focuses on his bravery and importance to Albania.After spending the morning exploring Kruja, our group will move onward to our next destination - the picturesque town of Kotor in Montenegro. Kotor is a walled city nestled at the bottom of Europe’s deepest fjord. Experience Stari Grad, the old town, which is a UNESCO World Heritage Site, with it’s tricky labyrinth of cobbled alleys, squares and ancient churches, including St Tryphon's Cathedral built in 1166.This morning you will have a guided tour of Kotor Old Town around mid morning. Learn about the local history and beautiful architecture that fills the town. Before the tour, we suggest you get up early and climb the fortress walls for some of the most amazing views of the bay! Getting up there nice and early means you can avoid the larger crowds that arrive in the afternoon.If you don't feel like walking up, you can admire the views from the waterfront, where the steep mountains provide a dramatic backdrop. You could also spend the day drinking espresso in the shade of the medieval walls watching people go by.If you fancy exploring another destination, take a day trip to Budva, spending the day at the beach or wandering the charming old town.We enjoy a beautiful drive through the fjords to reach our next destination of Dubrovnik, stopping on the way at a charming winery in Trebinje, Bosnia and Herzegovina. Here you will enjoy a local wine tasting and have the chance to pick up some delicious, well priced wines to take with you! The family owned establishment is in a gorgeous setting and offers a lovely wine tasting experience.With a paved town centre enclosed in fortress-like 13th century stone walls, the city is easy to explore on foot and is full of character. A highlight of Dubrovnik are the incredible city walls. Stretching almost 2 kilometres around the old town, the walls offer stunning rooftop and city views out to the turquoise blue Adriatic Sea. We recommend getting up early tomorrow and walking the city walls when they open as there are far less crowds early in the morning!Today you are free to soak up the culture and beauty of Dubrovnik. From simply exploring the alleys and streets of the Old Town, wandering the waterfront or enjoying various water based activities, there is a little something for everyone!Founded in the 7th century, for a time in its glorious past the city was a serious rival for Venice in terms of maritime trade. It is hard to believe now but in 1991, two out of every three buildings were damaged during the bombardment of the Yugoslav War. Since then the buildings and walls have been painstakingly restored to pristine condition and represents one of the most beautiful and solid fortress systems on the Mediterranean. There are several other historic attractions worth a visit near the main street (Stradun), such as the 14th century Franciscan monastery which houses a treasury full of sacred art and artefacts, as well as one of the oldest continually working pharmacies in the world, dating back to 1317.Try out sea kayaking in the crystal waters, or browse the markets in the Old Town for some Mediterranean delicacies. For some of the most incredible city views, head up the cable car to Mount Srd where you can view the city walls from a different perspective.Crossing the border into the 'heart-shaped land' of Bosnia and Herzegovina we visit the capital Sarajevo, a fascinating mixture of western and eastern cultures. Known as the 'Jerusalem of Europe', the city was once famous for its religious diversity, with people of Islamic, Orthodox Christian, Catholic and Jewish faiths coexisting relatively peacefully for centuries. The atmosphere of calm and tolerance changed dramatically when violence erupted in the mid-1990s and the city underwent the longest siege in modern military history during the Yugoslav War.Today the city is largely recovered and is packed with fascinating museums, bazaars, markets and bridges.Today you are free to enjoy Sarajevo in your own time. You could explore the cobbled streets, mosques and Oriental style shops of the Old Town, visit the Bosnian Historical Museum to learn about the siege of Sarajevo and discover the Sarajevo Tunnel Museum, the tunnel which was used to ferry supplies into the besieged city during the conflict, next to the airport. For history buffs a must see is the “Latin Bridge\" spanning the river in the downtown area. The bridge bears a plaque commemorating the assassination of Archduke of the Austro-Hungarian Empire, Franz Ferdinand, the event that sparked the beginning of World War I.Famous for its outstanding natural beauty and charismatic vibe, Mostar is situated on the Neretva river and is the fifth-largest city in Bosnia and Herzegovina.The city is particularly famous for its beautiful single span bridge, Stari Most, which collapsed into the river during the Yugoslav War in 1993. Built in 1556 by the Ottoman ruler Suleiman the Great, Stari Most had been a globally recognised landmark and a national symbol for Bosnia-Herzegovina. It had survived centuries of conflict including both world wars and proved that, whatever happened, the mainly Christian west bank and mainly Muslim east remained united. The destruction of the bridge was a devastating event to the local people, but in 2004 the bridge was rebuilt as a replica of the original using pieces of masonry salvaged from the riverbed. Its reopening represented the hope that Muslims, Croats and Serbs could once again live side by side and that Mostar would be healed after a decade of ethnic division.Wonder the bazaar, stroll along the river and admire the quintessential Ottoman architecture, or take a short taxi drive to the beautiful Blagaj Tekke Monastery. End your evening in a quaint local restaurant overlooking the river. With influence from the Ottomans and Mediterranean, Bosnian cuisine is said to be some of the best in Eastern Europe.On the way to Croatia, we stop off at the Kravice waterfalls, located on the Trebiat river in Bosnia and Herzegovina. A popular spot for nature lovers, swimmers and photography buffs alike, you will have time to enjoy the area before heading to Hvar Island. Boasting more sunshine hours than any of the other sun-soaked Dalmatian islands, Hvar Island offers fairytale Venetian architecture, a waterfront promenade fringed by palm trees and centuries old walls. Arriving late afternoon, you will have the full day tomorrow to enjoy the various optional excursions available.Built by the Venetian Doges in the 13th century, Hvar Town is a maze of cobblestone streets and sunny squares bordered by al fresco cafes and restaurants. The most important sights such as St Stephen's Cathedral, Clock Tower and the Arsenal flank the main square, while a picturesque expanse of terracotta-roofed houses and tiny streets cover the hill behind.With all of this and an historic fortress overlooking it all, it's no wonder picturesque Hvar Town is considered a chic destination for the rich and famous, and you may be lucky enough to see one or two familiar faces here.Please note: Breakfast is not included in Hvar since we will be using local apartments and homestays. This is the best way to ensure the local community benefits from tourism to the island. Your tour leader will assist in pointing out the best spots for breakfast!Today you are free to enjoy the stunning island of Hvar. For a unique experience, take a boat trip to the glistening blue cave near the island of Vis. The stunning play of sunlight reflects on the white bottom of the cave, creating a glimmering blue light which lights up the cave and water.One of the simplest pleasures on the island is to take part in the evening stroll around the town and take in the views - don't forget to buy an ice cream from a local slasticarna, the Croatian equivalent of the Italian gelateria. You will have time to explore smaller villages of Stari Grad, Jelsa, taking in lavender fields, Vrboska and Brusje, wineries, eco villages and experiencing the local culture.Leaving the crystal blue waters of Hvar behind, we then take the ferry and arrive late morning at the coastal city of Split, built around the remains of the Diocletian Palace which we will visit on an included tour. The palace dates back to the Roman era. Wander inside and admire Peristil Square where you can see an original Egyptian sphinx which was brought from Egypt by Roman emperor Diocletian. Another sphinx can be found near St John's Church, which was originally a Roman temple.If you want to relax there are plenty of al fresco bars and restaurants to choose from along the seafront, as well as gelati bars and pizzerias off the main roads. End your day with some relaxation down at Bacvice beach, a popular spot with the locals.Continuing our diverse journey through Croatia, our next stop is to explore Plitvice National Park, a beautiful reserve featuring 16 spectacular blue lakes surrounded by forest and a highlight of any holiday to Croatia!The lakes are linked by natural dams which create beautiful low level waterfalls joining one lake to another. Due to the varying mixtures of minerals in the water, each lake has a distinctive colour ranging from azure to green, grey or blue. The surrounding forest features a mix of beech, spruce, and fir trees and is home to 126 species of birds and a number of rare animals including European brown bears, wolves, eagles, wild cats and eagles. Due to its natural beauty and significance,  the park was inscribed on the UNESCO World Heritage list in 1979. The entire park can be seen in about 4 hours and you can get beautiful views from almost any vantage point. Don't miss the Veliki Slap, 50 metre wide waterfall surrounded by boulders - a great place for photos.You will have this morning to continue taking in the beauty of the Plitvice Lakes, so we highly recommend getting up when the park opens to beat the crowds! After lunch we will then make our way to the next destination of Zagreb where you will have a free afternoon to explore the sights.Zagreb is a vibrant cultural centre with a long history, located on the crossroads of important routes between the Adriatic coast and Central Europe. Originally established as two fortresses on two neighbouring hills in medieval times, the city has withstood numerous invasions, earthquakes and political upheaval to grow into a prosperous centre of industry. In your free time you can explore Ban Jelacic Square surrounded by grand buildings or visit the Zagreb Cathedral with its fountain of Madonna surrounded by golden angels. You can visit colourful open-air markets such as Dolac Market and discover the historic Upper Town with its palaces, monasteries and churches from the 17th and 18th centuries. There are also dozens of museums, theatres, galleries and art collections to visit, or take a tram to the medieval fortress of Medvedgrad on the southern side of nearby Mount Medvednica for beautiful views over the city including Museum Mimara. Another interesting museum to see is the City of Zagreb Museum covering every facet of its long history. You could take a picnic to Maksimir Park about 3 kilometres from the city centre.Crossing into Slovenia, we stay in Bled, a magical little town about an hour and a half from Ljubljana, set near an emerald green lake. Perched on a cliff high above the lake is the Bled Castle, dramatically framed by the snowcapped peaks of the Julian Alps. Dating back to the 11th century, Bled Castle is the epitome of a medieval fortress and has a fairytale appeal, with towers, ramparts, moats and a terrace offering magnificent views. Part of the castle houses a museum with an interesting collection of armour and weapons, carvings, jewellery, tapestries and paintings which trace the history of the castle from the Bronze Age to the 19th century.A walk around Lake Bled (about 6 kilometres) shouldn't take more than an hour or two, including a short climb to a viewing point. The most romantic way to enjoy it is to hire a boat and row over to the island in the middle of the lake or for the non-rowers of the group you can take a Pletna boat and be taken across. On the island you can visit a small 17th century Baroque church called Church of the Assumption, complete with a wishing bell which you can ring to ask a favour. If time permits, you can also visit Vintgar Gorge, a raised timber walkway that tracks the gorges river for 1.6 kilometres to a beautiful waterfall.You could also kayak or paddleboard on the lake, enjoying some of the best views in Europe!Next we visit the capital Ljubljana. Arriving late morning, we will drop our luggage at the hotel and then head out on a guided city tour. Learn about the history, architecture and legends of Slovenia, as you admire the highlights such as Robba Fountain, Congress Square, Butchers Bridge, Dragon Bridge and the Town Square. After the tour you will be free to check into the hotel and enjoy your free afternoon.Ljubljana is the capital and largest city in Slovenia. As well as being the cultural, educational, economic and political centre since Slovenia gained independence in 1991, it is also a charming city with a whole host of activities. The cobbled streets are made for casual walks and the architecture quite intriguing.In your free time you may enjoy a visit to the botanical gardens, Dragon bridge, Tivoli Park, Ljubljana city museum, Ljubljana castle (Ljubljanski Grad) on Castle Hill and the viewing tower in the castle courtyard for views across the Old Town. When you need to relax, sit down at one of the many outdoor riverside cafes in the Old Town, check out the Habsburg and Baroque architecture and enjoy the young fun vibe of Ljubljana's large student population.You could also visit Metelkova Mesto, an autonomous cultural centre located in the old army barracks. Home to some fascinating street art as well as galleries and cafes, the area is bursting with culture and is one of the best known areas of the city.We return to Budapest for two days of rest and relaxation or for you to tick off any highlights that you missed the first time round! Taking the train through eastern Slovenia into Hungary, you can admire the countryside and watch the world go by. We will arrive into Budapest in the early evening.As such a large and cultural city jam packed with historic sights and mouth watering restaurants, we guarantee you will enjoy exploring all Budapest has to offer. Make the most of it with another free day in the city!This morning we take a short train ride to Eger, located on the hills of the Bukk Mountains, and a real gem within Hungary. With a number of historic sights such as the castle, cathedral, and the northernmost minaret in Europe, Eger is a wonderfully quaint town and the perfect contrast from the bustling capital of Budapest. Best known for its production of the famous \"Bulls Blood\" red wine, Eger is a large producer of Hungarian wine and you will have ample opportunity to sample some of Hungary's finest. Spend an afternoon exploring the \"Valley of the Beautiful Women\", a collection of wine cellars where you can sample the unique blends of local wines and speak with the producers.After a 91 year long Turkish rule in the 15th century, Eger has an abundance of Ottoman influence and beautiful architecture that can be seen as you explore on foot.The day is spent exploring the fascinating Maramures region in North-western Romania, home to many villages where century-old traditions are still part of daily life. We will observe a pottery demonstration, visit a traditional watermill and make a stop at the very peculiar 'Merry Cemetery' of Sapânta, so called because the gravestones are painted in bright colours, hand-carved out of oak and adorned with an image of the deceased and a humorous epitaph in the local vernacular.This is a full day of exploring the Maramures and we will arrive to the guesthouse around 7pm to enjoy a traditional dinner.This morning we will visit the village of Barsana, where there is a thriving local tradition of woodcarving, with picturesque wooden houses fronted by giant, ornately-carved gates. There is also a monastery that offers great views over the Izei valley, where people still farm using traditional techniques. We also tour some of the beautiful UNESCO listed wooden churches of the region that are well-known for their characteristic high roofs and tall, pointed steeples.In the afternoon we head to Sighisoara. Located in the historic region of Transylvania, it was once a Saxon settlement established in the 12th century. Recognised by UNESCO as a World Heritage Site, the citadel has a very well preserved old town with a clock tower rising 64 meters above the city. Also worth visiting is the Orthodox Cathedral and Cornesti Church.Today you are free to explore and enjoy Sighisoara! You could take a guided tour of the Old Town, check out the unique Torture Museum or visit Dracula's House.Surrounded on three sides by the Carpathian Mountains, Bra&#x219;ov was a perfect place for a medieval settlement and much of the Old City, founded by the Teutonic Knights in 1211, has been restored.You can visit R&#xe2;&#x219;nov Castle,  the Bra&#x219;ov Citadel or wander up Rope Street, the narrowest street in Europe. Bra&#x219;ov also provides a great base for exploring the surrounding countryside of the Transylvania region, where the air is fresh and the people friendly.On our way to Bra&#x219;ov we make stops at two historic and important churches, Viscri and Prejmer fortified churches.Today we visit the nearby Bran Castle which is known as 'Dracula's Castle' and is (supposedly) said to have been the home of Vlad the Impaler.The rest of the afternoon is free for you to enjoy Bra&#x219;ov.This morning we explore the beautiful Pele's Castle, an impressive structure which is sure to take your breath away!We then head to Bucharest where you will have free time to explore the area and discover the contrasts of Romania's cultural capital. The architecture here is an eclectic mix of historical, communist period and modern styles and it even has its own Arc de Triomphe. Bucharest also boasts the world's second largest building, the Palace of Parliament, built under the communist regime.If you'd like to learn more about the traditional way of life of Romanian peasant farmers you can visit the Village Museum, an open air museum with around 300 traditional buildings filled with furniture, pottery and clothing collected from different regions of the country.We head across the border into the Bulgarian city of Veliko Tarnovo, famous as the historical capital of the Second Bulgarian Empire. Built on three hills, the city offers some great views of the surrounding churches and old imperial residences rising amidst the meanders of the Yantra River. On Tsarevets Hill are the palaces of the Bulgarian emperors and the Patriarchate, the Patriarchal Cathedral, and also a number of interesting cultural institutions such as the Archaeological Museum and the Museum of the Bulgarian Revival and the Constituent Assembly.This morning we will depart for our next destination, Sofia! Bulgaria's capital Sofia offers a wealth of cultural entertainment, including Byzantine churches, museums full of ancient archaeological treasures, towering monuments and numerous mineral baths adjacent to the magnificent Mount Vitosha. Laid back and cosmopolitan, Sofia offers a thriving and diverse street life, including open-air cafes, busy markets such as the famous Ladies' Market, rattling trams and buskers all adding to the ambience.Today you are free to explore Sofia. At the foothills of Mount Vitosha about 8 kilometres from the city centre you can visit the 900 year-old Boyana Church, considered among the masterpieces of medieval European painting, which features murals and frescoes dating back to 1259 AD, medieval architecture and monumental art. Also at the base of Mt. Vitosha is the splendid National History Museum, with antiques dating back to the Thracian period.Sofia also offers many beautiful gardens to relax in, such as Boris Gardens and the South Park, which starts just behind the Palace of Culture.Enjoy breakfast in Sofia before taking a public bus to Plovdiv. Plovdiv is one of the oldest cities in Europe. It is the oldest continually inhabited city in Europe going back 8000 years.The town is small and easy to walk around. Places to see include the Roman Amphitheatre, St Marina church and a mosque leftover from the Ottoman Empire. Each step you take in this town opens up another piece of history. While the seven tall hill that used to overlook the town have been reduced to just three, it is possible to walk the hills and the best time to do this is at sunset.Please note: Breakfast tomorrow morning is not included in the hotel at Plovdiv. Your Tour Leader will point out local cafes or restaurants where you can have breakfast.Today you are free to enjoy Plovdiv. The city was awarded the title of 2019 European Capital of Culture and is the first in Bulgaria to have the honour!While strolling the charming streets is a lovely way to pass the time, you could also opt for a day trip to indulge in some local wine tastings and to see the local countryside.Please note: Breakfast tomorrow morning is not included in the hotel at Plovdiv. Your Tour Leader will point out local cafes or restaurants where you can have breakfast.Late morning we leave for Turkey, arriving into Istanbul in the early evening. Istanbul is an enchanting fusion of East and West. Narrow alleys are flanked by wooden Ottoman houses while a nearby funky restaurant and bar strip in the down-town area pumps out Turkish pop. There are many great places to explore including, but not limited to, the Blue Mosque, St Sophia and the Grand Bazaar. The Blue Mosque, also known as the Mosque of Sultan Ahmet, is nearly 400 years old and still an active mosque that non-Muslims can visit for free outside of the five daily prayers. St Sophia (Hagia Sophia) was built 1,500 years ago and was the largest enclosed space in the world. The Grand Bazaar (Kapali Carsi) is the oldest and largest closed bazaar in the world, housing around 3000 shops within 61 alleyways. It used to be the city's main trading centre of ceramics, jewellery and leather goods.We will arrive in the evening to sample some of Turkey's most delicious cuisine. As we arrive late we recommend you book additional nights accommodation in order to fully explore the city and any of the optional excursions listed below.Please note: For those who do not wish to travel into Turkey, there is the option to end in Sofia, Bulgaria instead. From Plovdiv you will return to Sofia by bus where there will be one night's accommodation instead. This option must be pre-booked with your Adventure Specialist in advance. This makes no difference to the cost of your tour.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.The Grand Bazaar is shut by the time we arrive on Saturday and is also closed on Sundays. If this is a personal must see please consider booking an extra night.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}