{"title": "Moscow to Prague", "link": "https://www.tucantravel.com/tour/moscow-to-prague/eemp/", "dates": {"2020-04-03": "EUR 290.00", "2020-04-17": "EUR 290.00", "2020-05-01": "EUR 290.00", "2020-05-15": "EUR 290.00", "2020-05-29": "EUR 290.00", "2020-06-12": "EUR 290.00", "2020-06-26": "EUR 290.00", "2020-07-10": "EUR 290.00", "2020-07-24": "EUR 290.00", "2020-08-07": "EUR 290.00", "2020-08-21": "EUR 290.00", "2020-09-04": "EUR 290.00", "2020-09-18": "EUR 290.00", "2020-10-02": "EUR 290.00", "2020-10-16": "EUR 290.00", "2021-04-02": "EUR 310.00", "2021-04-16": "EUR 310.00", "2021-04-30": "EUR 310.00", "2021-05-14": "EUR 310.00", "2021-05-28": "EUR 310.00", "2021-06-11": "EUR 310.00", "2021-06-25": "EUR 310.00", "2021-07-09": "EUR 310.00", "2021-07-23": "EUR 310.00", "2021-08-06": "EUR 310.00", "2021-08-20": "EUR 310.00", "2021-09-03": "EUR 310.00", "2021-09-17": "EUR 310.00", "2021-10-01": "EUR 310.00", "2021-10-15": "EUR 310.00"}, "days": "20", "description": "E We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Moscow! You are free to arrive today at your leisure and start enjoying all that Moscow has to offer.Golden onion domes and towering skyscrapers, cosy cafes and hushed churches, Russia's capital city is beautiful, atmospheric and overflowing with history. There is plenty to see and do here, including numerous cathedrals, museums, art galleries, palaces, the State History Museum and the iconic St Basil's Cathedral, towers and monuments. We highly recommend arriving in Moscow a day or so earlier to make the most of this fascinating city.Moscow's Red Square (Krasnaya Ploshad) is the main centre of the city and was a market place during the fifteenth century. The red part of its name does not refer to Communism or to the colour of the stone (which is actually grey) but derives from the old Russian word krasniy meaning beautiful. During the Soviet regime the square was known for its May Day parades and is the site of Lenin's Mausoleum.It is said that soon after January 21, 1924, the day that Vladimir Lenin died, the Soviet government received more than 10,000 telegrams from all over Russia, which asked the government to preserve his body somehow for future generations. Lenin's tomb, and final resting place, was then promptly set about being designed and a wooden tomb was constructed within 6 days of his death. A larger mausoleum was constructed later that year and stands today in the centre of the city in the prominent Red Square.There will be a pre departure meeting held in your hotel at 6pm tonight. Please check reception for details.Today you will have a guided tour of the Kremlin. The famous building is listed as a UNESCO World Heritage site and a main focus of Russia's political and historical heritage since the 13th century, housing both royalty and religious figures. The Kremlin wall contains a mass grave of Bolsheviks who perished during the battle for Moscow in 1917, together with the ashes of a number of well-known Russians, including writer Maxim Gorky and Yuriy Gagarin, the first Russian man to visit space.You will have the rest of the day free to enjoy the many activities in Moscow.We have the whole day to spend in Moscow enjoying some last minute sightseeing before we next head to Veliky Novgorod by overnight train.Moscow's metro system is a network of beautifully and artistically decorated stations. Why not take a self-guided tour of the system and discover Moscow's original underground art scene.One of the oldest cities in Russia, Veliky Novgorod is steeped in history. It was one of the first hubs of religious, political and commercial activities in Russia and it is here where we find St Sophia's Cathedral, the oldest cathedral in Russia.Admire the five domed architecture that dominates the Kremlin in Novgorod, and visit the exhibition of the ancient bells that used to ring in St Sophia's bell tower. Previously, the bells were heard from a 50 mile radius and had a distinct melody in memory of the composer Sergey Rakhaminoff, born in Novgorod. The bells were damaged during World War II, so unfortunately they now are grounded, however you can still enjoy panoramic views of Veliky Novgorod from the bell tower itself.This morning we will make our way to St Petersburg. The cosmopolitan city of St Petersburg is known as the 'Venice of the North' because of its rivers and canals which are fascinating and easy to explore by boat. St Petersburg is the second largest city in Russia and sits on the port of the Baltic Sea. Often considered the country's cultural capital, St Petersburg has a UNESCO World Heritage Site listed historic centre and the Hermitage Museum; one of the largest art museums in the world!We will take an orientation walk around the key sights of the city, including a visit to the aforementioned Hermitage Museum to explore the extensive art collection there, and then you will be free to explore this great city at your leisure.Today you are free to further explore the city. There are many sights to see in this former capital including the Winter Palace, the famous Church of the Spilt Blood and the Hermitage museums. It is easy to spend hours wandering St Petersburg and taking in the city's European flare.Other highlights you could opt to visit are the unique Faberge Egg Museum or the Mariinsky Theatre to see a ballet performance.Saying goodbye to Russia we make our way into the Baltic region of Europe. Our first stop is Tallinn, Estonia's capital. Famous for its enchanting historic centre, the city is a popular holiday destination on the Gulf of Finland. Roam the cobbled streets and explore scenic ruins or climb the hill of Toompea, which is filled with medieval buildings, 14th century churches, turrets, spires and enticing alleyways.Estonia has a long and fascinating history, having been inhabited since at least 9000 B.C. It has been ruled by Germans, Danes, Swedes, Poles and Russians, with the more distinctive Estonian identity coming to light in the late 19th century. During World War II, Estonia was ultimately incorporated into the Soviet Union after years of contest, which lead to years of communist rule. On August 20th, 1991, Estonia gained its independence.Modern day Estonia is progressive and traditional all in one. In 2005, they became the first country to hold elections over the internet, and in 2014 the first country to make e-residency possible. The city of Tallinn has been listed as one of the most digitally advanced in the world, with the likes of Skype emerging from the small city. Nevertheless, the old quarter of Tallinn is one of the most charming and other wordly corners of Europe!You are free today to wander the charming city and check out the highlights. Climb St Olav's Church for some incredible city views, check out the splendid Alexander Nevsky Cathedral or stroll the gardens of Kadriorg Palace and Park.The city is full of artists and artisans so you may also find wonderfully made glass, weaving and pottery here. The cafe scene is thriving and you can find everything from sunlit street cafes to Art Deco style bakeries. Within the walls of the Old Town there are lots of excellent restaurants to enjoy and a thriving nightlife, with clubs open until the wee hours. Estonians are true beer lovers so you might like to try an authentic local brew. When darkness falls, why not opt for a ghost tour of the old town, where you will learn the myths and legends behind the spooky buildings in the town!Saying goodbye to Tallinn we make our way to the next Baltic city, Riga. Riga is more than 800 years old and its clever blend of medieval centre and modern city infrastructure will enchant you. The UNESCO World Heritage listed Old Town has its own particular charm, while the city is also famous for its fascinating Art Nouveau architectural heritage which you can discover as you wander the streets of this 'Paris of the East'.Arriving just after lunchtime, we will take a short orientation of the city before you have free time to start enjoying the sights. Start by exploring the Old Town and its many hidden alleys, looking out for the historical buildings and quaint churches.Come evening, find a local medieval style basement restaurant and enjoy the atmosphere as you dig into a hearty stew.Spend today soaking up the sights in Riga. A must-do is a visit to Riga's most famous Gothic church, St Peter's, thought to be about 800 years old. Its famous spire has been rebuilt three times in the same form since 1667, with its latest rebuild completed in 1973. Climb the spire (or take the lift!) and enjoy spectacular views over the city.You could also take a walking tour of the unique Art Nouveau district, enjoy a kayaking or boat tour along the river or check out the biggest market in the city - The Riga Central Market. Watch the world go by as you enjoy a beetroot soup, or maybe even a traditional black balsam!The adventure continues as we pack our bags and head for the next Baltic city! The capital of Lithuania, Vilnius boasts an attractive baroque Old Town ,which is the largest in Eastern Europe and is praised as the 'New Prague'. Located on the edge of the Neris River, with its pine covered hills, friendly people, and blend of old and new, this is a picturesque city well worth exploring. You will have time to explore the main sights of the city including Gediminas Castle on the top of Gediminas Hill and Cathedral Square at the base of the hill, which is dominated by Vilnius Cathedral and its 57 metre-tall belfry.While you're exploring the square between the cathedral and the tower you should hunt for the secret stebuklas (miracle) tile. The tile marks the southern end of the 2 million person, 650 kilometre long human chain between Tallinn and Vilnius, which was formed in protest against Soviet occupation in 1989. Local legend has it that if you find the pretty mosaic-covered tile you should stand on it and turn around three times clockwise while making a wish, which shall then be granted.Today we will visit the nearby attraction of Trakai Castle, a fairytale building with surrounding mote. The castle is steeped in history and we will explore it on a guided tour.Constructed in the 14th century, Trakai held a strategic position and was one of the main centres of the Grand Duchy of Lithuania. The rest of the day is free for you to enjoy Vilnius.Taking a packed breakfast, will leave Vilnius early in the morning to make our way to Warsaw.Warsaw is the heart of Poland, the business and intellectual centre and a city bursting with culture and history. After being left in 85% rubble from the war, the Old Town has risen from the ashes and showcases beautiful, coloured buildings and traditional restaurants. We will arrive in the afternoon where the remainder of the day is free for you to enjoy.Today you are free to enjoy Warsaw. You could learn about the fight against Nazi occupation at the interactive Warsaw Uprising Museum, a touching tribute to those who died while fighting for independence. There are various other museums to explore including the Marie Curie Museum, Ethnographic Museum, Museum of Modern Art of the National Museum in Warsaw. We recommend taking a walking tour of the Old Town, to learn about the history of Warsaw, events of the war and the rebuilding of the city. The Old Town was rebuilt between 1949 and 1963 in the Renaissance, Gothic and Baroque styles of architecture from the 17th and 18th centuries. The Old Town was even listed as a UNESCO World Heritage Site in 1980. You can also visit the Historical Museum of Warsaw and Royal Castle at nearby Old Town Square.Another highlight is the Science and Culture Observation Deck, where you can experience some of the best views of Warsaw. Be sure to sit down for some pierogis after all your exploring!This morning we depart Warsaw and hop on a local train to Kraków. Poland's more famous and cultural city, Kraków has managed to preserve centuries of amazing architecture and artistic traditions as most of the historic buildings and monuments emerged unscathed from World War II.Kraków was the royal capital for 500 years so a must-see is the royal Wawel Castle, a beautiful renaissance palace which now houses a museum. During the evening the cosmopolitan city offers a wild nightlife, with plenty of restaurants, music clubs and bars to explore.We highly recommend taking a guided tour of the famous Wieliczka Salt Mine. The mine produced salt until 2007, making it one of the world's oldest operating salt mines. With underground churches, chandeliers and beautifully made statues (all from salt!) the mine is something special to experience and a highlight of any trip to Kraków.Please Note: The salt mine requires pre-booking. Please advise your tour leader as soon as possible if you wish to take part in this.Please Note: If you wish to visit Oskar Schindler's Factory, pre-booking tickets in advance is essential.Kraków is our base to visit the UNESCO listed Auschwitz-Birkenau German Nazi Concentration and Extermination Camp, a sobering tribute to the people that perished there during the Holocaust. The camp was originally designed for Polish political prisoners but became the most notorious camp of World War II because an estimated 1.6 million people of 27 nationalities, including 1.1 million Jews, 150,000 Poles and 23,000 Roma were killed by the Nazis.You will be collected for your guided tour this morning and return to Kraków mid afternoon to enjoy the remainder of the day.This morning we will return to the station and hop on a train to the charming city of Wroclaw. Brimming with culture, the city was named a UNESCO City of Literature in 2019 after successfully hosting the Theatre Olympics, European Film Awards and being named the World Book Capital back in 2016. Upon arrival you are free to start exploring what is considered one of the prettiest cities in Europe. The beautiful main square encompasses colourful buildings and bars and restaurants, as well as the popular Town Hall which has become one of the main landmarks in the city.This morning we will continue the adventure to Prague. Also known as the City of a Thousand Spires, Prague is one of the most enchanting cities in Europe. Stroll the largest castle complex in Europe, admire the gothic church of St Vitus and watch as the unique Astronomical Clock strikes on the hour.Spend the rest of your day exploring the beautiful city, not forgetting to try one of Prague's tastiest pastries known as 'Trdelnik', a sweet rolled dough in the shape of a cone that is filled with anything from ice-cream to warm chocolate sauce.Prague is a town that loves to party so you may also want to experience the nightlife as there are many great bars and restaurants, as well as plenty of night clubs to enjoy. Czechs have been brewing beer since the 9th century and invented the world's first Pilsner, so Prague offers a great opportunity to sample some of the world's finest beers.You have a full day to enjoy Prague. For something a little unique, take the train to Kutna Hora where you can experience the \"Bone Church\" otherwise known as Sedlec Ossuary. The small Roman Catholic chapel is believed to contain between 40,000 to 70,000 bones which have been arranged in various artistic ways to decorate the chapel. The centrepiece is the huge chandelier of bones that hangs in the middle.Prague is one of the most picturesque cities in Europe, and because of this you can easily pass hours just wandering the narrow streets and checking out the local establishments. The Old Town is bursting with museums, restaurants and ancient architecture.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}