{"title": "Budapest to Dubrovnik", "link": "https://www.tucantravel.com/tour/budapest-to-dubrovnik/eepd/", "dates": {"2020-04-12": "EUR 240.00", "2020-04-26": "EUR 240.00", "2020-05-10": "EUR 240.00", "2020-05-24": "EUR 240.00", "2020-06-07": "EUR 240.00", "2020-06-21": "EUR 240.00", "2020-07-05": "EUR 240.00", "2020-07-19": "EUR 240.00", "2020-08-02": "EUR 240.00", "2020-08-16": "EUR 240.00", "2020-08-30": "EUR 240.00", "2020-09-13": "EUR 240.00", "2020-09-27": "EUR 240.00", "2020-10-11": "EUR 240.00", "2021-04-11": "EUR 270.00", "2021-04-25": "EUR 270.00", "2021-05-09": "EUR 270.00", "2021-05-23": "EUR 270.00", "2021-06-06": "EUR 270.00", "2021-06-20": "EUR 270.00", "2021-07-04": "EUR 270.00", "2021-07-18": "EUR 270.00", "2021-08-01": "EUR 270.00", "2021-08-15": "EUR 270.00", "2021-08-29": "EUR 270.00", "2021-09-12": "EUR 270.00", "2021-09-26": "EUR 270.00", "2021-10-10": "EUR 270.00"}, "days": "15", "description": "I We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Budapest! Hungary's stylish capital is known as the 'City of Spas' for its abundance of natural thermal springs. With a host of historical sights, buzzing nightlife and unique attractions, Budapest is a favourite for many travellers visiting the region.Straddling the Danube River, the city is comprised of two very different historic cities, Buda on the west bank and Pest on the east bank. Highlights here include Castle Hill, Matthias Church, Fisherman's Bastion, the Liberation Monument, the fabulous St Stephen's Basilica and the much photographed Parliament Building. An evening river cruise is an excellent way to see the parliament lit up at night.You are free to arrive at your leisure and enjoy all Budapest has to offer. We highly recommend booking pre tour accommodation or arriving early in the day so that you can tick off the highlights. There will be a pre departure meeting held tonight at 6pm in your hotel. Please check reception for details.Serbia's cultural centre, Novi Sad, is overlooked by the magnificent Petrovaradin Fortress. Built during the 18th century, the fortress was repeatedly attacked but never taken by an enemy. These days Novi Sad is a quaint and welcoming city and travellers are blown away by its small world charm. Arriving early evening, you will have time tomorrow to enjoy some of the optional excursions listed.Novi Sad is also known for its international music festivals, with EXIT festival being by far the most popular which attracts thousands of music lovers from all over the world.This morning you will have a guided tour of the Petrovaradin Fortress. Explore the hidden alleys, old rooms and viewpoints, and learn all about the military history of Serbia. After lunch we will board a local bus and have a short journey to our next destination, Belgrade.Located at the crossing point of the Sava and Danube rivers, Belgrade is the capital and most populous city in Serbia, as well as one of the oldest cities in Europe. In the course of its long history, Belgrade has been captured 60 times, burned down around 40 times, and has risen like a phoenix from the ashes every time.Upon arrival we will take an orientation walk of the local area before you have free time to start exploring.Today is free to enjoy Belgrade. Explore the fortress and grounds, wander the flower filled cobbled streets of Skadarlija and check out the Church of St Sava; the largest Orthodox church in the Balkans. Don't forget to pop into a local bar for a taste of the famous Rakia, a fruit brandy popular in the region.When you're ready for a break, you can relax on the beach at 'Belgrade Hawaii', Ada Ciganlija, an island in the middle of the Sava River. During the summer the island attracts hundreds of people looking for a place to cool down.Belgrade is very well known for its nightlife and is a major draw card for Europeans looking for a party. There are countless nightclubs, bars, and cafes that stay lively into the wee hours of the night, many of which are located on river barges.Today we will move onto one of the newest countries in the world; the small yet fascinating country of Kosovo. En route, we will stop in the unique Serbian town of Djavolja Varos. More commonly known as Devil's Town, this natural phenomenon got its name from the strange formation of soil pyramids. Wonder amongst the stone-capped pillars and be sure to ask your tour leader about the folklore and tales from the town!We then continue our journey to Pristina. Europe's youngest capital, it has a buzzing energy and a small but fascinating number of attractions to see. Visit the Ethnographic Museum for exhibits on life in Kosovo between the 15th and 20th century and marvel at the iconic design of the National Library. Wander down Bill Clinton Boulevard and wave back at the 3m-tall bronze statue of the former president, before stopping for one of Pristina's famous coffees in any one of the numbers of cafes found here.With a full free day in Pristina why not head out of the city and visit the charming town of Prizren? Considered Kosovo's best kept secret, Prizren has a stunning location along the river with a mountainous backdrop. The city is easy to explore on foot and a short hike up to the castle ruins rewards you with incredible views of the area and Sharr mountain range. Don't forget to sample some of the delicious local food!Before heading to Skopje we enjoy a visit to Matka Canyon. Cruise down the river admiring the large rock walls towering beside the water. Keep an eye out for the fascinating caves that are found within the canyon.In Skopje, Macedonia's capital, you can enjoy 2,000 years of history spanning Oriental and Western cultures, neatly divided by the Vardar River through the centre of the city. Skopje has many historical monuments including the Kale Fortress dating back to the 6th century and the Daud Pasha Amam, a 15th century bathhouse now converted into the city art gallery. You can also see the Mustafa-pasha's mosque, the 16th century Clock Tower and the Kamen Most (Stone Bridge) over the Vardar River.With a full free day to enjoy Skopje your options are endless. You could wander the old bazaar, the largest outside of Turkey, picking up local souvenirs and sampling the delicious food. Or perhaps take a local walking tour to learn all about Skopje's unique history and the reason the city is home to hundreds of statues!Today we travel on to the gorgeous lake side town of Ohrid, perched on the border of Macedonia and Albania. This unassuming, picturesque settlement has been the setting of thousands of years of human history and the ancient churches, fortress walls, bazaars and old quarters are testimony to its past.Lake Ohrid itself is Europe's oldest lake having formed over three millions years ago. Wander the streets and squares of its compact centre before hiking up to the ancient walled fortress that overlooks the day to day life of the city and explore the famous old churches, monasteries and basilicas.Make the most of this escape from the cities and hop on a boat and sail 29km to the beautiful Monastery of Saint Naum, an orthodox church which dates back to the year 905. It is said that St Naum himself is buried in the church. The surrounding lakeside area is well worth a stroll, with restaurants and lush gardens it makes for a wonderfully tranquil afternoon away.Other options to fill your day including hiring a bike to cycle along the lake, visiting the Bay of Bones museum perched on the water, or simply strolling through the picturesque town and enjoying the views.Today we head to Tirana, the trendy capital and largest city of Albania, which has transformed from a grey, dismal ex-communist city, isolated by the regime until the 1990s, to a colourful capital buzzing with life.While the city has a long history, you can enjoy its modern outlook, with fashionable bars, clubs and boutiques. Wander boulevards lined with relics of the city's Ottoman, Italian and communist past.Tirana's massive main square, Skanderbeg Square, is bordered by the National History Museum, the Palace of Culture, the National Bank, the Et'hem Bey Mosque and Skanderbeg's statue. A short bus ride from the centre city, the Martyr's Cemetery offers marvellous panoramic views over the city. End your evening in the skybar, which offers excellent panoramic views over the city.On the way to Kotor we stop off at the small town of Kruja. Built on a mountainside, you can discover the old town and explore Kruja Castle where we include entry to the Skanderbeg Museum located inside. Skanderbeg was a war hero of Albania, helping defeat the Ottomans, and this museum focuses on his bravery and importance to Albania.After spending the morning exploring Kruja, our group will move onward to our next destination - the picturesque town of Kotor in Montenegro. Kotor is a walled city nestled at the bottom of Europe’s deepest fjord. Experience Stari Grad, the old town, which is a UNESCO World Heritage Site, with it’s tricky labyrinth of cobbled alleys, squares and ancient churches, including St Tryphon's Cathedral built in 1166.This morning you will have a guided tour of Kotor Old Town around mid morning. Learn about the local history and beautiful architecture that fills the town. Before the tour, we suggest you get up early and climb the fortress walls for some of the most amazing views of the bay! Getting up there nice and early means you can avoid the larger crowds that arrive in the afternoon.If you don't feel like walking up, you can admire the views from the waterfront, where the steep mountains provide a dramatic backdrop. You could also spend the day drinking espresso in the shade of the medieval walls watching people go by.If you fancy exploring another destination, take a day trip to Budva, spending the day at the beach or wandering the charming old town.We enjoy a beautiful drive through the fjords to reach our next destination of Dubrovnik, stopping on the way at a charming winery in Trebinje, Bosnia and Herzegovina. Here you will enjoy a local wine tasting and have the chance to pick up some delicious, well priced wines to take with you! The family owned establishment is in a gorgeous setting and offers a lovely wine tasting experience.With a paved town centre enclosed in fortress-like 13th century stone walls, the city is easy to explore on foot and is full of character. A highlight of Dubrovnik are the incredible city walls. Stretching almost 2 kilometres around the old town, the walls offer stunning rooftop and city views out to the turquoise blue Adriatic Sea. We recommend getting up early tomorrow and walking the city walls when they open as there are far less crowds early in the morning!Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}