{"title": "Prague to Istanbul", "link": "https://www.tucantravel.com/tour/prague-to-istanbul/eept/", "dates": {"2020-04-07": "EUR 300.00", "2020-04-21": "EUR 300.00", "2020-05-05": "EUR 300.00", "2020-05-19": "EUR 300.00", "2020-06-02": "EUR 300.00", "2020-06-16": "EUR 300.00", "2020-06-30": "EUR 300.00", "2020-07-14": "EUR 300.00", "2020-07-28": "EUR 300.00", "2020-08-11": "EUR 300.00", "2020-08-25": "EUR 300.00", "2020-09-08": "EUR 300.00", "2020-09-22": "EUR 300.00", "2020-10-06": "EUR 300.00", "2020-10-20": "EUR 300.00", "2021-04-06": "EUR 320.00", "2021-04-20": "EUR 320.00", "2021-05-04": "EUR 320.00", "2021-05-18": "EUR 320.00", "2021-06-01": "EUR 320.00", "2021-06-15": "EUR 320.00", "2021-06-29": "EUR 320.00", "2021-07-13": "EUR 320.00", "2021-07-27": "EUR 320.00", "2021-08-10": "EUR 320.00", "2021-08-24": "EUR 320.00", "2021-09-07": "EUR 320.00", "2021-09-21": "EUR 320.00", "2021-10-05": "EUR 320.00", "2021-10-19": "EUR 320.00"}, "days": "20", "description": "T We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Prague! Also known as the City of a Thousand Spires, Prague is one of the most enchanting cities in Europe. Stroll the largest castle complex in Europe, admire the gothic church of St Vitus and watch as the unique Astronomical Clock strikes on the hour.Prague is the capital of the Czech Republic and popular for its unique old town charm, as wellWe recommend booking pre tour accommodation or arriving on an early flight so that you can fully enjoy all that Prague has to offer.Welcome to Austria!Arriving early afternoon, you will have the rest of the day to start appreciating the city. Vienna is a city worlds away from any other found in Europe. The city's grandeur can be instantly felt as you wander through the centre, admiring the mixture of architecture from Baroque to Roman and Gothic to Art Nouveau.Birthplace of some of the greatest classical musical compositions, Vienna charms with its cultural history and opulent beauty. Known as the city of music, many composers such as Mozart, Beethoven and Strauss were born or worked here and you can learn all about their works in places such as Haus der Musik and Mozarthaus, Mozart's main apartment in Vienna which holds an insight into his celebrated life.Highlights include the Museum quarter, where you can find the Museum of Contemporary Art as well as the renowned Leopold Museum. The complex of the Hofburg Palace is a must see and an experience in itself! This grand building is the former palace of the Habsburg dynasty and today serves as the workplace of the President of Austria. This is where you will also find the world famous Spanish Riding School, where you can opt to book a ticket for tomorrow mornings training session.Today you have the full day to soak up the sights of Vienna. Perhaps you would like to catch a jaw-dropping orchestra performance at the Vienna Philharmonic, or watch a ballet or opera performance at the Wiener Staatsoper? You may also choose to visit the Schloss Schonbrunn, the palace of the Habsburg family, and discover the Baroque grandeur of the Austrian dynasty.Once you have delighted in the culture and beauty of Vienna, there are a host of lively restaurants, cafes and bars to soak up as you watch the world go by in this vibrant city.Leaving Austria, we have a short train journey to Slovakia, heading for its capital Bratislava. We will arrive early, giving you most of the day to enjoy the city's sights. Wander along the Danube River and explore the Old Town, which is free from cars, giving you ample room to explore its lively streets. From the Old Town you will be able to see the restored Bratislava Castle which stands on a hill overlooking the city.This morning we depart Bratislava for one of the most popular destinations in Central Europe! Budapest, Hungary's stylish capital is known as the 'City of Spas' for its abundance of natural thermal springs. With a host of historical sights, buzzing nightlife and unique attractions, Budapest is a favourite for many travellers visiting the region.Straddling the Danube River, the city is comprised of two very different historic cities, Buda on the west bank and Pest on the east bank. Highlights here include Castle Hill, Matthias Church, Fisherman's Bastion, the Liberation Monument, the fabulous St Stephen's Basilica and the much photographed Parliament Building. An evening river cruise is an excellent way to see the parliament lit up at night.The perfect place to relax after a day of sightseeing is in a traditional bath. The Szechenyi Medicinal Baths are one of the city's more famous Neo Baroque-style baths with indoor and outdoor pools, thermal pools, saunas and massages in a beautiful setting.Don't leave Budapest without sampling the famous goulash, a stew made from meat and vegetables and one of the most known Hungarian dishes. After dinner a great way to spend the evening is in one of the famous ruin bars, once abandoned buildings and now a symbol of Budapest, these bars are unique and full of life and perfect for experiencing life as the locals do.The Terror House, Heroes Square, The Opera House, The Chain Bridge, Central Market Hall, The Great Synagogue. Budapest is home to an abundance of sites and attractions for every taste! Today is free to tick off as many as you wish. A hop on hop off bus tour is the perfect way to see as much as possible, allowing you to spend as little or as much time at each landmark.Or if you need a day to relax and recharge then spend the entire day in one of the aforementioned thermal baths!This morning we take a short train ride to Eger, located on the hills of the Bukk Mountains, and a real gem within Hungary. With a number of historic sights such as the castle, cathedral, and the northernmost minaret in Europe, Eger is a wonderfully quaint town and the perfect contrast from the bustling capital of Budapest. Best known for its production of the famous \"Bulls Blood\" red wine, Eger is a large producer of Hungarian wine and you will have ample opportunity to sample some of Hungary's finest. Spend an afternoon exploring the \"Valley of the Beautiful Women\", a collection of wine cellars where you can sample the unique blends of local wines and speak with the producers.After a 91 year long Turkish rule in the 15th century, Eger has an abundance of Ottoman influence and beautiful architecture that can be seen as you explore on foot.The day is spent exploring the fascinating Maramures region in North-western Romania, home to many villages where century-old traditions are still part of daily life. We will observe a pottery demonstration, visit a traditional watermill and make a stop at the very peculiar 'Merry Cemetery' of Sapânta, so called because the gravestones are painted in bright colours, hand-carved out of oak and adorned with an image of the deceased and a humorous epitaph in the local vernacular.This is a full day of exploring the Maramures and we will arrive to the guesthouse around 7pm to enjoy a traditional dinner.This morning we will visit the village of Barsana, where there is a thriving local tradition of woodcarving, with picturesque wooden houses fronted by giant, ornately-carved gates. There is also a monastery that offers great views over the Izei valley, where people still farm using traditional techniques. We also tour some of the beautiful UNESCO listed wooden churches of the region that are well-known for their characteristic high roofs and tall, pointed steeples.In the afternoon we head to Sighisoara. Located in the historic region of Transylvania, it was once a Saxon settlement established in the 12th century. Recognised by UNESCO as a World Heritage Site, the citadel has a very well preserved old town with a clock tower rising 64 meters above the city. Also worth visiting is the Orthodox Cathedral and Cornesti Church.Today you are free to explore and enjoy Sighisoara! You could take a guided tour of the Old Town, check out the unique Torture Museum or visit Dracula's House.Surrounded on three sides by the Carpathian Mountains, Bra&#x219;ov was a perfect place for a medieval settlement and much of the Old City, founded by the Teutonic Knights in 1211, has been restored.You can visit R&#xe2;&#x219;nov Castle,  the Bra&#x219;ov Citadel or wander up Rope Street, the narrowest street in Europe. Bra&#x219;ov also provides a great base for exploring the surrounding countryside of the Transylvania region, where the air is fresh and the people friendly.On our way to Bra&#x219;ov we make stops at two historic and important churches, Viscri and Prejmer fortified churches.Today we visit the nearby Bran Castle which is known as 'Dracula's Castle' and is (supposedly) said to have been the home of Vlad the Impaler.The rest of the afternoon is free for you to enjoy Bra&#x219;ov.This morning we explore the beautiful Pele's Castle, an impressive structure which is sure to take your breath away!We then head to Bucharest where you will have free time to explore the area and discover the contrasts of Romania's cultural capital. The architecture here is an eclectic mix of historical, communist period and modern styles and it even has its own Arc de Triomphe. Bucharest also boasts the world's second largest building, the Palace of Parliament, built under the communist regime.If you'd like to learn more about the traditional way of life of Romanian peasant farmers you can visit the Village Museum, an open air museum with around 300 traditional buildings filled with furniture, pottery and clothing collected from different regions of the country.We head across the border into the Bulgarian city of Veliko Tarnovo, famous as the historical capital of the Second Bulgarian Empire. Built on three hills, the city offers some great views of the surrounding churches and old imperial residences rising amidst the meanders of the Yantra River. On Tsarevets Hill are the palaces of the Bulgarian emperors and the Patriarchate, the Patriarchal Cathedral, and also a number of interesting cultural institutions such as the Archaeological Museum and the Museum of the Bulgarian Revival and the Constituent Assembly.This morning we will depart for our next destination, Sofia! Bulgaria's capital Sofia offers a wealth of cultural entertainment, including Byzantine churches, museums full of ancient archaeological treasures, towering monuments and numerous mineral baths adjacent to the magnificent Mount Vitosha. Laid back and cosmopolitan, Sofia offers a thriving and diverse street life, including open-air cafes, busy markets such as the famous Ladies' Market, rattling trams and buskers all adding to the ambience.Today you are free to explore Sofia. At the foothills of Mount Vitosha about 8 kilometres from the city centre you can visit the 900 year-old Boyana Church, considered among the masterpieces of medieval European painting, which features murals and frescoes dating back to 1259 AD, medieval architecture and monumental art. Also at the base of Mt. Vitosha is the splendid National History Museum, with antiques dating back to the Thracian period.Sofia also offers many beautiful gardens to relax in, such as Boris Gardens and the South Park, which starts just behind the Palace of Culture.Enjoy breakfast in Sofia before taking a public bus to Plovdiv. Plovdiv is one of the oldest cities in Europe. It is the oldest continually inhabited city in Europe going back 8000 years.The town is small and easy to walk around. Places to see include the Roman Amphitheatre, St Marina church and a mosque leftover from the Ottoman Empire. Each step you take in this town opens up another piece of history. While the seven tall hill that used to overlook the town have been reduced to just three, it is possible to walk the hills and the best time to do this is at sunset.Please note: Breakfast tomorrow morning is not included in the hotel at Plovdiv. Your Tour Leader will point out local cafes or restaurants where you can have breakfast.Today you are free to enjoy Plovdiv. The city was awarded the title of 2019 European Capital of Culture and is the first in Bulgaria to have the honour!While strolling the charming streets is a lovely way to pass the time, you could also opt for a day trip to indulge in some local wine tastings and to see the local countryside.Please note: Breakfast tomorrow morning is not included in the hotel at Plovdiv. Your Tour Leader will point out local cafes or restaurants where you can have breakfast.Late morning we leave for Turkey, arriving into Istanbul in the early evening. Istanbul is an enchanting fusion of East and West. Narrow alleys are flanked by wooden Ottoman houses while a nearby funky restaurant and bar strip in the down-town area pumps out Turkish pop. There are many great places to explore including, but not limited to, the Blue Mosque, St Sophia and the Grand Bazaar. The Blue Mosque, also known as the Mosque of Sultan Ahmet, is nearly 400 years old and still an active mosque that non-Muslims can visit for free outside of the five daily prayers. St Sophia (Hagia Sophia) was built 1,500 years ago and was the largest enclosed space in the world. The Grand Bazaar (Kapali Carsi) is the oldest and largest closed bazaar in the world, housing around 3000 shops within 61 alleyways. It used to be the city's main trading centre of ceramics, jewellery and leather goods.We will arrive in the evening to sample some of Turkey's most delicious cuisine. As we arrive late we recommend you book additional nights accommodation in order to fully explore the city and any of the optional excursions listed below.Please note: For those who do not wish to travel into Turkey, there is the option to end in Sofia, Bulgaria instead. From Plovdiv you will return to Sofia by bus where there will be one night's accommodation instead. This option must be pre-booked with your Adventure Specialist in advance. This makes no difference to the cost of your tour.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.The Grand Bazaar is shut by the time we arrive on Saturday and is also closed on Sundays. If this is a personal must see please consider booking an extra night.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}