{"title": "Best of the Balkans", "link": "https://www.tucantravel.com/tour/best-of-the-balkans/eetws/", "dates": {"2020-04-25": "EUR 250.00", "2020-05-09": "EUR 250.00", "2020-05-23": "EUR 250.00", "2020-06-06": "EUR 250.00", "2020-06-20": "EUR 250.00", "2020-07-04": "EUR 250.00", "2020-07-18": "EUR 250.00", "2020-08-01": "EUR 250.00", "2020-08-15": "EUR 250.00", "2020-08-29": "EUR 250.00", "2020-09-12": "EUR 250.00", "2020-09-26": "EUR 250.00", "2021-04-24": "EUR 270.00", "2021-05-08": "EUR 270.00", "2021-05-22": "EUR 270.00", "2021-06-05": "EUR 270.00", "2021-06-19": "EUR 270.00", "2021-07-03": "EUR 270.00", "2021-07-17": "EUR 270.00", "2021-07-31": "EUR 270.00", "2021-08-14": "EUR 270.00", "2021-08-28": "EUR 270.00", "2021-09-11": "EUR 270.00", "2021-09-25": "EUR 270.00"}, "days": "15", "description": "D We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Sofia. The city offers a wealth of cultural entertainment, including Byzantine churches, museums full of ancient archaeological treasures, towering monuments and numerous mineral baths adjacent to the magnificent Mount Vitosha. Laid back and cosmopolitan, Sofia offers a thriving and diverse street life, including open-air cafés, busy markets such as the famous Ladies’ Market, rattling trams and buskers all adding to the ambience. At the foothills of Mount Vitosha about 8 kilometres from the city centre you can visit the 900 year-old Boyana Church, considered among the masterpieces of medieval European painting, which features murals and frescoes dating back to 1259 AD, medieval architecture and monumental art. Also at the base of Mt. Vitosha is the splendid National History Museum, with antiques dating back to the Thracian period.Sofia also offers many beautiful gardens to relax in, such as Boris Gardens and the South Park, which starts just behind the Palace of Culture.Leaving Bulgaria behind we then head to Macedonia, a country of lush scenery and fascinating towns and cities.In Skopje, Macedonia’s capital, you can enjoy 2,000 years of history spanning Oriental and Western cultures, neatly divided by the Vardar River through the centre of the city. Skopje has many historical monuments including the Kale Fortress dating back to the 6th century and the Daud Paša Amam, a 15th century bathhouse now converted into the city art gallery. You can also see the Mustafa-pasha's mosque, the 16th century Clock Tower and the Kamen Most (Stone Bridge) over the Vardar River.Before heading to Lake Ohrid we can enjoy a visit to the Matka Canyon, a highlight of Macedonia. Cruise down Matka lake admiring the large rock walls towering beside the water. Keep an eye out for the fascinating caves that are found within the canyon. We then travel on to the gorgeous lakeside town of Ohrid, perched on the border of Macedonia and Albania. This unassuming, picturesque settlement has been the setting of thousands of years of human history and the ancient churches, fortress walls, bazaars and old quarters are testimony to its past.We stay close to the lake where you can enjoy a host of lakeside restaurants and bars to watch the sunset.Today you are free to soak up the beautiful atmosphere of Ohrid. Lake Ohrid itself is Europe's oldest lake having formed over three million years ago. Wander the streets and squares of its compact centre before hiking up to the ancient walled fortress that overlooks the day to day life of the city and explore the famous old churches, monasteries and basilicas.Other highlights include boat trips across the lake and the Bay of Bones, a unique museum on water and pre-historic site located a short bus journey from the town.On the way to Tirana we stop off at the small town of Berat. Straddling the mountainside this charming ottoman town was listed as a UNESCO Heritage site in 2008 and it is not hard to see why. Its hillside is blanketed with picturesque white house’s giving it the nickname “the town of a thousand windows”. Hike up to the Fortress or spend your time wandering its narrow cobbled streets.Continuing onwards we arrive into Tirana in the evening, the trendy capital and largest city of Albania, which has transformed from a grey, dismal ex-communist city, isolated by the regime until the 1990s, to a colourful capital buzzing with life. While the city has a long history, you can enjoy its modern outlook, with fashionable bars, and wander boulevards lined with relics of the city’s Ottoman, clubs and boutiques, Italian and communist past. Tirana’s massive main square, Sheshi Skënderbej, is bordered by the National History Museum, the Palace of Culture, the National Bank, the Et'hem Bey Mosque and Skanderbeg's statue. A short bus ride from the city centre, the Martyr’s Cemetery offers marvellous panoramic views over the city.After spending the morning exploring Tirana, our group will move onward to our next destination - the picturesque town of Kotor in Montenegro. It is a walled city nestled at the bottom of Europe’s deepest fjord. Experience Stari Grad, the old town, which is a UNESCO World Heritage Site, with it’s tricky labyrinth of cobbled alleys, squares and ancient churches, including St Tryphon's Cathedral built in 1166.The steep mountains provide a dramatic backdrop to this beautiful town and you can admire them from the waterfront. You could spend the day drinking espresso in the shade of the medieval walls watching people go by, or if you are feeling more adventurous try climbing the walls of the ancient fort of Sveti Ivan which spans some 4.5 kilometres above the city on almost vertical cliffs. Your efforts will be rewarded by an excellent view of Kotor and the bay.Today you are free to explore Kotor and admire the stunning views. We suggest you get up early and climb the fortress walls for some of the most amazing viewpoints of the bay! Getting up there nice and early means you can avoid the larger crowds that arrive in the afternoon.If you don't feel like walking up, you can admire the views from the waterfront, where the steep mountains provide a dramatic backdrop. You could also spend the day drinking espresso in the shade of the medieval walls watching people go by.If you fancy exploring another destination, take a day trip to Budva, spending the day at the beach or wandering the charming old town.We now continue to the ‘Pearl of the Adriatic’, the UNESCO World Heritage listed walled city of Dubrovnik.With a paved town centre enclosed in fortress-like 13th century stone walls, the city is easy to explore on foot and is full of character. Founded in the 7th century, for a time in its glorious past the city was a serious rival for Venice in terms of maritime trade. It is hard to believe now but in 1991, two out of every three buildings were damaged during the bombardment of the Yugoslav War. Since then the buildings and walls have been painstakingly restored to pristine condition and represents one of the most beautiful and solid fortress systems on the Mediterranean. There are several other historic attractions worth a visit near the main street (Stradun), such as the 14th century Franciscan monastery which houses a treasury full of sacred art and artefacts, as well as one of the oldest continually working pharmacies in the world, dating back to 1317.Today is free to enjoy Dubrovnik. With a wealth of cultural and water based activities, Dubrovnik will not fail in keeping you entertained. Try out sea kayaking in the crystal waters, or browse the markets in the Old Town for some Mediterranean delicacies. For some of the most incredible city views, head up the cable car to Mount Srd where you can view the city walls from a different perspective.You will get a 24 hour city card for your stay in Dubrovnik. This allows access to multiple museums as well as the famous City Walls. We recommend getting up early today and entering the walls when they open to try and avoid the crowds!This morning we are collected by our private minivan and leave Croatia behind for the ‘heart-shaped land’ of Bosnia and Herzegovina, heading towards the capital Sarajevo, a fascinating mixture of western and eastern cultures.Known as the Jerusalem of Europe, the city was once famous for its religious diversity, with people of Islamic, Orthodox Christian, Catholic and Jewish faiths coexisting relatively peacefully for centuries. The atmosphere of calm and tolerance changed dramatically when violence erupted in the mid-1990s and the city underwent the longest siege in modern military history during the Yugoslav War.En route to Sarajevo we will make a short visit to one of Bosnia and Herzegovina's most popular sites, Blagaj Tekke (Dervish Monastery). It was built around 1520 with the influence of Ottoman design and perches on the side of river spring providing a mystical setting. It was built as a monastery for the Dervish cults.Onward from Blagaj Tekke we make a stop in Mostar, widely felt to be the prettiest city in Bosnia and Herzegovina, it is situated on the Neretva River and is the fifth-largest city in the country. It is particularly famous for this beautiful single span bridge, Stari Most, which collapsed into the Neretva River during the Yugoslav War in 1993. Built in 1556 by the Ottoman ruler Suleiman the Great, Stari Most had been a globally recognised landmark and a national symbol for Bosnia-Herzegovina. It had survived centuries of conflict including both world wars and proved that, whatever happened, the mainly Christian west bank and mainly Muslim east remained united. The destruction of the bridge was a huge blow to the local people, but in 2004 the bridge was rebuilt as a replica of the original using pieces of masonry salvaged from the riverbed. Its reopening represented the hope that Muslims, Croats and Serbs could once again live side by side and that Mostar would be healed after a decade of ethnic division.We end our day arriving into Sarajevo. After check in and a short orientation you are free to start enjoying all the city has to offer.Today you are free to enjoy Sarajevo and all it has to offer. The city is largely recovered from the war and is packed with fascinating museums, bazaars, markets and bridges.During your time here you could explore the cobbled streets, mosques and Oriental style shops of the Old Town, visit the Bosnian Historical Museum to learn about the siege of Sarajevo and discover the Sarajevo Tunnel Museum, the tunnel which was used to ferry supplies into the besieged city during the conflict, next to the airport. For history buffs a must see is the Latin Bridge, spanning the river in the down-town area. The bridge bears a plaque commemorating the assassination of Archduke of the Austro-Hungarian Empire, Franz Ferdinand, the event that sparked the beginning of World War I.Today we drive across the border into Serbia to explore its dynamic capital city, Belgrade. It is located at the crossing point of the Sava and Danube rivers and during the course of its long history, Belgrade has been captured 60 times, burned down around 40 times, and has risen like a phoenix from the ashes every time.Looming over the old city is the ancient Kalemegdan Citadel, which was built in stages from the 1st century BC and was finally finished in the 18th century. You can visit the well-preserved ruins and may even see graffiti made by bored medieval guardsmen. The city itself offers excellent shopping opportunities, from luxurious upscale boutiques through to unique places such as Titos Flowers, a memorial centre for the former Yugoslav leader.Come evening check out the area of Skadarlija, a wonderfully quaint canvas of cobbled streets, vibrant restaurants and hanging flowers. This bohemian haunt was popular during the 90's when singers, musicians, writers and poets lived and performed here, and to this day has managed to keep its charming and artistic appearance, with local musicians still performing at restaurants.Today you are free to check out more of Belgrade's sights and attractions. Walking tours are a great way to get a feel for the city while learning about the fascinating history of Serbia, ask your tour leader where these depart from and at what time.When you're ready for a break, you can relax on the beach at Belgrade Hawaii, Ada Ciganlija, an island in the middle of the Sava River. During the summer the island attracts hundreds of thousands of people looking for a place to cool down, so it can be crowded on hot days. Belgrade is very well known for its nightlife and is a major draw card for Europeans looking for a party. There are countless nightclubs, bars, and cafes that stay lively into the wee hours of the night, many of which are located on river barges.We return to Sofia for one last night. Pick up last minute souvenirs and head to the outdoor restaurants for one final meal with your group.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}