{"title": "Buenos Aires to Rio Express", "link": "https://www.tucantravel.com/tour/buenos-aires-to-rio-express/hbr/", "dates": {"2020-04-02": "USD 180.00", "2020-04-16": "USD 180.00", "2020-04-30": "USD 180.00", "2020-05-14": "USD 180.00", "2020-05-28": "USD 180.00", "2020-06-11": "USD 180.00", "2020-06-25": "USD 180.00", "2020-07-09": "USD 180.00", "2020-07-23": "USD 180.00", "2020-08-06": "USD 180.00", "2020-08-20": "USD 180.00", "2020-09-03": "USD 180.00", "2020-09-17": "USD 180.00", "2020-10-01": "USD 180.00", "2020-10-15": "USD 180.00", "2020-10-29": "USD 180.00", "2020-11-12": "USD 180.00", "2020-11-26": "USD 180.00", "2020-12-10": "USD 180.00", "2020-12-24": "USD 180.00", "2021-01-07": "USD 190.00", "2021-01-21": "USD 190.00", "2021-02-18": "USD 190.00", "2021-03-04": "USD 190.00", "2021-03-18": "USD 190.00", "2021-04-01": "USD 190.00", "2021-04-15": "USD 190.00", "2021-04-29": "USD 190.00", "2021-05-13": "USD 190.00", "2021-05-27": "USD 190.00", "2021-06-10": "USD 190.00"}, "days": "6", "description": "I We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Buenos Aires and the start of your adventure!Buenos Aires is known as the \"Paris of South America\" due to its lovely green parks, plazas and wide boulevards. Argentina’s capital city is a great destination for culture lovers, with the Museo Nacional de Bellas Artes boasting an impressive collection including original works by Monet, Renoir and Cézanne. You can also learn about the national heroine ‘Evita’ at the Museo Eva Perón.You are free to arrive at your leisure and start enjoying all the city has to offer. There will be a pre departure meeting tonight to meet your tour leader and group. Please check reception for details and timings.We fly into Puerto Iguazu on the Argentinian side, visiting the famous Iguazú Falls - the most magnificent waterfalls in the world. Unlike most other waterfalls that have just one or two cataracts, at Iguazú Falls there are 275 cataracts in a magnificent 3 kilometre long U shape that we will visit from both sides.Visiting the Argentine side of the falls you can board a speed boat which will take you under the falls soaking you from head to toe, an (optional) adventure you'll never forget! On the Argentine side you'll also find the famous \"Devil's Throat\" where fourteen falls drop with such force that there is always a massive cloud of spray overhead. Following this we transfer to Brazil.Visiting the Brazilian side of the falls will give you a completely different perspective from the Argentine side. On the Brazilian side you can see the falls by walking through the rainforest and along catwalks above and below the rushing water. You can also visit the world's largest hydroelectric dam at Itaipu (optional) where you can learn more about the ecological issues faced during the dam's construction. There is also a very interesting bird park nearby, perfect for that must-have photo with a toucan!Today we fly to Rio de Janeiro.This huge seaside city is famed for its nightlife and golden beaches, with plenty to see and do for travellers. A highlight for many would be to experience the majestic gaze of Christ the Redeemer at the top of Corcovado, the breath-taking panoramic views from the top of Sugarloaf Mountain, and the vibrant coloured tiles of the Selarón staircase. You can walk from the top of the staircase up to the quiet hill-top neighbourhood of Santa Teresa, with many quaint cafés and shops lining the cobblestone streets. In the city centre, you can stroll around Rio's old colonial buildings and wander around the skyscrapers of the financial district.Today is free for you to get under the skin of Rio. You may like to visit the Botanical Gardens, sip cocktails on one of the world-famous beaches of Copacabana or Ipanema, or head to the beautiful Rodrigues de Freitas Lagoon. In the evening, why not enjoy a samba show and get a true insight into what makes Carnival so special.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}