{"title": "South America in 3 Weeks", "link": "https://www.tucantravel.com/tour/south-america-in-3-weeks/hcs/", "dates": {"2020-04-23": "USD 640.00", "2020-05-07": "USD 640.00", "2020-05-21": "USD 640.00", "2020-06-04": "USD 640.00", "2020-06-18": "USD 640.00", "2020-07-02": "USD 640.00", "2020-07-16": "USD 640.00", "2020-07-30": "USD 640.00", "2020-08-13": "USD 640.00", "2020-08-27": "USD 640.00", "2020-09-10": "USD 640.00", "2020-09-24": "USD 640.00", "2020-10-08": "USD 640.00", "2020-10-22": "USD 640.00", "2020-11-05": "USD 640.00", "2020-11-19": "USD 640.00", "2020-12-03": "USD 640.00", "2020-12-17": "USD 640.00", "2020-12-31": "USD 640.00", "2021-01-14": "USD 680.00", "2021-01-28": "USD 680.00", "2021-02-11": "USD 680.00", "2021-02-25": "USD 680.00"}, "days": "23", "description": "E We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Drenched in old town charm, Cartagena de Indias lies on the northern coast of Colombia and is one of the most picturesque colonial towns on the continent. Founded in 1533, the town was named after Cartagena, Spain, and subsequently became a key factor in the expansion of the Spanish Empire, playing a political, economic and administrative role during the colonial period. Relics of the Spanish Empire can be seen far and wide in the beautifully preserved churches, monasteries, plazas and palaces.The old city is considered the heart of Cartagena, echoing the city's long history while incorporating true Colombian culture. Vibrant narrow streets are adorned with wooden balconies and hanging plants, while brightly coloured houses can be seen in every turn. Keep an eye out for the elaborate door knockers, which are designed in the shapes of seahorses, lizards, turtles and more. In Cartagena society, doors were considered a status symbol.While simply getting lost in the charming streets is the best way to discover the allure of Cartagena, important sites include Castillo San Felipe and the fortress on San Lazaro hill. Beneath the fortress you can find a maze of tunnels where cannons still stand along the battlements. For some of the best views of the city, head up La Popa hill and visit the vibrant convent. For a unique trip out of the city, head to the mud volcano.With a Caribbean climate and some of the most stunning beaches in the Americas, Cartagena is also the perfect place to dip your toes in the ocean and admire this fascinating corner of the globe. End your evening sampling true Colombian delicacies at a local market stall or high end eatery. Whatever your taste; Cartagena won’t disappoint.This morning we say goodbye to the sounds of the Caribbean and head to Colombia's second largest city, Medellin. Also known as “The City of Eternal Spring” due to its year round pleasant weather, Medellin has flourished in recent years and now has one of the fastest growing economies on the continent. Once known as the playground for infamous drug lords, the city has since shed its reputation and welcomes travellers from far and wide who are eager to experience what this progressive and exciting city has to offer.There are numerous parks and plazas in Medell&#237;n waiting to be explored, such as Parque Berrio, Jardin Botanico or Parque Explora, which features Latin America's largest freshwater aquarium.Spend your evening in Parque Lleras, the best place in the city for restaurants, bars or nightclubs. Try Medell&#237;n’s most traditional dish, the bandeja paisa. A hearty plate of rice, eggs, meat, beans and avocado, the servings are usually huge and can be shared between two, but are one of the most important dishes in the region and should not be missed!Today is free to further explore Medell&#237;n! Why not try using the world renowned public transportation system? The cable car connects the city centre to the outskirts and results in some of the best views of the city once you reach the end of the line, Parque Arv&#237;.You could visit the Metropolitan Cathedral in Bolivar park which holds the record for the most clay bricks on any building in the world, with an impressive 1.1 million bricks being used in the building process! Also worth exploring is the Plaza Botero, where you can see many of the figures by the sculptor Fernando Botero. Botero is one of the most famous artists to come out of Colombia, known for his still life images of plump figures.Another option is to take a day trip to the colourful village of Guatap&#233;. Here you will find the famous Pe&#241;ol Boulder, a 200 metre high rock which you can climb for some incredible views of the surrounding area! Or if art is more your thing, book onto the Comuna 13 graffiti tour! Comuna 13 was once known as the most dangerous neighbourhood in Colombia, but has been transformed with unique street art around every corner.No trip to Colombia would be complete without an immersive coffee experience. Today we head to a local coffee plantation where we will stay the evening on the grounds to learn everything there is to know about this well loved beverage. Your time will be spent learning about the culture, history and variety of coffee, as well as the coffee making process. Witness the roasting process, experiment with the flavours and walk through the plantation where you can see the packaging take place. Arriving late in the day, your coffee experience will normally take place tomorrow morning.Tonight we stay in a Hacienda, the main house on the plantation. With over 100 years of tradition the coffee farm is the perfect place to relax and take in the lush scenery. Enjoy a local dinner prepared by your hosts and spend the evening relaxing by the pool.After our coffee tour we head for Salento, nestled in the Zona Cafetera region of Colombia. Salento is a beautiful and colourful town, having managed to keep it’s slow and relaxing pace due to the main route between Cali and Bogota being diverted which meant the town did not develop as fast as others in the region.Hike to the viewpoint at the end of Calle Real for some of the best views over the valley, and don’t forget to walk around the charming and humble town square.We take a jeep from town to the Cocora Valley and spend a whole day hiking through the lush green hills. Our jeeps are true classic cars with bright colours and can date as far back as the 60’s; riding in them in a truly unique experience. The hike provides sweeping views of the valley and the iconic wax palms, Colombia's national symbol. In the evenings, make sure you try the region´s speciality, trucha, a fish normally served with rice but cooked many different ways.Head back to Salento for the evening and perhaps enjoy a game of Tejo, a traditional Colombian throwing sport.Our final Colombian stop is of course the bustling capital city, Bogota. With a population of 7 million, it is also the largest city in the country and the centre of everything from politics to sport. With the dramatic Andean peaks looming in the background, Bogota radiates classic colonial charm while modern and sophisticated businesses are popping up by the second.We will be staying in the Candelaria district which is an excellent location within walking distance of many of the main sights including the main square - Plaza Bolívar, the Cathedral and Simón Bolívar's house. You may like to take the funicular to Monserrate for the incredible city views, or visit the world famous gold museum.Spend today getting further acquainted with the city. Take a walking graffiti tour and get up close and personal with some of the most impressive street art in the city. Political and social turbulence has often been the inspiration behind the unique art found round every corner which was made legal in certain areas in 2011. The art is now seen as part of the cultural identity of Bogota with artists travelling from all over for inspiration.Check out the gold museum, which houses the largest collection of Pre-Hispanic gold with a collection that exceeds 50,000 pieces. The artefacts which consist of gold, pottery, rock and textiles have allowed archaeologists a better understanding of ancient South American civilizations. Another brilliant museum to explore is the Botero museum, home to Botero’s private collection of works by international artists such as Monet and Dali. The entire collection was donated to the museum on the condition that entry would always be free for customers. There is also the opportunity here to try Ajiaco, the cities most traditional dish.Come evening, search beyond the rice and beans and sample some of the best Colombian foods. From grilled meats, fresh fish, ceviche and an array of local fruits and vegetables, it’s not hard to find something that suits your tastes.This morning you will be transferred to the airport for your onward flight to Lima. Please note that this flight will be unaccompanied by a tour leader. A representative will meet you at the airport and transfer you to your hotel, and you will meet your tour leader the following day in Cusco.Home to beautiful colonial buildings and some of the best museums in South America including the Gold Museum, Museum of the Inquisition and the Catacombs below the San Francisco Church. Peru's capital has much to offer and many of the sights, including the city's two main squares Plaza de Armas and Plaza San Martin, boast some fantastic sightseeing opportunities. The Plaza de Armas houses the Cathedral, Municipal Palace and Presidential Palace where the changing of the guard can be seen every day at 12 noon. There are also many markets in Lima, possibly the best being in the central district.Of course you should also spend time sampling some delicious local Peruvian food. For a breakdown of the best food in Peru and where to eat in Lima, click hereYou will wake early today and head to the airport where you will catch a short flight to Cusco. This afternoon we will take a tour of the Sacred Valley of the Incas. You will visit the Pisac ruins, perched on a hilltop with incredible views of the surrounding mountains. You will also visit the temple/fortress of Ollantaytambo with its enormous Inca terracing constructed on the side of a steep mountain. Tonight you will stay in Ollantaytambo in preparation for your journey to Machu Picchu tomorrow.Entry to Machu Picchu is split into a morning and afternoon shift in order to ease the flow of tourists to the site and aid conservation and preservation of the citadel. As a result, if you are scheduled to take the train to Machu Picchu, your guided tour will take place in the afternoon shift.Alternate options for getting to Machu Picchu:Taking the train: Waking early in Ollantaytambo you will take the train to Aguas Calientes, arriving at 10am. You will have time to get some food before entering Machu Picchu at approximately midday. Enjoy a guided tour around the site before getting the train back to Ollantaytambo and arriving back in Cusco at approximately 10pm.One day hike:Waking early in Ollantaytambo you will take the train to to Km104 (2100m) where you will start the trek heading towards the ruins of Chachabamba. From here you will follow the Inca Trail to the foot of the Wiñay-Wayna ruins (2700m), hiking until you reach Sun Gate and Machu Picchu in the late afternoon.  Enjoy a guided tour around the site before getting the train back to Ollantaytambo and arriving back in Cusco at approximately 10pm.The lost city of Machu Picchu (Old Mountain) was originally completely self -contained, surrounded by agricultural terraces sufficient to feed the population, and watered by natural springs. Located high above the fast flowing Urubamba River, the cloud shrouded ruins have palaces, baths, temples, storage rooms and some 150 houses, all in a remarkable state of preservation that will simply take your breath away. The ruins were only discovered by the outside world in 1911, when American explorer Hiram Bingham found them while looking for another “lost city” called Vilcabamba. Due to their isolation many of the buildings are still quite intact and you can't help but admire Huayna Picchu (Young Mountain), which towers above the ruins.Please note:  The one day hike generally can be booked more closer to departure unlike the Inca Trail however as it is still permit-regulated this is no guarantee. Please enquire with your Adventure Specialist for availability. It is a long day and can be quite challenging. Read more about it hereToday you have a full free day to enjoy the city of Cusco.This morning we start early to visit the Cruz del Condor (Condor's Cross) lookout point in search of the giant condors soaring out of the canyon on thermal currents while taking a walk along the canyon's edge and admiring the spectacular views. The beautiful scenery continues as you take a combination of buses all the way to Puno on the shores of Lake Titicaca, which at 3,855 metres above sea level, is the highest navigable lake in the world.Today we take a day trip to the traditional and enthralling Lake Titicaca. Not only is it the largest lake in South America, it sits at 3,800 meters above sea level making it the highest navigable body of water on earth. Crystal blue waters compliment the bright yellow grass reeds used to construct the homes and boats floating upon it, while the traditional clothing simply adds to the beauty and colour of the place. While the lake tends to be overshadowed by its biodiverse and world famous neighbour the Amazon jungle, there exists over 500 aquatic species here and many various birds.First we visit the floating reed islands in the Bay of Puno to see the Uros islanders way of life and we will have the option to ride in a traditional reed boat.Next stop is Taquile Island, an island on Lake Titicaca still holding up many of the traditions values and customs it was built on. Learn about the way of life, from the reasons for why they do their hair the way they do and how they dress. Famous for their textiles and clothing, you will be able to pick up a homemade gift or two from the main square.We will return to Puno for the evening.We journey by public bus into La Paz which is built in a steep valley that protects the city from the harsh elements of the Altiplano. Just about every building in La Paz is built on some sort of hill, so sightseeing will literally take your breath away! You will have time to explore La Paz and it's bustling atmosphere. Our hotel is very centrally located and is just around the corner from the city's colourful indigenous street markets including the fascinating and suitably named ?Witches Market'? where local women in traditional 'Cholita' dress sell such items as dead cats and llamas foetuses said to ward off evil spirits. The main square, Plaza Murillo, is also within walking distance. The square still retains its colonial buildings including the Presidential Palace.Today is a free day to enjoy the sights and sounds of La Paz. For a cheap thrill and a birds eye view of the expansive city why not hop on the Telef&#233;rico, the most extensive urban transport project in the world!We fly from La Paz to Uyuni, in the South West corner of Bolivia. If it is a clear day, you will be able to see the huge expanse of the Altiplano as you fly over the landlocked country, perhaps seeing the Andes slowly flattening out to become the Amazonian basin, which spreads to the far East of the country, to the border with Brazil.Arriving in the early evening you will have time to relax before the exciting 4WD tour to the Salar de Uyuni tomorrow.Please note: During the winter months of May-August temperatures of the Altiplano can be extremely cold, so please be prepared and pack warm clothesThis morning we embark on an exhilarating 4WD tour to explore the Salar de Uyuni and the striking landscapes that surround it. First on the agenda is a visit to the Train Cemetery, where you can see the remains of 19th and early 20th century steam locomotives - a good place for artistic photographs. We will then come to Colchani, the main plant for the iodisation of salt and the best place to observe the methods of salt extraction from the salar. Here ovens are used to dry the salt, which is then formed into cakes. From here we drive onto the Salt Flats themselves. Claimed to be the largest salt flat in the world, the brilliant white vast Salar de Uyuní, which covers some 10,500 square kilometres and is estimated to contain 10 billion tons of salt, looks like something from a surrealist painting and its seemingly infinite horizons will amaze you. You will then visit either Fish Island or Incahuasi Island (seasonal dependent). Located in the centre of the Salar, 100 kilometres from Uyuní, this hilly outpost is covered in giant cacti amid a flat, white sea of hexagonal salt tiles.The otherworldly views from the islands will take your breath away, with the brilliant blue sky (weather permitting of course) contrasting with the pure white of the salt flats.Please Note: Occasionally in the rainy season the salt flats become overly flooded and we may have to alter the itinerary if the salt flats are not safe to traverse. Your tour leader will advise as early as possible if this is likely to happen on your tour.Please Note:The accommodation here is basic with limited facilities. Please see your tour notes for further details.We continue south on our epic 4WD expedition, into some of the most remote areas of the Bolivian Altiplano. You will see a variety of dramatic landscapes including smoking volcanoes, barren deserts and gravity-defying rock formations carved by the wind. In this incredibly empty landscape you'll most likely feel the furthest from civilisation you've ever been. You will visit  a number of lagoons including Cañapa, Chairkota and Laguna Honda. You will also get to see the Laguna Colorada, which offers some truly breathtaking scenery, with several varieties of flamingos gathering in the shallow waters of the beautiful crimson lagoon. Before arriving at Laguna Colorada you will pass Arbol de Piedra, the famous Stone Tree.Please Note:The temperatures can get very cold and often drop below zero when crossing the Bolivian Altiplano, especially the winter months from May to September. You may wish to bring a sleeping bag if traveling in the winter months. A sleeping bag can also be rented from your Tour Leader for 70 Bolivian Bolivianos. Also note that on occasion in winter snow can cause the itinerary to be altered at short notice.Please Note:The accommodation here is basic with limited facilities. Please see your tour notes for further details.Today we leave Bolivia behind and head for Chile. We make our way to San Pedro de Atacama, making a few stops on the way. We visit the volcanic zone ‘Sol de Mañana' (Morning Sun) at 4,850 metres above sea level. Here you'll discover a geyser basin with bubbling mud pots, hellish fumaroles and a thick aroma of sulphur fumes. Inside a small crater we will observe mud bubbling away and we will also stop at hot springs where you can bathe. We will pass the Desert of Salvador Dali before crossing a 5,000 metre pass. We then come to the beautiful Laguna Verde, which is shadowed by the cone of the Licancabur Volcano. Next to Laguna Verde is Laguna Blanca, known as the White Lake. Continuing on we will cross into Chile. On the way we get the chance to see both the Bolivian and Chilean sides of the 5960m Licancabur Volcano.We then come to San Pedro de Atacama in the world's driest desert. The area is famous for the salt-covered lunar landscapes, geysers, salt flats and hot springs of the Valley of the Moon, which we will explore by van tomorrow.Please Note: Upon exiting Bolivia you will be required to pay a small fee of 20 Bolivianos.San Pedro de Atacama is a picturesque small town that looks like it has come straight from the scene of a Western with its single-storey buildings, white-washed walls and dusty roads. Due to its remote location and dry climate, the Atacama desert offers some of the clearest skies in the world and as such is used by international space agencies to monitor the skies. If you are lucky enough to have clear nights during your stay in San Pedro de Atacama, the starscape will most likely be the best you'll ever see.Today we enjoy an excursion to the Valley of the Moon. The various stone formations have been formed by the wind and rain over time, resulting in unique and interesting shapes, similar to the surface of the moon. In fact, it is said a prototype of the Mars rover was tested in the area!We fly to the sprawling metropolis of Santiago. If it is a clear day, you will have astounding views of the capital and the surrounding mountains as you come in to land. You are free to explore this cosmopolitan city at your own pace.For the best views of the city, take a funicular railway to the top of San Cristobal where the Statue of the Virgin overlooks the capital and the distant Andes. Here you can taste some of Chile's best wines and find some beautifully situated swimming pools. Santiago is a very clean, modern city with many fountains and parks, and is well-renowned for its markets such as the famous Mercado Central, one of the best seafood markets in the world. In the Plaza Constitución at the Palacio de la Moneda you can see the changing of the guard on most days.Please Note: Breakfast is not included on the morning we depart to Santiago, as we leave early to maximise our time in the city.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/peru_7/peru_mp1_20161111_1689674029.jpg", "countries": "Colombia, Peru, Bolivia, Chile"}