{"title": "Chile, Argentina & Brazil", "link": "https://www.tucantravel.com/tour/chile-argentina-and-brazil/hpsr/", "dates": {"2020-10-03": "USD 590.00", "2020-10-17": "USD 590.00", "2020-10-31": "USD 590.00", "2020-11-14": "USD 590.00", "2020-11-28": "USD 590.00", "2020-12-12": "USD 590.00", "2020-12-26": "USD 590.00", "2021-01-09": "USD 620.00", "2021-02-06": "USD 620.00", "2021-02-20": "USD 620.00", "2021-03-06": "USD 620.00", "2021-03-20": "USD 620.00"}, "days": "18", "description": "E We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Santiago! The capital and economic centre of Chile, Santiago is a fast growing city encircled by the peaks of the Andes Mountains to the east and a smaller range of coastal mountains known as the Cordillera to the west. With its fountains, parks and imposing neoclassical buildings standing side-by-side with glossy office skyscrapers, Santiago is a modern city very much in touch with its colonial past. Don't forget to explore the famous historic centre along the main Plaza de Armas and come across an array of historical and public buildings. Notable sites to visit include the presidential palace, the Chilean museum of Pre-Columbian Art and the Metropolitan Cathedral.Explore the neighbourhood of Barrio Lastarria, a European style area with some of the city’s best street art, shops and restaurants. Or wander the most famous market in the city, the Mercado Central which sells a variety of products from fish and meat to wine and souvenirs.Today starts our Patagonian adventure. We fly into the quaint and colourful town of Punta Arenas, the urban capital of the Magallanes province and gateway to Patagonia.Highlights include visiting the Cerro de la Cruz which gives you a view of the city, the bay and the colourful houses as well as an old shipwreck just off the shore at the southern end of town, called Lord Lonsdale Shipwreck which has been around for 100 years.Don't forget to go for a beer, a Cerveza Austral to be exact, as it's one of the most famous and best Chilean beers!Today enjoy an included excursion to the small island of Magdalena. After a boat ride to the island you will come face-to-face with the largest penguin colonies that you can find south of Chile. The island remains largely untouched and holds an abundance of natural beauty, with barren landscapes and vast ocean views. Hundreds of penguins roam free and are unfazed when visitors walk through the island, perfect for some amazing photo opportunities!Here you can also find the historic lighthouse, which houses interesting information about the island and local history.Back on the mainland you can dine on the freshest seafood from crab to oysters in one of the many seafront restaurants.Please Note: Availability of the included Penguin Excursion depends on local weather conditions, and can on occasion be cancelled without notice. In the case of cancellation we will include a guided visit to see the impressive Andean condors and their nesting ground.This morning we hop on-board the overland truck and take to the great outdoors in the heart of Torres Del Paine National Park. While the drive is long, the scenery is beautiful and we will make regular stops for bathrooms and viewpoints.Complete with jaw-dropping landscapes and emerald forests, the area is an internationally recognised UNESCO World Heritage site. Located on the Chilean side of Patagonia, it measures an astonishing 181 000 hectares. The area is home to various animals including condors,  huemul (South Andean deer), and the llamas closest cousin, the guanaco. Once endangered, around 3000 now call the vast park their home and you will be sure to see a few on your walks.Upon arrival, we will settle into the campsite and our team will show you how to set up the tents. You are then free to walk around the area, taking in all the natural beauty. We recommend walking down to the lake where on a clear day, offers spectacular views of the mountains.Please Note: We camp for three nights in Torres del Paine National Park. Solo travellers will share a tent with a group member of the same sex. Facilities are basic however there is an inside bar, small shop, 24/7 hot water and proper toilets. We recommend bringing a portable battery pack for your devices for these days, however the truck does also have USB charging points. If you don't have your own sleeping bag you can rent one from your Tour Leader for $40 USD, depending on availability. If you would like a sleeping bag set aside for you please speak with your adventures specialist. All meals are included while camping including a three course dinner.Today enjoy a full day exploring the national park with various guided walks and other optional activities on offer. There are many guided walks on offer which showcase the best of the national park and where you can witness some amazing mountain views.Some of the walks are quite demanding, and at a high altitude, but there are a good range of options for all grades of walkers. One such trek offers incredible views of the famous ‘towers’, the three distinctive granite peaks of the Paine mountain range. It’s quite challenging, with the whole route being 19km, however it is well worth it. For the longer treks such as the “towers” walk, a reasonable level of fitness is required and passengers must be prepared for all weather conditions. We recommend packing trekking boots, waterproof trousers and a positive outlook to all weather!Come evening, relax in one of the most peaceful places on earth as you enjoy time with your group and fellow travellers in the camps. Play card games, share stories and learn more about Patagonia from the various guides on hand.Please Note: The schedule for today and tomorrow is interchangeable depending on the weather conditions. Our local mountain guides will decide on the best hikes/excursions for your group each day.Enjoy another full day in this majestic landscape. Your tour leader and local guides will be on hand to assist with recommendations depending on the weather.If you feel you need to give your legs a rest, go horse riding through the valleys for some of the most picturesque views from horseback.Note: From 1st November to 31st March there are additional hikes that can be done by crossing Lago Pehoe in a Catamaran. The cost for the crossing is CLP 35,000 each way.Next up is the enchanting city of El Calafate, full of Patagonian charm and surrounded by snow-capped mountains. Resting on the Argentinian side of Patagonia, the town was founded in 1927 and originally used to shelter the local wool traders. Over time, with the popularity of the nearby National Parks growing, the town has flourished and welcomes many visitors each year.Named after the local berry calafate, it is rumoured that those who eat the berry will at some point always return to Patagonia.Tomorrow is a packed day visiting the Perito Moreno Glacier, so make the most of the local artisans market, the little cafes, excellent ice-cream shops and if you like your meat, the lamb found in El Calafate is particularly delicious.Today we experience the jaw dropping Perito Moreno Glacier and surrounding park. The spectacular ice formation is around 30 kilometres in length and fed by the Southern Patagonian Ice Field, the third largest reserve of freshwater in the world. While many glaciers worldwide are currently decreasing in size, the Perito Moreno glacier is gaining just as much ice as it looses so retains its impressive size and formation.Named after Argentine explorer Francisco Merino, the glacier is coloured in a variety of hues from blue to grey to white and continually creaks and cracks. Advancing at a speed of around two metres per day, it can put on a spectacular show when giant chunks of ice at the outermost edges crack under tremendous pressure, rupture and crash into the water – a process known as calving. You will have the chance to walk around some paths and terraces where you can get some great views of the glacier.Today we will travel to El Chalten, a village located within Los Glaciares National Park and the starting point of many beautiful walking trails. While on the truck enjoy some of the best views as you journey through the wilderness, stopping at Mount Fitz Roy for some spectacular photo opportunities. This grand mountain stands on the border between Chile and Argentina, with a large part close to the summit remaining undefined as to which country it belongs to.Arriving in El Chalten, you will feel immersed in the unspoiled nature that surrounds you. Founded in 1985, the small town has fantastic views of the mountains that shadow over it, and was even named Argentina’s Trekking Capital.Spend the rest of the evening enjoying the town and dine in one of the many quaint restaurants. For such a small place there is a surprising amount on offer from local delicacies to other foods from all over Argentina.Hop on private transportation today to make the journey through the natural beauty of Los Glacieres National Park. Our local expert guide for the day will meet us at our hotel and get us ready for today’s hike, an alternative to the traditional hike to the Fitz Roy viewpoint. Our exploration of the natural beauty of Los Glaciares National Park starts with a 40-minute transfer to El Pilar, heading north out of El Chalten, via the road leading to Lago del Desierto (Desert Lake).Form here we start trekking along the Rio Blanco gently ascending from 500m to 800m altitude until we arrive at the Poincenot camp. On the way we will pass the Piedras Blancas Glacier viewpoint and the Piedras Blancas Lagoon as well as the Valley del Marconi and the entrance to the southern ice field. With our legs warmed up nicely, we start a steep 1km climb of rocky steps with little vegetation around to protect us from the Patagonian wind. While physically demanding, the views that receive us at the top are some of the most impressive in Patagonia. From here, on a clear day, we can see the entire Fitz Roy Massif, the Laguna de los Tres, Glacier de los Tres as well as both Laguna Sucia and Glacier Sucio, a spectacular sight. After a quick lunch, weather permitting, we begin the hour descent to Rio Blanco again before joining the traditional route straight down to El Chalten.If you do not wish to do the Laguna de los Tres hike there are various other options available from El Chalten.Saying goodbye to the wilderness, today we head for Buenos Aires.Known as the “Paris of South America” due its lovely green parks and wide boulevards, Argentina’s capital is the perfect destination for culture lovers. The Museo Nacional de Bellas Artes boasts an impressive collection including original pieces by Monet, Renoir and Cézanne. Another highlight for art buffs is the MALBA, otherwise known as the contemporary art museum. The museum features work from iconic Latino artists such as Frida Kahlo and Diego Rivera, as well as many local and smaller artists.Try your luck at finding the city’s best alfajores, a thick layer of dulce de leche sandwiched between two biscuits. One of the most popular sweet treats in the country, you will see these being sold everywhere from street kiosks to cute cafes.With 4 days in this vibrant and lively city, don’t worry about packing it all in at once!Today is free to further explore Buenos Aires. Wander around the variety of craft markets, where you may come across live bands, barbecues, make-shift bars and practising tango dancers for a truly atmospheric Latin-American experience. San Telmo is the best market for antiques, while the market at Recoleta has great hand-made crafts. No visit to Buenos Aires would be complete without a stroll around the upmarket boutiques and cafés of the Palermo district, and the contrasting bohemian barrio of La Boca, where inhabitants of the area used left-over paint from the nearby shipyards to paint their humble houses made of scrap metal in bright, block colours.The city is also world-renowned for its incredible nightlife, with many nightclubs, bars, restaurants and cinemas open all night. For a great evening, you could see an authentic tango show in the city where the dance originated, and you can’t leave Buenos Aires without trying some of the best steaks in the world!Perhaps start your day sampling some of the best coffee in the city, as Bueno Aires is known for its expanding café culture. Known as bares notables, these traditional cafes are an important part of the city’ heritage and meeting a friend for a coffee is seen as an everyday activity. If you are after something a little stronger, try a wine tasting class and get to know more about Argentinian grape varieties. Choosing a wine in Argentina can be intimidating, so a local wine tasting is the best way to pick up some tips!Other activities to fill your afternoon with could be a street art walking tour, visit the beautiful Teatro Colon where it is also possible to see performances or learn more about local delicacies on a food tour.Please Note: There will be a pre departure meeting at 6pm tonight to meet your new tour leader for the final section of tour.We fly into Puerto Iguazu on the Argentinian side, visiting the famous Iguazú Falls - the most magnificent waterfalls in the world. Unlike most other waterfalls that have just one or two cataracts, at Iguazú Falls there are 275 cataracts in a magnificent 3 kilometre long U shape that we will visit from both sides.Visiting the Argentine side of the falls you can board a speed boat which will take you under the falls soaking you from head to toe, an (optional) adventure you'll never forget! On the Argentine side you'll also find the famous \"Devil's Throat\" where fourteen falls drop with such force that there is always a massive cloud of spray overhead. Following this we transfer to Brazil.Visiting the Brazilian side of the falls will give you a completely different perspective from the Argentine side. On the Brazilian side you can see the falls by walking through the rainforest and along catwalks above and below the rushing water. You can also visit the world's largest hydroelectric dam at Itaipu (optional) where you can learn more about the ecological issues faced during the dam's construction. There is also a very interesting bird park nearby, perfect for that must-have photo with a toucan!Today we fly to Rio de Janeiro.This huge seaside city is famed for its nightlife and golden beaches, with plenty to see and do for travellers. A highlight for many would be to experience the majestic gaze of Christ the Redeemer at the top of Corcovado, the breath-taking panoramic views from the top of Sugarloaf Mountain, and the vibrant coloured tiles of the Selarón staircase. You can walk from the top of the staircase up to the quiet hill-top neighbourhood of Santa Teresa, with many quaint cafés and shops lining the cobblestone streets. In the city centre, you can stroll around Rio's old colonial buildings and wander around the skyscrapers of the financial district.Today is free for you to get under the skin of Rio. You may like to visit the Botanical Gardens, sip cocktails on one of the world-famous beaches of Copacabana or Ipanema, or head to the beautiful Rodrigues de Freitas Lagoon. In the evening, why not enjoy a samba show and get a true insight into what makes Carnival so special.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}