{"title": "Highlights of Argentina and Brazil", "link": "https://www.tucantravel.com/tour/highlights-of-argentina-and-brazil/hsf/", "dates": {"2020-04-11": "USD 330.00", "2020-04-25": "USD 330.00", "2020-05-09": "USD 330.00", "2020-05-23": "USD 330.00", "2020-06-06": "USD 330.00", "2020-06-20": "USD 330.00", "2020-07-04": "USD 330.00", "2020-07-18": "USD 330.00", "2020-08-01": "USD 330.00", "2020-08-15": "USD 330.00", "2020-08-29": "USD 330.00", "2020-09-12": "USD 330.00", "2020-09-26": "USD 330.00", "2020-10-10": "USD 330.00", "2020-10-24": "USD 330.00", "2020-11-07": "USD 330.00", "2020-11-21": "USD 330.00", "2020-12-05": "USD 330.00", "2020-12-19": "USD 330.00", "2021-01-02": "USD 350.00", "2021-01-16": "USD 350.00", "2021-02-02": "USD 350.00", "2021-02-13": "USD 350.00", "2021-02-27": "USD 350.00", "2021-03-13": "USD 350.00", "2021-03-27": "USD 350.00", "2021-04-10": "USD 350.00", "2021-04-24": "USD 350.00", "2021-05-08": "USD 350.00", "2021-05-22": "USD 350.00", "2021-06-05": "USD 350.00"}, "days": "11", "description": "S We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Santiago! You are free today to arrive at your leisure and start enjoying the sights. We recommend booking pre tour accommodation to enjoy all the city has to offer.The capital and economic centre of Chile, Santiago is a fast growing city encircled by the peaks of the Andes Mountains to the east and a smaller range of coastal mountains known as the Cordillera to the west. With its fountains, parks and imposing neoclassical buildings standing side-by-side with glossy office skyscrapers, Santiago is a modern city very much in touch with its colonial past. Don't forget to explore the famous historic centre along the main Plaza de Armas and come across an array of historical and public buildings. Notable sites to visit include the presidential palace, the Chilean museum of Pre-Columbian Art and the Metropolitan Cathedral.Today we fly into Mendoza, one of the most visited and popular cities in the country. Under the shadow of the Andes, this picturesque place is most known for it’s incredible wine valleys.Mendoza is where General José de San Martín organised the army with which he liberated Chile and Peru from Spanish rule in 1818. Unfortunately, few historic buildings remain after an earthquake devastated the city in 1861. However, the city was rebuilt on a grid system, resulting in the broad tree-lined streets and beautiful green plazas for which the city is famous. There are great views from the top of “Cerro de la Gloria” at Parque San Martíno.Please Note: For the departure that arrives in Rio in time for Rio Carnival 2020, your itinerary will operate slightly differently spending an extra night in Mendoza. Please speak to an Adventure Specialist for more details.No trip to Mendoza would be complete without touring the surrounding vineyards. Since the wine boom in the early 20th century, Mendoza has held its title of the largest wine growing area in Latin America, and one of the best in the world. Sitting at the foot of the Andes, the vineyards are planted at some of the highest altitudes and since the region doesn’t experience extreme temperatures, a variety of grapes are able to flourish here.Today your group will enjoy an excursion to a local vineyard as well as a charming olive farm. Sample some of the finest wine in the region (including the world renowned Malbec!) while learning more about the history and production of wine. Enjoy a traditional Argentinian lunch at the vineyard sampling some fine local and homegrown foods. Finally, we taste various olive oils at the farm and enjoy some of the most stunning scenery the countryside has to offer.The beautiful city of Buenos Aires is known as the \"Paris of South America\" due to its lovely green parks, plazas and wide boulevards. Explore the quirky neighbourhoods and artistic markets of the city, where European and Latin American influences have mixed together to create a city like no other. To make sure you see as many of the city's historic sites as possible in the time available, we suggest taking a sight-seeing bus, which you can hop on and off as you wish. You'll see Avenida 9 de Julio (the widest avenue in the world), the impressive Teatro Colón, one of the world's best opera houses, and the famous Casa Rosada, Argentina’s presidential palace, from where Juan and Eva Perón famously addressed the crowds gathered on Plaza de Mayo in 1945.Today is free to further explore Buenos Aires. Wander around the variety of craft markets, where you may come across live bands, barbecues, make-shift bars and practising tango dancers for a truly atmospheric Latin-American experience. San Telmo is the best market for antiques, while the market at Recoleta has great hand-made crafts. No visit to Buenos Aires would be complete without a stroll around the upmarket boutiques and cafés of the Palermo district, and the contrasting bohemian barrio of La Boca, where inhabitants of the area used left-over paint from the nearby shipyards to paint their humble houses made of scrap metal in bright, block colours.The city is also world-renowned for its incredible nightlife, with many nightclubs, bars, restaurants and cinemas open all night. For a great evening, you could see an authentic tango show in the city where the dance originated, and you can’t leave Buenos Aires without trying some of the best steaks in the world!On your last day in Buenos Aires, make sure you have ticked off the highlights and must-see places in the city!We fly into Puerto Iguazu on the Argentinian side, visiting the famous Iguazú Falls - the most magnificent waterfalls in the world. Unlike most other waterfalls that have just one or two cataracts, at Iguazú Falls there are 275 cataracts in a magnificent 3 kilometre long U shape that we will visit from both sides. Visiting the Argentine side of the falls you can board a speed boat which will take you under the falls soaking you from head to toe, an optional adventure you'll never forget! On the Argentine side you'll also find the famous \"Devil's Throat\" where fourteen falls drop with such force that there is always a massive cloud of spray overhead. Following this we transfer to Brazil by land.Visiting the Brazilian side of the falls will give you a completely different perspective from the Argentine side. On the Brazilian side you can see the falls by walking through the rainforest and along catwalks above and below the rushing water. You can also visit the world's largest hydroelectric dam at Itaipu (optional) where you can learn more about the ecological issues faced during the dam's construction. There is also a very interesting bird park nearby, perfect for that must-have photo with a toucan!Today we fly to Rio de Janeiro.This huge seaside city is famed for its nightlife and golden beaches, with plenty to see and do for travellers. A highlight for many would be to experience the majestic gaze of Christ the Redeemer at the top of Corcovado, the breath-taking panoramic views from the top of Sugarloaf Mountain, and the vibrant coloured tiles of the Selarón staircase. You can walk from the top of the staircase up to the quiet hill-top neighbourhood of Santa Teresa, with many quaint cafés and shops lining the cobblestone streets. In the city centre, you can stroll around Rio's old colonial buildings and wander around the skyscrapers of the financial district.Today is free for you to get under the skin of Rio. You may like to visit the Botanical Gardens, sip cocktails on one of the world-famous beaches of Copacabana or Ipanema, or head to the beautiful Rodrigues de Freitas Lagoon. In the evening, why not enjoy a samba show and get a true insight into what makes Carnival so special.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}