{"title": "Salt Flats to Sugarloaf", "link": "https://www.tucantravel.com/tour/salt-flats-to-sugarloaf/hsl/", "dates": {"2020-04-03": "USD 510.00", "2020-04-17": "USD 510.00", "2020-05-01": "USD 510.00", "2020-05-15": "USD 510.00", "2020-05-29": "USD 510.00", "2020-06-12": "USD 510.00", "2020-06-26": "USD 510.00", "2020-07-10": "USD 510.00", "2020-07-24": "USD 510.00", "2020-08-07": "USD 510.00", "2020-08-21": "USD 510.00", "2020-09-04": "USD 510.00", "2020-09-18": "USD 510.00", "2020-10-02": "USD 510.00", "2020-10-16": "USD 510.00", "2020-10-30": "USD 510.00", "2020-11-13": "USD 510.00", "2020-11-27": "USD 510.00", "2020-12-11": "USD 510.00", "2020-12-25": "USD 510.00", "2021-01-08": "USD 540.00", "2021-01-25": "USD 540.00", "2021-02-05": "USD 540.00", "2021-02-19": "USD 540.00", "2021-03-05": "USD 540.00", "2021-03-19": "USD 540.00", "2021-04-02": "USD 540.00", "2021-04-16": "USD 540.00", "2021-04-30": "USD 540.00", "2021-05-14": "USD 540.00", "2021-05-28": "USD 540.00"}, "days": "19", "description": "A We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to La Paz and the start of your adventure! You are free to arrive today at your leisure. In order to fully enjoy the optional excursions available in La Paz we highly recommend booking pre tour accommodation.La Paz is unlike any other city in the world. A dizzying blend of sounds, colours, smells, bustling activity and true Bolivian culture, La Paz is also the highest capital city in the world, sitting at an impressive 3,500 metres above sea level. Surrounded by the snow capped Altiplano mountains, the city is crammed into a canyon and surrounded by eroding and unique rock formations.Built in a steep valley that protects the city from the harsh elements of the Altiplano, just about every building in La Paz is built on some sort of hill, so sightseeing will literally take your breath away! Our hotel is very centrally located and is just around the corner from the city's colourful indigenous street markets including the fascinating and suitably named \"Witches Market'' where local women in traditional 'Cholita' dress sell such items as dead cats and llamas foetuses said to ward off evil spirits. The main square, Plaza Murillo, is also within walking distance. The square still retains its colonial buildings including the Presidential Palace. La Paz is possibly the best place to experience a traditional peña show of Andean music and dance to local bands playing time-honoured instruments such as zampoñas (pipes) and charangos (the ukulele).You will have a pre departure meeting at 6pm tonight to meet your tour leader and fellow travellers. Please check the reception of the hotel for details.We fly from La Paz to Uyuni, in the South West corner of Bolivia. If it is a clear day, you will be able to see the huge expanse of the Altiplano as you fly over the landlocked country, perhaps seeing the Andes slowly flattening out to become the Amazonian basin, which spreads to the far East of the country, to the border with Brazil.Arriving in the early evening you will have time to relax before the exciting 4WD tour to the Salar de Uyuni tomorrow.Please note: During the winter months of May-August temperatures of the Altiplano can be extremely cold, so please be prepared and pack warm clothesThis morning we embark on an exhilarating 4WD tour to explore the Salar de Uyuni and the striking landscapes that surround it. First on the agenda is a visit to the Train Cemetery, where you can see the remains of 19th and early 20th century steam locomotives - a good place for artistic photographs. We will then come to Colchani, the main plant for the iodisation of salt and the best place to observe the methods of salt extraction from the salar. Here ovens are used to dry the salt, which is then formed into cakes. From here we drive onto the Salt Flats themselves. Claimed to be the largest salt flat in the world, the brilliant white vast Salar de Uyuní, which covers some 10,500 square kilometres and is estimated to contain 10 billion tons of salt, looks like something from a surrealist painting and its seemingly infinite horizons will amaze you. You will then visit either Fish Island or Incahuasi Island (seasonal dependent). Located in the centre of the Salar, 100 kilometres from Uyuní, this hilly outpost is covered in giant cacti amid a flat, white sea of hexagonal salt tiles.The otherworldly views from the islands will take your breath away, with the brilliant blue sky (weather permitting of course) contrasting with the pure white of the salt flats.Please Note: Occasionally in the rainy season the salt flats become overly flooded and we may have to alter the itinerary if the salt flats are not safe to traverse. Your tour leader will advise as early as possible if this is likely to happen on your tour.Please Note:The accommodation here is basic with limited facilities. Please see your tour notes for further details.We continue south on our epic 4WD expedition, into some of the most remote areas of the Bolivian Altiplano. You will see a variety of dramatic landscapes including smoking volcanoes, barren deserts and gravity-defying rock formations carved by the wind. In this incredibly empty landscape you'll most likely feel the furthest from civilisation you've ever been. You will visit  a number of lagoons including Cañapa, Chairkota and Laguna Honda. You will also get to see the Laguna Colorada, which offers some truly breathtaking scenery, with several varieties of flamingos gathering in the shallow waters of the beautiful crimson lagoon. Before arriving at Laguna Colorada you will pass Arbol de Piedra, the famous Stone Tree.Please Note:The temperatures can get very cold and often drop below zero when crossing the Bolivian Altiplano, especially the winter months from May to September. You may wish to bring a sleeping bag if traveling in the winter months. A sleeping bag can also be rented from your Tour Leader for 70 Bolivian Bolivianos. Also note that on occasion in winter snow can cause the itinerary to be altered at short notice.Please Note:The accommodation here is basic with limited facilities. Please see your tour notes for further details.Today we leave Bolivia behind and head for Chile. We make our way to San Pedro de Atacama, making a few stops on the way. We visit the volcanic zone ‘Sol de Mañana' (Morning Sun) at 4,850 metres above sea level. Here you'll discover a geyser basin with bubbling mud pots, hellish fumaroles and a thick aroma of sulphur fumes. Inside a small crater we will observe mud bubbling away and we will also stop at hot springs where you can bathe. We will pass the Desert of Salvador Dali before crossing a 5,000 metre pass. We then come to the beautiful Laguna Verde, which is shadowed by the cone of the Licancabur Volcano. Next to Laguna Verde is Laguna Blanca, known as the White Lake. Continuing on we will cross into Chile. On the way we get the chance to see both the Bolivian and Chilean sides of the 5960m Licancabur Volcano.We then come to San Pedro de Atacama in the world's driest desert. The area is famous for the salt-covered lunar landscapes, geysers, salt flats and hot springs of the Valley of the Moon, which we will explore by van tomorrow.Please Note: Upon exiting Bolivia you will be required to pay a small fee of 20 Bolivianos.San Pedro de Atacama is a picturesque small town that looks like it has come straight from the scene of a Western with its single-storey buildings, white-washed walls and dusty roads. Due to its remote location and dry climate, the Atacama desert offers some of the clearest skies in the world and as such is used by international space agencies to monitor the skies. If you are lucky enough to have clear nights during your stay in San Pedro de Atacama, the starscape will most likely be the best you'll ever see.Today we enjoy an excursion to the Valley of the Moon. The various stone formations have been formed by the wind and rain over time, resulting in unique and interesting shapes, similar to the surface of the moon. In fact, it is said a prototype of the Mars rover was tested in the area!Next we head to the sprawling metropolis of Santiago. Nestled in central Chile, the city is framed by the tall and snow capped Andes mountains which on a clear day give the city the most stunning backdrop.Santiago is a very clean, modern city with many fountains and parks, but also has its own turbulent history. It is well-known for its fresh markets such as the famous La Vega Central Market, and the Mercado Central, one of the best seafood markets in the world. You can see the changing of the guard most days outside the impressive Palacio de La Moneda, the seat of the President of Chile. In the 1970s, the palace was bombarded during the military coup d'état, ushering in a dark period in Chile’s national history.For the best views of the city, take a funicular railway or hike to the top of San Cristobal, where the Statue of the Virgin overlooks the capital and the distant Andes. Here you can taste some of Chile's best wines and find some beautifully situated swimming pools.Please Note: We will depart early to maximise our time in Santiago, therefore breakfast is not included on this day.Today is free for you to further explore Santiago. Why not visit los Dominicos village, a traditional market which offers an array of Chilean artisan goods and textiles. Wander the shops and pick up some unique souvenirs or perch yourself outside a coffee shop and try catch some of the live musicians who often play in the area.Other interesting places to visit are the Museo Nacional de Bellas Artes, an impressive fine art gallery housed in a colossal neoclassical building, and the Cementerio General, a huge cemetery with large mausoleums including that of the former president Salvador Allende Gossens. Also worth a visit is the Plaza de Armas, the centrepiece of the city, which is bordered on one side by the impressive Metropolitan Cathedral of Santiago, completed in the 19th century.If you would like to experience a more tranquil area of Chile, you may wish to take an optional excursion to the Chilean coast, about two hours’ drive from Santiago. You can wander around the creative port city of Valparaiso, which has a lively tradition of imaginative street art and painted murals, or you can relax in the upmarket beach resort of Viña del Mar, trying exquisite seafood in stylish restaurants that look out onto the Pacific Ocean.Today we fly into Mendoza, one of the most visited and popular cities in the country. Under the shadow of the Andes, this picturesque place is most known for it’s incredible wine valleys.Mendoza is where General José de San Martín organised the army with which he liberated Chile and Peru from Spanish rule in 1818. Unfortunately, few historic buildings remain after an earthquake devastated the city in 1861. However, the city was rebuilt on a grid system, resulting in the broad tree-lined streets and beautiful green plazas for which the city is famous. There are great views from the top of “Cerro de la Gloria” at Parque San Martíno.Please Note: For the departure that arrives in Rio in time for Rio Carnival 2020, your itinerary will operate slightly differently spending an extra night in Mendoza. Please speak to an Adventure Specialist for more details.No trip to Mendoza would be complete without touring the surrounding vineyards. Since the wine boom in the early 20th century, Mendoza has held its title of the largest wine growing area in Latin America, and one of the best in the world. Sitting at the foot of the Andes, the vineyards are planted at some of the highest altitudes and since the region doesn’t experience extreme temperatures, a variety of grapes are able to flourish here.Today your group will enjoy an excursion to a local vineyard as well as a charming olive farm. Sample some of the finest wine in the region (including the world renowned Malbec!) while learning more about the history and production of wine. Enjoy a traditional Argentinian lunch at the vineyard sampling some fine local and homegrown foods. Finally, we taste various olive oils at the farm and enjoy some of the most stunning scenery the countryside has to offer.The beautiful city of Buenos Aires is known as the \"Paris of South America\" due to its lovely green parks, plazas and wide boulevards. Explore the quirky neighbourhoods and artistic markets of the city, where European and Latin American influences have mixed together to create a city like no other. To make sure you see as many of the city's historic sites as possible in the time available, we suggest taking a sight-seeing bus, which you can hop on and off as you wish. You'll see Avenida 9 de Julio (the widest avenue in the world), the impressive Teatro Colón, one of the world's best opera houses, and the famous Casa Rosada, Argentina’s presidential palace, from where Juan and Eva Perón famously addressed the crowds gathered on Plaza de Mayo in 1945.Today is free to further explore Buenos Aires. Wander around the variety of craft markets, where you may come across live bands, barbecues, make-shift bars and practising tango dancers for a truly atmospheric Latin-American experience. San Telmo is the best market for antiques, while the market at Recoleta has great hand-made crafts. No visit to Buenos Aires would be complete without a stroll around the upmarket boutiques and cafés of the Palermo district, and the contrasting bohemian barrio of La Boca, where inhabitants of the area used left-over paint from the nearby shipyards to paint their humble houses made of scrap metal in bright, block colours.The city is also world-renowned for its incredible nightlife, with many nightclubs, bars, restaurants and cinemas open all night. For a great evening, you could see an authentic tango show in the city where the dance originated, and you can’t leave Buenos Aires without trying some of the best steaks in the world!On your last day in Buenos Aires, make sure you have ticked off the highlights and must-see places in the city!We fly into Puerto Iguazu on the Argentinian side, visiting the famous Iguazú Falls - the most magnificent waterfalls in the world. Unlike most other waterfalls that have just one or two cataracts, at Iguazú Falls there are 275 cataracts in a magnificent 3 kilometre long U shape that we will visit from both sides. Visiting the Argentine side of the falls you can board a speed boat which will take you under the falls soaking you from head to toe, an optional adventure you'll never forget! On the Argentine side you'll also find the famous \"Devil's Throat\" where fourteen falls drop with such force that there is always a massive cloud of spray overhead. Following this we transfer to Brazil by land.Visiting the Brazilian side of the falls will give you a completely different perspective from the Argentine side. On the Brazilian side you can see the falls by walking through the rainforest and along catwalks above and below the rushing water. You can also visit the world's largest hydroelectric dam at Itaipu (optional) where you can learn more about the ecological issues faced during the dam's construction. There is also a very interesting bird park nearby, perfect for that must-have photo with a toucan!Today we fly to Rio de Janeiro.This huge seaside city is famed for its nightlife and golden beaches, with plenty to see and do for travellers. A highlight for many would be to experience the majestic gaze of Christ the Redeemer at the top of Corcovado, the breath-taking panoramic views from the top of Sugarloaf Mountain, and the vibrant coloured tiles of the Selarón staircase. You can walk from the top of the staircase up to the quiet hill-top neighbourhood of Santa Teresa, with many quaint cafés and shops lining the cobblestone streets. In the city centre, you can stroll around Rio's old colonial buildings and wander around the skyscrapers of the financial district.Today is free for you to get under the skin of Rio. You may like to visit the Botanical Gardens, sip cocktails on one of the world-famous beaches of Copacabana or Ipanema, or head to the beautiful Rodrigues de Freitas Lagoon. In the evening, why not enjoy a samba show and get a true insight into what makes Carnival so special.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}