{"title": "Bangkok & Thai Beaches", "link": "https://www.tucantravel.com/tour/bangkok-and-thai-beaches/icbb/", "dates": {"2020-04-04": "USD 70.00", "2020-05-02": "USD 70.00", "2020-05-30": "USD 70.00", "2020-06-27": "USD 70.00", "2020-07-25": "USD 70.00", "2020-08-22": "USD 70.00", "2020-09-19": "USD 70.00", "2020-10-17": "USD 70.00", "2020-11-14": "USD 70.00", "2020-12-12": "USD 70.00", "2021-01-09": "USD 80.00", "2021-02-06": "USD 80.00", "2021-03-06": "USD 80.00", "2021-04-03": "USD 80.00", "2021-05-01": "USD 80.00", "2021-05-29": "USD 80.00", "2021-06-26": "USD 80.00", "2021-07-24": "USD 80.00", "2021-08-21": "USD 80.00", "2021-09-18": "USD 80.00", "2021-10-16": "USD 80.00", "2021-11-13": "USD 80.00", "2021-12-11": "USD 80.00"}, "days": "7", "description": "I We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Bangkok and the start of your South East Asian adventure. This loud, vibrant and tantalizing city is the centre of economics in Thailand and is seen as the gateway to South East Asia for most travellers.Today you are free to arrive at your leisure and enjoy the various activities in the city. We highly recommend booking pre tour accommodation to maximise your time here.One of the biggest highlights of the city and a must see is the opulent Grand Palace, which was built in 1782 and was home of the Thai King for over 150 years. The palace complex has several impressive buildings such as the Temple of the Emerald Buddha. Just walking around this vast area will give you an idea of the spectacular Thai architecture and vibrant colours. Another must see is the temple of Wat Pho, which houses the impressive reclining Buddha. The position of the Buddha represents entry into Nirvana and the end of reincarnations and is an important symbol for Thai people.Today you can also visit the famous Chatuchak Weekend Market, Bangkok's largest market which is also said to be the largest in the world. There are over 15,000 stalls offering anything and everything that you could dream of. Mingle with the locals and immerse yourself in the bustle of vendors and shoppers going about their daily lives.Tonight you will have a pre departure meeting to meet your tour leader and group. Please check reception for details and timings.This morning we enjoy a short riverboat trip experiencing a different perspective of the Bangkok skyline. We disembark at Wat Pho and visit the famous reclining Buddha.This afternoon perhaps spend time soaking up the culture and art scene in one of the many museums dotted around the city. For history buffs, you could easily spend hours soaking up the information in the National Museum, which was Thailand's only museum until the mid 1970?s and has a large and very impressive collection. The Bangkok Art and Culture Centre is a work of art in itself, and you can explore the exhibits which range from photographs to paintings. The Tonson Gallery is excellent for those interested in contemporary art, while the Baan Kamthieng House Museum is perfect for learning more about rural life in Thailand.In the early evening we will meet our group and tour leader back at the hotel and head to the train station for the overnight train to southern Thailand!Arriving to the train station early in the morning we will then take a minivan towards Khao Sok National Park, driving for a further three hours to reach our hotel. Staying nearby you have the chance to visit the national park and tropical rainforest, which is older than the Amazon Jungle. The area of Khao Sok National Park is an incredible 739 square kilometres, including the 165 square kilometre Cheow Lan Lake. The park is the most biodiverse jungle in Thailand and as well as holding many wild animals has an amazing array of flora and fauna, as well as various bird species. Mammals found in the rainforest include the tapir, Asian elephant, sambar deer, wild boar, white handed gibbons and bears.The landscapes are beautiful, with lush jungle complimented with breath-taking limestone cliffs and hidden waterfalls. It is also home to the rare Rafflesia Kerrii, the world's largest flower. Khao Sok is the only place in Thailand to find it.After an orientation of the surrounding area you are free to explore the park or simply wander around the breathtaking area. While the area is rural and tranquil, there are various restaurants and hotels in the area serving fresh and good quality local food.Spend today enjoying the rainforest and everything on offer in the area. The lake is a popular base for many activities including kayaking, canoeing and bamboo rafting. The views from the water are stunning as you pass limestone cliffs and see various fish swimming below.For those who enjoy hiking there are various paths around the park to follow, many of which lead to beautiful waterfalls. A great way to experience this is to hire a local guide who can talk you through the animals that live in the area and show you the best places to see in the rainforest.Caves in the area, such as Diamond Cave, Khang Cow Cave and Nam Talu Cave, all connect to the lake and can be explored on a boat trip.This morning we leave behind the rainforest for a different type of scenery just as spectacular; the beaches of Phuket. Thailand's largest island, Phuket offers some of the country's most popular beaches and is located close to popular islands including James Bond Island (Khao Phing Kan) or Racha Island (Ko Racha Yai) famed for its diving and snorkelling.We hop on a private minibus and travel for around three hours to reach our hotel in Phuket. The rest of the afternoon is free to start enjoying the sunshine filled beaches and glistening waters. The hardest decision of today will be whether you snorkel or paddle board first!Phuket comes alive at night with various restaurants, bars and live music venues. From all night laser nightclubs to laid back beach bars, there is something for every taste and every budget on the island. The food choices are endless, you could enjoy the fresh seafood on offer or the various small eateries serving up typical Thai dishes. Your tour leader will be able to recommend the best ones.Spend today soaking up the beauty of Phuket and the surrounding islands. Thailand's famed islands have been the set for many films over the years and hold a certain mystique. Take a boat trip and explore as many as your heart desires or snorkel around the bays amongst stunning exotic fish and other marine animals.Of course beaches and islands are not to everyone's taste, so why not visit the historical Old Phuket Town, small enough to stroll around but with an abundance of differing cultural histories. See the Big Buddha, a white, 45 metre tall effigy of Buddha with 360 degree views of the island. Wat Chalong is one of the most significant temples on the island and is beautifully decorated with many shimmering pieces on the pagodas.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}