{"title": "Asia Experience", "link": "https://www.tucantravel.com/tour/asia-experience/icca/", "dates": {"2020-04-04": "USD 450.00", "2020-05-02": "USD 450.00", "2020-05-30": "USD 450.00", "2020-06-27": "USD 450.00", "2020-07-25": "USD 450.00", "2020-08-22": "USD 450.00", "2020-09-19": "USD 450.00", "2020-10-17": "USD 450.00", "2020-11-14": "USD 450.00", "2020-12-12": "USD 450.00", "2021-01-09": "USD 470.00", "2021-02-06": "USD 470.00", "2021-03-06": "USD 470.00", "2021-04-03": "USD 470.00", "2021-05-01": "USD 470.00", "2021-05-29": "USD 470.00", "2021-06-26": "USD 470.00", "2021-07-24": "USD 470.00", "2021-08-21": "USD 470.00", "2021-09-18": "USD 470.00", "2021-10-16": "USD 470.00", "2021-11-13": "USD 470.00", "2021-12-11": "USD 470.00"}, "days": "29", "description": "F We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Bangkok and the start of your South East Asian adventure. This loud, vibrant and tantalizing city is the centre of economics in Thailand and is seen as the gateway to South East Asia for most travellers.Today you are free to arrive at your leisure and enjoy the various activities in the city. We highly recommend booking pre tour accommodation to maximise your time here.One of the biggest highlights of the city and a must see is the opulent Grand Palace, which was built in 1782 and was home of the Thai King for over 150 years. The palace complex has several impressive buildings such as the Temple of the Emerald Buddha. Just walking around this vast area will give you an idea of the spectacular Thai architecture and vibrant colours. Another must see is the temple of Wat Pho, which houses the impressive reclining Buddha. The position of the Buddha represents entry into Nirvana and the end of reincarnations and is an important symbol for Thai people.Today you can also visit the famous Chatuchak Weekend Market, Bangkok's largest market which is also said to be the largest in the world. There are over 15,000 stalls offering anything and everything that you could dream of. Mingle with the locals and immerse yourself in the bustle of vendors and shoppers going about their daily lives.Tonight you will have a pre departure meeting to meet your tour leader and group. Please check reception for details and timings.Today we travel overland into Cambodia and the small but vibrant and historically important city of Siem Reap. Not only is Siem Reap the gateway to the ancient temples of Angkor Thom and Angkor Wat (of Lara Croft movie fame!), but it's also a modern travellers Nirvana, with culinary delights ranging from tasty and downright unusual street food to mouth-watering high-end restaurants.This evening the group will head out to the famous Pub street with the tour leader to sample a local beer or to catch a local apsara dance show.Approximate Travel Times: 8 hours on a tourist bus (including a 1 hour stop at the border for immigration. This stop may be shorter or longer depending on the day)Today you are free to explore Angkor Wat, the most famous temple in Cambodia. There are over one thousand temples here which attract over one million visitors annually. The temples range from small ruins to the famous Angkor Wat, and the site is said to be the world's largest single religious monument.Angkor Wat, a UNESCO world heritage site, pays homage to the Hindu god Vishnu and has a dazzling array of beautiful ornate carvings. The many ceremonial structures and temples here were built between the 9th and 13th centuries by the Khmer Empire that spanned a period of approximately 600 years. These temples are some of the most famous in the world and take up an area of approximately 160 square kilometres.You can either make your own way by tuk tuk to the close-by Archaeological Park, or your tour leader can arrange a group tour with an experienced and knowledgeable guide. A good option is to wake early to enjoy the sunrise with the wonderful photo opportunities, Capture the sunrise reflection of Angkor Wat in the surrounding lakes and ponds or the less busy but no less spectacular views from atop Angkor Hill, looking down into the Angkor complex through the early morning haze.Please Note Entrance to Angkor Wat is not included on the tour.Today's journey through rural Cambodia brings us to Phnom Penh, Cambodia's bustling capital city with a very turbulent past. Sitting on the juncture of the Mekong River and the Tonle Sap river, Phnom Penh has been the national capital since the French colonised Cambodia during the 19th century. The city has grown from a small fishing village to what is now the industrial, commercial, cultural and historical centre of Cambodia.Phnom Penh is a welcoming and friendly city, abundant with culture, arts and music, far removed from the darker chapters in the country's history.At night, why not head down to the riverside to experience the international and local cuisine scene and a slow cold Cambodian beer.Today we visit the Tuol Sleng Genocide Museum, a former school which was transformed into one of the Khmer Rouge's most feared prison and torture camps during the Pol Pot regime. The building is now a haunting tribute to the thousands who died here and at the other 150 similar camps throughout the country in the late 1970's. Those who were detained at the camp were later taken and executed at the Choeung Ek extermination Centre, more commonly known as \"The Killing Fields\", a site we also visit to learn more of and try to understand this wonderful country's turbulent past.Whilst the aforementioned visits are included in the tour they are also entirely optional should anybody prefer not to visit, in which case you will be free to further explore other activities and landmarks in the city.Today we travel South along the Mighty Mekong River by boat with our final destination being Vietnam and the border town of Chau Doc , the gateway to the Mekong Delta.In Chau Doc you can enjoy your first authentic Vietnamese meal and a stroll along the Mekong River before retiring for the night and a brief, yet welcome respite from the hustle and bustle of South East Asian city life.Continuing our journey today through the Mekong Delta, we head into the incredible city of Ho Chi Minh City, formerly known as Saigon, Vietnam's largest city and former capital of South Vietnam.Still known as Saigon to many locals, Ho Chi Minh is a large city and with much to do. We head into our hotel in the Old Quarter to be located right in the middle of the action.The bustling city of Ho Chi Minh is the former capital of South Vietnam and formerly known as Saigon until the end of the Vietnam War (around 1975) and the infamous ‘Fall of Saigon” when the city was renamed after North Vietnam’s illustrious and revered leader Ho Chi Minh. Originally a small fishing village, it is now the most important economic centre in Vietnam and is the largest city in the country.We start our exploration of this captivating city with a local walking tour where we will visit Ben Thanh Market, Opera House, Notre Dame Cathedral & Post Office, Independence Palace and the War Remnants Museum.Hoi An is widely considered one of the most colourful and beautiful towns in Vietnam. Largely spared of damage during the Vietnamese conflict, the old trading port of Hoi An is a UNESCO Heritage town offering an amazing central old town with small friendly streets dotted with an abundance of family run shops, restaurants and coffee shops. Whether you want to stop for a nice cheap beer while watching the sun set over the river or splash out on an incredible seafood supper, Hoi An has it all within walking distance.This afternoon we will enjoy a short orientation of the area followed by a bike tour of the nearby paddy fields and beach.Today is free to soak up more of the beauty of Hoi An. One of the biggest highlights are the many tailors found around every corner. If you love clothes and want something special or unique Hoi An is the perfect place. Take a photo in to show the tailors or pick an outfit from the brochures and have it ready the next day.Another highlight of the area is renting a bicycle and cycling the short 5km ride through country lanes bordered by rice paddy fields to the wholly unspoiled Cua Dai beach for the day.Hoi An is also known for offering some incredible local cooking classes. Visit the markets on a local tour and learn the secrets behind the classic Vietnamese spring roll or one of the many other delicacies.This morning we get picked up and driven to Da Nang's Marble Mountains which are made out of limestone and marble. Following this we drive towards Vietnam's ancient Capital City, Hue. On route we will also stop to enjoy the spectacular views from the Hai Van Pass, the longest and highest mountain pass road in Vietnam. Upon reaching the Imperial City, we will tour the forbidden citadel which was only for the emperors and those closest to them, with severe punishments if you were caught trespassing. Time permitting, you can also take a trip down the Perfume River to visit the tombs of Vietnam's ancient Emperors.A short flight takes us to colourful Hanoi.Hanoi offers a beguiling combination of tranquillity and chaos, from the elegance of its crumbling colonial architecture and tree-lined boulevards, to the boisterous cacophony of street vendors and motorcycles. Much can be absorbed of daily life by wandering the streets of the old quarter, tasting local market food, and people-watching. For the culture buffs there are museums, temples and tombs which offer insight into a city rich in history and character.Our morning begins with a visit to the historical center of Hanoi to walk around the relaxing scenery of Hoan Kiem Lake where you can watch the early morning aerobics and enjoy a local speciality of 'egg coffee'. Legend has it that a magical sword was sent to Emperor Ly Thai which was used to drive the Chinese from Vietnam. The sword was later taken from the Emperor by a golden turtle who dissapeared into the depths of the lake with it, and that's where it gets its name from 'Lake of the restored sword'.After our morning at the lake, you have the opportunity to travel out to and visit the world famous Halong Bay on either an optional day or overnight excursion. The bay includes hundreds of islands with towering limestone karsts draped in verdant foliage and is a classified UNESCO World Heritage site.Today is free to enjoy as you please. Discover Ho Chi Minh's Mausoleum, the Presidential Palace, the Stilt House and the famous 1-Pillar Pagoda. You can also visit “coffee street” in the old quarter for a ca phe sua da (a milky iced coffee) for a caffeine fix, grab some hearty bowls of Pho from the street vendors selling delicious Vietnamese street food or cross the red Huc Bridge to visit Jade Island where the Ngoc Son Temple (Temple of Jade Mountain) stands.Spend the rest of your time in Hanoi freely exploring its historical sites and taking in the atmosphere. For a fun evening activity, we highly recommend checking out the water puppet theatre for a traditional performance!Today we depart Hanoi and Vietnam to catch a flight to Vientiane in Laos. This small and tranquil city is as welcoming as it is diverse. Heavily influenced by Laos' time under French rule, Vientiane offers respite from the bustle and busyness of other Asian capital cities. Whether you prefer to visit the local markets, visit the local temples and Wats or just take time out to people-watch at a local cafe, bar or restaurant along the Mekong River, your short time in Vientiane is sure to create many wonderful memories. In the evening after an optional group meal, your Tour Leader will invite you for a fun evening 10-pin bowling. Not something usually associated with Asia but a popular night out for locals and visitors alike.Please note that your flight today from Hanoi to Vientiane in Laos may be unaccompanied by a tour leader. If this is the case, all flights and airport transfers will be provided and your new tour leader will arrange to meet you at the Vientiane hotel.Laos was a victim during the Vietnam War and is actually the most bombed country in the world. During the fighting 270 million submunitions were dropped on Laos between 1963 to 1974, and many of those failed to explode, with many remaining intact and unexploded in many rural areas to this day.In Vientiane, visit the COPE Centre and learn about the Unexploded Ordnance problem in Laos and how the country is managing the situation. You can also learn more about the work undertaken by COPE to provide disability services for people affected by the bombing at the exhibition as well as spend the rest of the day exploring more of this placid but historical city.This morning we travel to Vang Vieng passing some stunning scenery on route. The landscape here is just as impressive as the final destination and you will witness scenes of village life on the way. The serene town of Vang Vieng is situated on a plateau surrounded by mystical limestone caves and beautiful waterfalls. The area is inhabited by the Hmong and Yao tribes, and the countryside here offers some of the most beautiful scenery in the country.Indulge in some local cuisine and explore the markets which are filled with fruits and handcrafted textiles. The food in Laos is colourful, vibrant and packed with herbs and spices. Sticky rice is a staple and you will see the residents eating it by hand and dipping it into various sauces.Today we enjoy a scenic Tuk Tuk ride through the incredible scenery and out to see local villages and rice paddies. Make sure to bring a swimming costume as we will also visit the Blue Lagoon where you can take a dip. Lush jungle, hanging trees and crystal blue waters make this hot spot a fun and beautiful place to swim and relax.The rest of the day is free to further explore and relax. A great option is to hire a bike and explore the surrounding area further. Thanks to the nature that surrounds it Vang Vieng is the perfect place for a host of outdoor activities and you could tube down the river, kayak or explore the nearby caves. Simply walking through the rice paddies is a great way to experience the calm nature of the area and be sure to look out for giant snails, dragonflies and frogs!Enjoying more of the calming scenery in Laos we make our way to Luang Prubang on a four hour local bus journey. Many say that Luang Prabang is the most memorable town in all of Laos. Renowned for a fascinating history and its many temples, Luang Prabang refers to the holy Pra Bang, Laos' most sacred image of the Buddha given to Fa Ngoum.As you explore you will see that Luang Prabang is dominated by Phousi - the marvellous hill-top temple that sits in the middle of the town. A popular highlight of any visit to Luang Prabang is to visit Wat Tham Phousi located on a small 'mountain' in the town's centre offering breathtaking views of the town and surrounding area. You'll notice a combination of Lao, French and Lao-French colonial influence as you admire the city's buildings and architectural highlights - all of which you can see discovering the town on foot.We awake early to visit the monks at sunrise who collect alms that are donated by the locals. This is a very memorable experience and gives great insight into the local traditions and way of life of the Laos people, which dates back centuries. The practise is done early since monks cannot eat after midday.The rest of the day is free to enjoy the sites. Head to the beautiful cascading Kuang Si Falls, a multi level waterfall with the green and blue waters flowing into each other. The area is perfect for a relaxing dip and is well maintained with walkways and bridges.You could also explore Luang Prubang's best known Buddhist temple, Wat Xieng Thong, which dates back to the 1500's.We return to Thailand and the head to the Rose of the North otherwise known as Chiang Mai. A vibrant and bustling city, Chiang Mai is renowned for its temples and unique old city. Founded in 1296, it was the capital of the ancient Lanna Kingdom until 1558. The city is a wonderful blend of old and new, with plenty of temples to be seen. The surrounding mountainous landscape makes for the perfect backdrop, and there are also some lovely gardens and parks to relax in. Chiang Mai is also the largest city in northern Thailand and provides a lovely contrast to Bangkok.We arrive early evening in time to explore the local area and enjoy some Thai cuisine. Chiang Mai has a mouth watering food scene with plenty on offer for everyone.Today is free to enjoy the city and its host of activities. Learn the secrets of Thai cuisine on a cooking course, indulge in a relaxing massage in some of the best spas in the country or take in a night time Muay Thai match. Chiang Mai is also home to a dazzling night bazaar where you can sample street food and browse the large selection of crafts, clothing and art.Northern Thailand is famous for having amazing food and there will be plenty local delicacies to sample. Try the Khao Soi, a coconut and curry soup filled with egg noodles and topped with crispy noodles.A highlight of Chiang Mai is to visit Doi Suthep, located about 12 km outside the city that has fantastic views of the surrounding area. The mountain is also home to a 13th century temple and replica of the Emerald Buddha.Take a stroll down San Kamphaeng Road, also known as the Handicraft Highway due its pottery, wood carving and silk products. This area is also well known for selling Celadon, a type of pottery that has a green glaze making it look almost like jade. Some of the finest silversmiths in Thailand also sell their work here, so keep an eye out for some unique jewellery.Welcome to Sukhothai, Thailand's ancient capital. A popular highlight of Thailand, it was the capital of the Thai empire for approximately 140 years and translates literally to “Dawn of Happiness”.Having been carefully restored, the ancient temples and monuments now cover an area of 70 square kilometres and are an important part of Thailand's proud history.Today we spend the morning exploring the ancient historical park in the best way possible, by bicycle. Leaving after breakfast when it's cooler your tour leader will take you into the park to enjoy the splendour of the ancient ruins and maybe stop for an ice-cream on route. The bicycles are yours to enjoy for the day or you could return at lunchtime to enjoy a leisurely afternoon and maybe grab an authentic Pad Thai followed by a nice relaxing Thai foot massage.This morning we hop on a local train and head for Bangkok which is your final destination on tour.One of the biggest highlights of the city and a must see is the opulent Grand Palace, which was built in 1782 and was home of the Thai King for over 150 years. The palace complex has several impressive buildings such as the Temple of the Emerald Buddha. Just walking around this vast area will give you an idea of the spectacular Thai architecture and vibrant colours. Another must see is the temple of Wat Pho, which houses the impressive reclining Buddha. The position of the Buddha represents entry into Nirvana and the end of reincarnations and is an important symbol for Thai people.Perhaps spend time soaking up the culture and art scene in one of the many museums dotted around the city. For history buffs, you could easily spend hours soaking up the information in the National Museum, which was Thailand's only museum until the mid 1970?s and has a large and very impressive collection. The Bangkok Art and Culture Centre is a work of art in itself, and you can explore the exhibits which range from photographs to paintings. The Tonson Gallery is excellent for those interested in contemporary art, while the Baan Kamthieng House Museum is perfect for learning more about rural life in Thailand.For some of the most impressive city skylines, Bangkok has a huge host of rooftop bars waiting to be enjoyed. For some luxury, head to the ones located in Sukhumvit. You can also enjoy city views by walking to the top of Phu Khao Thong, or The Golden Mountain. The area is a small jungle oasis in the centre of Bangkok and perfect if you need away from the hustle and bustle of the city.This morning we enjoy a short riverboat trip experiencing a different perspective of the Bangkok skyline. We disembark at Wat Pho and visit the famous reclining Buddha.If you have booked post tour accommodation, tomorrow you can also visit the famous Chatuchak Weekend Market, Bangkok's largest market which is also said to be the largest in the world. There are over 15,000 stalls offering anything and everything that you could dream of. Mingle with the locals and immerse yourself in the bustle of vendors and shoppers going about their daily lives.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}