{"title": "Cambodia & Vietnam Highlights", "link": "https://www.tucantravel.com/tour/cambodia-and-vietnam-highlights/iccv/", "dates": {"2020-04-04": "USD 230.00", "2020-04-18": "USD 230.00", "2020-05-02": "USD 230.00", "2020-05-16": "USD 230.00", "2020-05-30": "USD 230.00", "2020-06-13": "USD 230.00", "2020-06-27": "USD 230.00", "2020-07-11": "USD 230.00", "2020-07-25": "USD 230.00", "2020-08-08": "USD 230.00", "2020-08-22": "USD 230.00", "2020-09-05": "USD 230.00", "2020-09-19": "USD 230.00", "2020-10-03": "USD 230.00", "2020-10-17": "USD 230.00", "2020-10-31": "USD 230.00", "2020-11-14": "USD 230.00", "2020-11-28": "USD 230.00", "2020-12-12": "USD 230.00", "2020-12-26": "USD 230.00", "2021-01-09": "USD 250.00", "2021-01-23": "USD 250.00", "2021-02-06": "USD 250.00", "2021-02-20": "USD 250.00", "2021-03-06": "USD 250.00", "2021-03-20": "USD 250.00", "2021-04-03": "USD 250.00", "2021-04-17": "USD 250.00", "2021-05-01": "USD 250.00", "2021-05-15": "USD 250.00", "2021-05-29": "USD 250.00", "2021-06-12": "USD 250.00", "2021-06-26": "USD 250.00", "2021-07-10": "USD 250.00", "2021-07-24": "USD 250.00", "2021-08-07": "USD 250.00", "2021-08-21": "USD 250.00", "2021-09-04": "USD 250.00", "2021-09-18": "USD 250.00", "2021-10-02": "USD 250.00", "2021-10-16": "USD 250.00", "2021-10-30": "USD 250.00", "2021-11-13": "USD 250.00", "2021-11-27": "USD 250.00", "2021-12-11": "USD 250.00", "2021-12-25": "USD 250.00"}, "days": "15", "description": "S We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Bangkok and the start of your South East Asian adventure. This loud, vibrant and tantalizing city is the centre of economics in Thailand and is seen as the gateway to South East Asia for most travellers.Today you are free to arrive at your leisure and enjoy the various activities in the city. We highly recommend booking pre tour accommodation to maximise your time here.One of the biggest highlights of the city and a must see is the opulent Grand Palace, which was built in 1782 and was home of the Thai King for over 150 years. The palace complex has several impressive buildings such as the Temple of the Emerald Buddha. Just walking around this vast area will give you an idea of the spectacular Thai architecture and vibrant colours. Another must see is the temple of Wat Pho, which houses the impressive reclining Buddha. The position of the Buddha represents entry into Nirvana and the end of reincarnations and is an important symbol for Thai people.Today you can also visit the famous Chatuchak Weekend Market, Bangkok's largest market which is also said to be the largest in the world. There are over 15,000 stalls offering anything and everything that you could dream of. Mingle with the locals and immerse yourself in the bustle of vendors and shoppers going about their daily lives.Tonight you will have a pre departure meeting to meet your tour leader and group. Please check reception for details and timings.Today we travel overland into Cambodia and the small but vibrant and historically important city of Siem Reap. Not only is Siem Reap the gateway to the ancient temples of Angkor Thom and Angkor Wat (of Lara Croft movie fame!), but it's also a modern travellers Nirvana, with culinary delights ranging from tasty and downright unusual street food to mouth-watering high-end restaurants.This evening the group will head out to the famous Pub street with the tour leader to sample a local beer or to catch a local apsara dance show.Approximate Travel Times: 8 hours on a tourist bus (including a 1 hour stop at the border for immigration. This stop may be shorter or longer depending on the day)Today you are free to explore Angkor Wat, the most famous temple in Cambodia. There are over one thousand temples here which attract over one million visitors annually. The temples range from small ruins to the famous Angkor Wat, and the site is said to be the world's largest single religious monument.Angkor Wat, a UNESCO world heritage site, pays homage to the Hindu god Vishnu and has a dazzling array of beautiful ornate carvings. The many ceremonial structures and temples here were built between the 9th and 13th centuries by the Khmer Empire that spanned a period of approximately 600 years. These temples are some of the most famous in the world and take up an area of approximately 160 square kilometres.You can either make your own way by tuk tuk to the close-by Archaeological Park, or your tour leader can arrange a group tour with an experienced and knowledgeable guide. A good option is to wake early to enjoy the sunrise with the wonderful photo opportunities, Capture the sunrise reflection of Angkor Wat in the surrounding lakes and ponds or the less busy but no less spectacular views from atop Angkor Hill, looking down into the Angkor complex through the early morning haze.Please Note Entrance to Angkor Wat is not included on the tour.Phnom Penh is Cambodia's bustling capital city with a turbulent past. Sitting on the juncture of the Mekong River and the Tonle Sap river, Phnom Penh has been the national capital since the French colonised Cambodia during the 19th century. The city has grown from a small fishing village to what is now the industrial, commercial, cultural and historical centre of Cambodia.During our time in Phnom Penh we visit the Tuol Sleng Genocide Museum, a former school which was transformed into one of the Khmer Rouge’s most feared prison and torture camps during the Pol Pot regime. The building is now a haunting tribute to the thousands who died here and at the other 150 similar camps throughout the country in the late 1970’s. Those who were detained at the camp were later taken and executed at the Choueng Ek extermination Centre, more commonly known as ‘The Killing Fields', a site we also visit to learn more of and try to understand this wonderful country’s  turbulent past.Whilst the aforementioned visits are included in the tour they are also entirely optional should anybody prefer not to visit and  Phnom Penh has a lot more to offer  including the Russian Market and National Museum. Or you could also take a stroll along the river's famous Sisowath Quay and enjoy a coffee or cocktail at one of the many cafes while observing the bustling river traffic. Our Tour Leaders particularly recommend the Foreign Correspondents Club or F.C.C. as it’s better known. You may wish to take a tuk-tuk ride around Phnom Penh (a tuk-tuk is a motorbike-taxi with an enclosed passenger cabin that can fit around 4 people).Today is a free day to continue exploring the bustling capital of Phnom Penh. Make sure to check out some of the top highlights, including the Royal Palace and the Silver Pagoda temple.Today we travel South along the Mighty Mekong River by boat with our final destination being Vietnam and the border town of Chau Doc , the gateway to the Mekong Delta.In Chau Doc you can enjoy your first authentic Vietnamese meal and a stroll along the Mekong River before retiring for the night and a brief, yet welcome respite from the hustle and bustle of South East Asian city life.Continuing our journey today through the Mekong Delta, we head into the incredible city of Ho Chi Minh City, formerly known as Saigon, Vietnam's largest city and former capital of South Vietnam.Still known as Saigon to many locals, Ho Chi Minh is a large city and with much to do. We head into our hotel in the Old Quarter to be located right in the middle of the action.The bustling city of Ho Chi Minh is the former capital of South Vietnam and formerly known as Saigon until the end of the Vietnam War (around 1975) and the infamous ‘Fall of Saigon” when the city was renamed after North Vietnam’s illustrious and revered leader Ho Chi Minh. Originally a small fishing village, it is now the most important economic centre in Vietnam and is the largest city in the country.We start our exploration of this captivating city with a local walking tour where we will visit Ben Thanh Market, Opera House, Notre Dame Cathedral & Post Office, Independence Palace and the War Remnants Museum.In Hoi An we have free time to explore the handicrafts, ceramics and fabrics that are sold at an abundance of markets. Hoi An is renowned for tailoring; pack your favourite item of clothing and get it copied here! We also enjoy a bike ride to Hoi an Beach passing lush paddy fields along the way. Once you're there you can marvel at coastal views with a local beer in handOur second day in Hoi An offers the opportunity to explore further into the old town. Maybe get that final fitting if you ordered some tailor made clothes or take a Vietnamese cookery class. Or you could just spend the day enjoying some of the wonderful experiences Hoi An offers, including the Japanese Bridge, My Son ancient ruins, Central Market or one of the many museums and temples.This morning we get picked up and driven to Da Nang's Marble Mountains which are made out of limestone and marble. Following this we drive towards Vietnam's ancient Capital City, Hue. On route we will also stop to enjoy the spectacular views from the Hai Van Pass, the longest and highest mountain pass road in Vietnam. Upon reaching the Imperial City, we will tour the forbidden citadel which was only for the emperors and those closest to them, with severe punishments if you were caught trespassing. Time permitting, you can also take a trip down the Perfume River to visit the tombs of Vietnam's ancient Emperors.A short flight takes us to colourful Hanoi.Hanoi offers a beguiling combination of tranquillity and chaos, from the elegance of its crumbling colonial architecture and tree-lined boulevards, to the boisterous cacophony of street vendors and motorcycles. Much can be absorbed of daily life by wandering the streets of the old quarter, tasting local market food, and people-watching. For the culture buffs there are museums, temples and tombs which offer insight into a city rich in history and character.Our morning begins with a visit to the historical center of Hanoi to walk around the relaxing scenery of Hoan Kiem Lake where you can watch the early morning aerobics and enjoy a local speciality of 'egg coffee'. Legend has it that a magical sword was sent to Emperor Ly Thai which was used to drive the Chinese from Vietnam. The sword was later taken from the Emperor by a golden turtle who dissapeared into the depths of the lake with it, and that's where it gets its name from 'Lake of the restored sword'.After our morning at the lake, you have the opportunity to travel out to and visit the world famous Halong Bay on either an optional day or overnight excursion. The bay includes hundreds of islands with towering limestone karsts draped in verdant foliage and is a classified UNESCO World Heritage site.Today is free to enjoy as you please. Discover Ho Chi Minh's Mausoleum, the Presidential Palace, the Stilt House and the famous 1-Pillar Pagoda. You can also visit “coffee street” in the old quarter for a ca phe sua da (a milky iced coffee) for a caffeine fix, grab some hearty bowls of Pho from the street vendors selling delicious Vietnamese street food or cross the red Huc Bridge to visit Jade Island where the Ngoc Son Temple (Temple of Jade Mountain) stands.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}