{"title": "Laos Highlights", "link": "https://www.tucantravel.com/tour/laos-highlights/iclh/", "dates": {"2020-07-12": "USD 110.00", "2020-08-09": "USD 110.00", "2020-09-06": "USD 110.00", "2020-10-04": "USD 110.00", "2020-11-01": "USD 110.00", "2020-11-29": "USD 110.00", "2020-12-27": "USD 110.00", "2021-01-24": "USD 120.00", "2021-02-21": "USD 120.00", "2021-03-21": "USD 120.00", "2021-04-18": "USD 120.00", "2021-05-16": "USD 120.00", "2021-06-13": "USD 120.00", "2021-07-11": "USD 120.00", "2021-08-08": "USD 120.00", "2021-09-05": "USD 120.00", "2021-10-03": "USD 120.00", "2021-10-31": "USD 120.00", "2021-11-28": "USD 120.00", "2021-12-26": "USD 120.00"}, "days": "7", "description": "I We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Vientiane and the start of your adventure. Laos is the landlocked gem of South East Asia, boasting a much more quiet and calming nature than that of it's rowdy neighbours. In fact before 1970, the city of Vientiane only had one set of traffic lights.The city has a lot of French infusion, after the French rule between 1893 and 1946. From the colonial architecture to the wine and coffee, there are plenty of French legacies around the city.You are free to arrive at your leisure today and start enjoying the city.Please note there will be a pre departure meeting tonight to meet your tour leader and group. After the meeting you will enjoy a fun evening 10-pin bowling with your new fellow travellers and tour leader.Today we visit the COPE centre in Vientiane, one of the most important museums and therapy centres in the country. As well as a learning centre, it acts as a therapy unit to offer support to those affected by the UXO (unexploded ordnance). During the Vietnam War, over 2 billion tonnes of bombs were dropped in Laos, many being left unexploded in the ground. Laos is historically the most bombed country in the world, and over the years the country has seen many casualties due to these unexploded devices.During your free time in the city you could check out the Laos Textile Museum, or explore the many Buddhist temples dotted around.This morning we travel to Vang Vieng passing some stunning scenery on route. The landscape here is just as impressive as the final destination and you will witness scenes of village life on the way. The serene town of Vang Vieng is situated on a plateau surrounded by mystical limestone caves and beautiful waterfalls. The area is inhabited by the Hmong and Yao tribes, and the countryside here offers some of the most beautiful scenery in the country.Indulge in some local cuisine and explore the markets which are filled with fruits and handcrafted textiles. The food in Laos is colourful, vibrant and packed with herbs and spices. Sticky rice is a staple and you will see the residents eating it by hand and dipping it into various sauces.Today we enjoy a scenic Tuk Tuk ride through the incredible scenery and out to see local villages and rice paddies. Make sure to bring a swimming costume as we will also visit the Blue Lagoon where you can take a dip. Lush jungle, hanging trees and crystal blue waters make this hot spot a fun and beautiful place to swim and relax.The rest of the day is free to further explore and relax. A great option is to hire a bike and explore the surrounding area further. Thanks to the nature that surrounds it Vang Vieng is the perfect place for a host of outdoor activities and you could tube down the river, kayak or explore the nearby caves. Simply walking through the rice paddies is a great way to experience the calm nature of the area and be sure to look out for giant snails, dragonflies and frogs!Enjoying more of the calming scenery in Laos we make our way to Luang Prubang on a four hour local bus journey. Many say that Luang Prabang is the most memorable town in all of Laos. Renowned for a fascinating history and its many temples, Luang Prabang refers to the holy Pra Bang, Laos' most sacred image of the Buddha given to Fa Ngoum.As you explore you will see that Luang Prabang is dominated by Phousi - the marvellous hill-top temple that sits in the middle of the town. A popular highlight of any visit to Luang Prabang is to visit Wat Tham Phousi located on a small 'mountain' in the town's centre offering breathtaking views of the town and surrounding area. You'll notice a combination of Lao, French and Lao-French colonial influence as you admire the city's buildings and architectural highlights - all of which you can see discovering the town on foot.We awake early to visit the monks at sunrise who collect alms that are donated by the locals. This is a very memorable experience and gives great insight into the local traditions and way of life of the Laos people, which dates back centuries. The practise is done early since monks cannot eat after midday.The rest of the day is free to enjoy the sites. Head to the beautiful cascading Kuang Si Falls, a multi level waterfall with the green and blue waters flowing into each other. The area is perfect for a relaxing dip and is well maintained with walkways and bridges.You could also explore Luang Prubang's best known Buddhist temple, Wat Xieng Thong, which dates back to the 1500's.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/laos_127/laos_golden_pagoda_20161111_1290796062.jpg", "countries": "Laos"}