{"title": "Laos & Thailand Highlights", "link": "https://www.tucantravel.com/tour/laos-and-thailand-highlights/iclt/", "dates": {"2020-07-11": "USD 230.00", "2020-08-08": "USD 230.00", "2020-09-05": "USD 230.00", "2020-10-03": "USD 230.00", "2020-10-31": "USD 230.00", "2020-11-28": "USD 230.00", "2020-12-26": "USD 230.00", "2021-01-23": "USD 250.00", "2021-02-20": "USD 250.00", "2021-03-20": "USD 250.00", "2021-04-17": "USD 250.00", "2021-05-15": "USD 250.00", "2021-06-12": "USD 250.00", "2021-07-10": "USD 250.00", "2021-08-07": "USD 250.00", "2021-09-04": "USD 250.00", "2021-10-02": "USD 250.00", "2021-10-30": "USD 250.00", "2021-11-27": "USD 250.00", "2021-12-25": "USD 250.00"}, "days": "15", "description": "S We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Bangkok and the start of your South East Asian adventure. This loud, vibrant and tantalizing city is the centre of economics in Thailand and is seen as the gateway to South East Asia for most travellers.Today you are free to arrive at your leisure and enjoy the various activities in the city. We highly recommend booking pre tour accommodation to maximise your time here.One of the biggest highlights of the city and a must see is the opulent Grand Palace, which was built in 1782 and was home of the Thai King for over 150 years. The palace complex has several impressive buildings such as the Temple of the Emerald Buddha. Just walking around this vast area will give you an idea of the spectacular Thai architecture and vibrant colours. Another must see is the temple of Wat Pho, which houses the impressive reclining Buddha. The position of the Buddha represents entry into Nirvana and the end of reincarnations and is an important symbol for Thai people.Today you can also visit the famous Chatuchak Weekend Market, Bangkok's largest market which is also said to be the largest in the world. There are over 15,000 stalls offering anything and everything that you could dream of. Mingle with the locals and immerse yourself in the bustle of vendors and shoppers going about their daily lives.Tonight you will have a pre departure meeting to meet your tour leader and group. Please check reception for details and timings.Laos is the landlocked gem of South East Asia, boasting a much more quiet and calming nature than that of it's rowdy neighbours. In fact before 1970, the city of Vientiane only had one set of traffic lights. Today we leave Bangkok for this charming city where we will spend two nights.The city of Vientiane has a lot of French infusion, after the French rule between 1893 and 1946. From the colonial architecture to the wine and coffee, there are plenty of French legacies around the city. Enjoy some free time to wander around and take in the sites. This evening we will meet up again for 10-pin bowling with our tour leader and those who are joining the tour here in Vientiane.Please note that your flight today from Bangkok to Vientiane in Laos may be unaccompanied by a Tucan Travel tour leader. If this is the case, all flights and airport transfers will be provided and your new tour leader will arrange to meet you at the Vientiane hotel.Today we visit the COPE centre in Vientiane, one of the most important museums and therapy centres in the country. As well as a learning centre, it acts as a therapy unit to offer support to those affected by the UXO (unexploded ordnance). During the Vietnam War, over 2 billion tonnes of bombs were dropped in Laos, many being left unexploded in the ground. Laos is historically the most bombed country in the world, and over the years the country has seen many casualties due to these unexploded devices.During your free time in the city you could check out the Laos Textile Museum, or explore the many Buddhist temples dotted around.This morning we travel to Vang Vieng passing some stunning scenery on route. The landscape here is just as impressive as the final destination and you will witness scenes of village life on the way. The serene town of Vang Vieng is situated on a plateau surrounded by mystical limestone caves and beautiful waterfalls. The area is inhabited by the Hmong and Yao tribes, and the countryside here offers some of the most beautiful scenery in the country.Indulge in some local cuisine and explore the markets which are filled with fruits and handcrafted textiles. The food in Laos is colourful, vibrant and packed with herbs and spices. Sticky rice is a staple and you will see the residents eating it by hand and dipping it into various sauces.Today we enjoy a scenic Tuk Tuk ride through the incredible scenery and out to see local villages and rice paddies. Make sure to bring a swimming costume as we will also visit the Blue Lagoon where you can take a dip. Lush jungle, hanging trees and crystal blue waters make this hot spot a fun and beautiful place to swim and relax.The rest of the day is free to further explore and relax. A great option is to hire a bike and explore the surrounding area further. Thanks to the nature that surrounds it Vang Vieng is the perfect place for a host of outdoor activities and you could tube down the river, kayak or explore the nearby caves. Simply walking through the rice paddies is a great way to experience the calm nature of the area and be sure to look out for giant snails, dragonflies and frogs!Enjoying more of the calming scenery in Laos we make our way to Luang Prubang on a four hour local bus journey. Many say that Luang Prabang is the most memorable town in all of Laos. Renowned for a fascinating history and its many temples, Luang Prabang refers to the holy Pra Bang, Laos' most sacred image of the Buddha given to Fa Ngoum.As you explore you will see that Luang Prabang is dominated by Phousi - the marvellous hill-top temple that sits in the middle of the town. A popular highlight of any visit to Luang Prabang is to visit Wat Tham Phousi located on a small 'mountain' in the town's centre offering breathtaking views of the town and surrounding area. You'll notice a combination of Lao, French and Lao-French colonial influence as you admire the city's buildings and architectural highlights - all of which you can see discovering the town on foot.We awake early to visit the monks at sunrise who collect alms that are donated by the locals. This is a very memorable experience and gives great insight into the local traditions and way of life of the Laos people, which dates back centuries. The practise is done early since monks cannot eat after midday.The rest of the day is free to enjoy the sites. Head to the beautiful cascading Kuang Si Falls, a multi level waterfall with the green and blue waters flowing into each other. The area is perfect for a relaxing dip and is well maintained with walkways and bridges.You could also explore Luang Prubang's best known Buddhist temple, Wat Xieng Thong, which dates back to the 1500's.We return to Thailand and the head to the Rose of the North otherwise known as Chiang Mai. A vibrant and bustling city, Chiang Mai is renowned for its temples and unique old city. Founded in 1296, it was the capital of the ancient Lanna Kingdom until 1558. The city is a wonderful blend of old and new, with plenty of temples to be seen. The surrounding mountainous landscape makes for the perfect backdrop, and there are also some lovely gardens and parks to relax in. Chiang Mai is also the largest city in northern Thailand and provides a lovely contrast to Bangkok.We arrive early evening in time to explore the local area and enjoy some Thai cuisine. Chiang Mai has a mouth watering food scene with plenty on offer for everyone.Today is free to enjoy the city and its host of activities. Learn the secrets of Thai cuisine on a cooking course, indulge in a relaxing massage in some of the best spas in the country or take in a night time Muay Thai match. Chiang Mai is also home to a dazzling night bazaar where you can sample street food and browse the large selection of crafts, clothing and art.Northern Thailand is famous for having amazing food and there will be plenty local delicacies to sample. Try the Khao Soi, a coconut and curry soup filled with egg noodles and topped with crispy noodles.A highlight of Chiang Mai is to visit Doi Suthep, located about 12 km outside the city that has fantastic views of the surrounding area. The mountain is also home to a 13th century temple and replica of the Emerald Buddha.Take a stroll down San Kamphaeng Road, also known as the Handicraft Highway due its pottery, wood carving and silk products. This area is also well known for selling Celadon, a type of pottery that has a green glaze making it look almost like jade. Some of the finest silversmiths in Thailand also sell their work here, so keep an eye out for some unique jewellery.This morning we travel to our next destination, the ancient and golden city of Sukhothai.A UNESCO World Heritage City, Sukhothai is home to various temples and other historical sites. The Sukhothai Kingdom, which ruled from around the 12th to the 14th century, is known as the birthplace is Thai civilisation, and where Thai art and language have their origins.Tomorrow we will enjoy a bike tour of the Historical Park and it's sites, so the rest of today gives the perfect opportunity to relax and perhaps sample some of the food on offer. Check out the markets and try one of the beloved dishes, such as the Sukhothai noodles, a style of rice noodle soup which is popular in the area.Sukhothai is a wonderful place to soak up Thai history and tradition, and today we do just that in the Historical Park. It has over 200 ancient sites to be explored, including temples, ruins, statues and other religious symbols. We depart just after breakfast while the weather is still cooler, with the opportunity to stop for ice cream on route.A must see in the park is the Wat Si Chum, which is home to what is said to be Thailand's most beautiful Buddha statues. Wat Saphan Hin, due its elevated position, offers views of the surrounding area and the 11 meter tall Buddha found here was once a favourite spot for royalty to worship.This morning we hop on a local train and head for Bangkok. Bangkok has a host of fascinating sights waiting to be explored. If you haven't already check out the Golden Mountain, Wat Arun temple and the many markets nestled within the city.You could take your own street food walking tour, enjoying delicacies from the many vendors dotted around the city. Foods to look out for include green papaya salad, Thai fried rice, Pad thai and pork skewers. You could even take a Thai cookery course and learn more about the secrets behind these mouth watering foods.This morning we enjoy a short riverboat trip experiencing a different perspective of the Bangkok skyline. We disembark at Wat Pho and visit the famous reclining Buddha.If you have booked post tour accommodation, tomorrow you can also visit the famous Chatuchak Weekend Market, Bangkok's largest market which is also said to be the largest in the world. There are over 15,000 stalls offering anything and everything that you could dream of. Mingle with the locals and immerse yourself in the bustle of vendors and shoppers going about their daily lives.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/laos_127/laos_golden_pagoda_20161111_1290796062.jpg", "countries": "Laos, Thailand"}