{"title": "Thailand in Two Weeks", "link": "https://www.tucantravel.com/tour/thailand-in-two-weeks/ict2/", "dates": {"2020-07-19": "USD 170.00", "2020-08-16": "USD 170.00", "2020-09-13": "USD 170.00", "2020-10-11": "USD 170.00", "2020-11-08": "USD 170.00", "2020-12-06": "USD 170.00", "2021-01-03": "USD 180.00", "2021-01-31": "USD 180.00", "2021-02-28": "USD 180.00", "2021-03-28": "USD 180.00", "2021-04-25": "USD 180.00", "2021-05-23": "USD 180.00", "2021-06-20": "USD 180.00", "2021-07-18": "USD 180.00", "2021-08-15": "USD 180.00", "2021-09-12": "USD 180.00", "2021-10-10": "USD 180.00", "2021-11-07": "USD 180.00", "2021-12-05": "USD 180.00"}, "days": "13", "description": "G We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Thailand and the Rose of the North otherwise known as Chiang Mai. A vibrant and bustling city, Chiang Mai is renowned for its temples and unique old city.You are free to arrive at your leisure and start exploring this wonderful city. Visit Doi Suthep, located about 12 km outside the city that has fantastic views of the surrounding area. The mountain is also home to a 13th century temple and replica of the Emerald Buddha.Take a stroll down San Kamphaeng Road, also known as the Handicraft Highway due its pottery, wood carving and silk products. This area is also well known for selling Celadon, a type of pottery that has a green glaze making it look almost like jade. Some of the finest silversmiths in Thailand also sell their work here, so keep an eye out for some unique jewellery.Tonight you will have a pre departure meeting at 6pm to meet your tour leader and group.Today is free to enjoy the city and its host of activities. Learn the secrets of Thai cuisine on a cooking course, indulge in a relaxing massage in some of the best spas in the country or take in a night time Muay Thai match. Chiang Mai is also home to a dazzling night bazaar where you can sample street food and browse the large selection of crafts, clothing and art.Northern Thailand is famous for having amazing food and there will be plenty local delicacies to sample. Try the Khao Soi, a coconut and curry soup filled with egg noodles and topped with crispy noodles.This morning we travel to our next destination, the ancient and golden city of Sukhothai.A UNESCO World Heritage City, Sukhothai is home to various temples and other historical sites. The Sukhothai Kingdom, which ruled from around the 12th to the 14th century, is known as the birthplace is Thai civilisation, and where Thai art and language have their origins.Tomorrow we will enjoy a bike tour of the Historical Park and it's sites, so the rest of today gives the perfect opportunity to relax and perhaps sample some of the food on offer. Check out the markets and try one of the beloved dishes, such as the Sukhothai noodles, a style of rice noodle soup which is popular in the area.Sukhothai is a wonderful place to soak up Thai history and tradition, and today we do just that in the Historical Park. It has over 200 ancient sites to be explored, including temples, ruins, statues and other religious symbols. We depart just after breakfast while the weather is still cooler, with the opportunity to stop for ice cream on route.A must see in the park is the Wat Si Chum, which is home to what is said to be Thailand's most beautiful Buddha statues. Wat Saphan Hin, due its elevated position, offers views of the surrounding area and the 11 meter tall Buddha found here was once a favourite spot for royalty to worship.This morning we hop on a local train and head for Bangkok. The following four days are free in Bangkok to soak up the city, take a day trip or two or simply relax and recharge before the next section of your trip!You could take your own street food walking tour, enjoying delicacies from the many vendors dotted around the city. Foods to look out for include green papaya salad, Thai fried rice, Pad thai and pork skewers. You could even take a Thai cookery course and learn more about the secrets behind these mouth watering foods.For an interesting day out of the city you could check out Ayutthaya, located 80 kilometres north of the city. Full of ancient ruins and history, it was the capital of the Kingdom of Siam. The Buddha head in the tree roots is worth seeing in itself, and you can hire a local tuk tuk to take you around all the sites.For some of the most impressive city skylines, Bangkok has a huge host of rooftop bars waiting to be enjoyed. For some luxury, head to the ones located in Sukhumvit. You can also enjoy city views by walking to the top of Phu Khao Thong, or The Golden Mountain. The area is a small jungle oasis in the centre of Bangkok and perfect if you need away from the hustle and bustle of the city.Come evening, if you really want to get under the skin of Thai culture then head to a Muay Thai match.Today marks the first day of the weekend and is therefore the perfect opportunity to venture to the famous Chatuchak Weekend Market, Bangkok's largest which is also said to be the largest market in the world. There are over 15,000 stalls offering anything and everything that you could dream of. Mingle with the locals and immerse yourself in the bustle of vendors and shoppers going about their daily lives.This afternoon perhaps spend time soaking up the culture and art scene in one of the many museums dotted around the city. For history buffs, you could easily spend hours soaking up the information in the National Museum, which was Thailand's only museum until the mid 1970?s and has a large and very impressive collection. The Bangkok Art and Culture Centre is a work of art in itself, and you can explore the exhibits which range from photographs to paintings. The Tonson Gallery is excellent for those interested in contemporary art, while the Baan Kamthieng House Museum is perfect for learning more about rural life in Thailand.Please note that unless you have extended your room, check out will be at 11am. Luggage storage is available at the hotel while you head out for the day.This morning we enjoy a short riverboat trip experiencing a different perspective of the Bangkok skyline. We disembark at Wat Pho and visit the famous reclining Buddha.Spend today ticking off any last must do activities in Bangkok. Pick up some last minute souvenirs at the market or wander around Chinatown. If you wish to enjoy an air conditioned shopping experience, check out Terminal 21, located on Sukhumvit Road. This 9 storey shopping mall is designed after an airport terminal with each floor representing a theme of a different country. The ground floor also has a food court, with local and international cuisines. On the top floor you can find a cinema showing both English and Thai movies.In the early evening we will meet our group and tour leader back at the hotel and head to the train station for the overnight train to southern Thailand!Arriving to the train station early in the morning we will then take a minivan towards Khao Sok National Park, driving for a further three hours to reach our hotel. Staying nearby you have the chance to visit the national park and tropical rainforest, which is older than the Amazon Jungle. The area of Khao Sok National Park is an incredible 739 square kilometres, including the 165 square kilometre Cheow Lan Lake. The park is the most biodiverse jungle in Thailand and as well as holding many wild animals has an amazing array of flora and fauna, as well as various bird species. Mammals found in the rainforest include the tapir, Asian elephant, sambar deer, wild boar, white handed gibbons and bears.The landscapes are beautiful, with lush jungle complimented with breath-taking limestone cliffs and hidden waterfalls. It is also home to the rare Rafflesia Kerrii, the world's largest flower. Khao Sok is the only place in Thailand to find it.After an orientation of the surrounding area you are free to explore the park or simply wander around the breathtaking area. While the area is rural and tranquil, there are various restaurants and hotels in the area serving fresh and good quality local food.Spend today enjoying the rainforest and everything on offer in the area. The lake is a popular base for many activities including kayaking, canoeing and bamboo rafting. The views from the water are stunning as you pass limestone cliffs and see various fish swimming below.For those who enjoy hiking there are various paths around the park to follow, many of which lead to beautiful waterfalls. A great way to experience this is to hire a local guide who can talk you through the animals that live in the area and show you the best places to see in the rainforest.Caves in the area, such as Diamond Cave, Khang Cow Cave and Nam Talu Cave, all connect to the lake and can be explored on a boat trip.This morning we leave behind the rainforest for a different type of scenery just as spectacular; the beaches of Phuket. Thailand's largest island, Phuket offers some of the country's most popular beaches and is located close to popular islands including James Bond Island (Khao Phing Kan) or Racha Island (Ko Racha Yai) famed for its diving and snorkelling.We hop on a private minibus and travel for around three hours to reach our hotel in Phuket. The rest of the afternoon is free to start enjoying the sunshine filled beaches and glistening waters. The hardest decision of today will be whether you snorkel or paddle board first!Phuket comes alive at night with various restaurants, bars and live music venues. From all night laser nightclubs to laid back beach bars, there is something for every taste and every budget on the island. The food choices are endless, you could enjoy the fresh seafood on offer or the various small eateries serving up typical Thai dishes. Your tour leader will be able to recommend the best ones.Spend today soaking up the beauty of Phuket and the surrounding islands. Thailand's famed islands have been the set for many films over the years and hold a certain mystique. Take a boat trip and explore as many as your heart desires or snorkel around the bays amongst stunning exotic fish and other marine animals.Of course beaches and islands are not to everyone's taste, so why not visit the historical Old Phuket Town, small enough to stroll around but with an abundance of differing cultural histories. See the Big Buddha, a white, 45 metre tall effigy of Buddha with 360 degree views of the island. Wat Chalong is one of the most significant temples on the island and is beautifully decorated with many shimmering pieces on the pagodas.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/thailand_159/thailand_sukhothai_historical_park_20161111_1363553626.jpg", "countries": "Thailand"}