{"title": "Vietnam, Laos & Thailand Express", "link": "https://www.tucantravel.com/tour/vietnam-laos-and-thailand-express/icvl/", "dates": {"2020-04-11": "USD 340.00", "2020-05-09": "USD 340.00", "2020-06-06": "USD 340.00", "2020-07-04": "USD 340.00", "2020-08-01": "USD 340.00", "2020-08-29": "USD 340.00", "2020-09-26": "USD 340.00", "2020-10-24": "USD 340.00", "2020-11-21": "USD 340.00", "2020-12-19": "USD 340.00", "2021-01-16": "USD 360.00", "2021-02-13": "USD 360.00", "2021-03-13": "USD 360.00", "2021-04-10": "USD 360.00", "2021-05-08": "USD 360.00", "2021-06-05": "USD 360.00", "2021-07-03": "USD 360.00", "2021-07-31": "USD 360.00", "2021-08-28": "USD 360.00", "2021-09-25": "USD 360.00", "2021-10-23": "USD 360.00", "2021-11-20": "USD 360.00", "2021-12-18": "USD 360.00"}, "days": "22", "description": "I We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.The bustling city of Ho Chi Minh is the former capital of South Vietnam. Formerly known as Saigon until the end of the Vietnam War (around 1975) and the infamous ‘Fall of Saigon”,the city was then renamed after North Vietnam’s illustrious and revered leader Ho Chi Minh. Originally a small fishing village, it is now the most important economic centre in Vietnam and is the largest city in the country.Today is free to arrive at your leisure. We recommend arriving early or booking pre tour accommodation to enjoy all Ho Chi Minh city has to offer. Spend hours wandering and haggling in Ben Thanh Market or visit the beautiful Opera House and Notre Dame Cathedral.Learn about the sobering stories of the Vietnam War in the War Remnants Museum, or get a glimpse of the art scene at the City Museum of Fine Arts. There are plenty of lesser known museums dotted around the city, including the South Vietnamese Women Museum which provides interesting insight into the role women played during and after the war.For something a little unique, check out the cafe apartments on Nguyen Hue Walking Street. Originally serving as residence for government officials, the apartments were then sold to local workers after the Fall of Saigon. As tourism developed, tenants began renting out or transforming the tiny apartments into various businesses - cafes, boutiques, tattoo studios and restaurants. What results is a miss match of colours, signs and spaces which make for a wonderful place to explore and grab a local coffee.In Hoi An we have free time to explore the handicrafts, ceramics and fabrics that are sold at an abundance of markets. Hoi An is renowned for tailoring; pack your favourite item of clothing and get it copied here! We also enjoy a bike ride to Hoi an Beach passing lush paddy fields along the way. Once you're there you can marvel at coastal views with a local beer in handOur second day in Hoi An offers the opportunity to explore further into the old town. Maybe get that final fitting if you ordered some tailor made clothes or take a Vietnamese cookery class. Or you could just spend the day enjoying some of the wonderful experiences Hoi An offers, including the Japanese Bridge, My Son ancient ruins, Central Market or one of the many museums and temples.This morning we get picked up and driven to Da Nang's Marble Mountains which are made out of limestone and marble. Following this we drive towards Vietnam's ancient Capital City, Hue. On route we will also stop to enjoy the spectacular views from the Hai Van Pass, the longest and highest mountain pass road in Vietnam. Upon reaching the Imperial City, we will tour the forbidden citadel which was only for the emperors and those closest to them, with severe punishments if you were caught trespassing. Time permitting, you can also take a trip down the Perfume River to visit the tombs of Vietnam's ancient Emperors.A short flight takes us to colourful Hanoi.Hanoi offers a beguiling combination of tranquillity and chaos, from the elegance of its crumbling colonial architecture and tree-lined boulevards, to the boisterous cacophony of street vendors and motorcycles. Much can be absorbed of daily life by wandering the streets of the old quarter, tasting local market food, and people-watching. For the culture buffs there are museums, temples and tombs which offer insight into a city rich in history and character.Our morning begins with a visit to the historical center of Hanoi to walk around the relaxing scenery of Hoan Kiem Lake where you can watch the early morning aerobics and enjoy a local speciality of 'egg coffee'. Legend has it that a magical sword was sent to Emperor Ly Thai which was used to drive the Chinese from Vietnam. The sword was later taken from the Emperor by a golden turtle who dissapeared into the depths of the lake with it, and that's where it gets its name from 'Lake of the restored sword'.After our morning at the lake, you have the opportunity to travel out to and visit the world famous Halong Bay on either an optional day or overnight excursion. The bay includes hundreds of islands with towering limestone karsts draped in verdant foliage and is a classified UNESCO World Heritage site.Today is free to enjoy as you please. Discover Ho Chi Minh's Mausoleum, the Presidential Palace, the Stilt House and the famous 1-Pillar Pagoda. You can also visit “coffee street” in the old quarter for a ca phe sua da (a milky iced coffee) for a caffeine fix, grab some hearty bowls of Pho from the street vendors selling delicious Vietnamese street food or cross the red Huc Bridge to visit Jade Island where the Ngoc Son Temple (Temple of Jade Mountain) stands.Spend the rest of your time in Hanoi freely exploring its historical sites and taking in the atmosphere. For a fun evening activity, we highly recommend checking out the water puppet theatre for a traditional performance!Today we depart Hanoi and Vietnam to catch a flight to Vientiane in Laos. This small and tranquil city is as welcoming as it is diverse. Heavily influenced by Laos' time under French rule, Vientiane offers respite from the bustle and busyness of other Asian capital cities. Whether you prefer to visit the local markets, visit the local temples and Wats or just take time out to people-watch at a local cafe, bar or restaurant along the Mekong River, your short time in Vientiane is sure to create many wonderful memories. In the evening after an optional group meal, your Tour Leader will invite you for a fun evening 10-pin bowling. Not something usually associated with Asia but a popular night out for locals and visitors alike.Please note that your flight today from Hanoi to Vientiane in Laos may be unaccompanied by a tour leader. If this is the case, all flights and airport transfers will be provided and your new tour leader will arrange to meet you at the Vientiane hotel.Laos was a victim during the Vietnam War and is actually the most bombed country in the world. During the fighting 270 million submunitions were dropped on Laos between 1963 to 1974, and many of those failed to explode, with many remaining intact and unexploded in many rural areas to this day.In Vientiane, visit the COPE Centre and learn about the Unexploded Ordnance problem in Laos and how the country is managing the situation. You can also learn more about the work undertaken by COPE to provide disability services for people affected by the bombing at the exhibition as well as spend the rest of the day exploring more of this placid but historical city.This morning we travel to Vang Vieng passing some stunning scenery on route. The landscape here is just as impressive as the final destination and you will witness scenes of village life on the way. The serene town of Vang Vieng is situated on a plateau surrounded by mystical limestone caves and beautiful waterfalls. The area is inhabited by the Hmong and Yao tribes, and the countryside here offers some of the most beautiful scenery in the country.Indulge in some local cuisine and explore the markets which are filled with fruits and handcrafted textiles. The food in Laos is colourful, vibrant and packed with herbs and spices. Sticky rice is a staple and you will see the residents eating it by hand and dipping it into various sauces.Today we enjoy a scenic Tuk Tuk ride through the incredible scenery and out to see local villages and rice paddies. Make sure to bring a swimming costume as we will also visit the Blue Lagoon where you can take a dip. Lush jungle, hanging trees and crystal blue waters make this hot spot a fun and beautiful place to swim and relax.The rest of the day is free to further explore and relax. A great option is to hire a bike and explore the surrounding area further. Thanks to the nature that surrounds it Vang Vieng is the perfect place for a host of outdoor activities and you could tube down the river, kayak or explore the nearby caves. Simply walking through the rice paddies is a great way to experience the calm nature of the area and be sure to look out for giant snails, dragonflies and frogs!Enjoying more of the calming scenery in Laos we make our way to Luang Prubang on a four hour local bus journey. Many say that Luang Prabang is the most memorable town in all of Laos. Renowned for a fascinating history and its many temples, Luang Prabang refers to the holy Pra Bang, Laos' most sacred image of the Buddha given to Fa Ngoum.As you explore you will see that Luang Prabang is dominated by Phousi - the marvellous hill-top temple that sits in the middle of the town. A popular highlight of any visit to Luang Prabang is to visit Wat Tham Phousi located on a small 'mountain' in the town's centre offering breathtaking views of the town and surrounding area. You'll notice a combination of Lao, French and Lao-French colonial influence as you admire the city's buildings and architectural highlights - all of which you can see discovering the town on foot.We awake early to visit the monks at sunrise who collect alms that are donated by the locals. This is a very memorable experience and gives great insight into the local traditions and way of life of the Laos people, which dates back centuries. The practise is done early since monks cannot eat after midday.The rest of the day is free to enjoy the sites. Head to the beautiful cascading Kuang Si Falls, a multi level waterfall with the green and blue waters flowing into each other. The area is perfect for a relaxing dip and is well maintained with walkways and bridges.You could also explore Luang Prubang's best known Buddhist temple, Wat Xieng Thong, which dates back to the 1500's.We return to Thailand and the head to the Rose of the North otherwise known as Chiang Mai. A vibrant and bustling city, Chiang Mai is renowned for its temples and unique old city. Founded in 1296, it was the capital of the ancient Lanna Kingdom until 1558. The city is a wonderful blend of old and new, with plenty of temples to be seen. The surrounding mountainous landscape makes for the perfect backdrop, and there are also some lovely gardens and parks to relax in. Chiang Mai is also the largest city in northern Thailand and provides a lovely contrast to Bangkok.We arrive early evening in time to explore the local area and enjoy some Thai cuisine. Chiang Mai has a mouth watering food scene with plenty on offer for everyone.Today is free to enjoy the city and its host of activities. Learn the secrets of Thai cuisine on a cooking course, indulge in a relaxing massage in some of the best spas in the country or take in a night time Muay Thai match. Chiang Mai is also home to a dazzling night bazaar where you can sample street food and browse the large selection of crafts, clothing and art.Northern Thailand is famous for having amazing food and there will be plenty local delicacies to sample. Try the Khao Soi, a coconut and curry soup filled with egg noodles and topped with crispy noodles.A highlight of Chiang Mai is to visit Doi Suthep, located about 12 km outside the city that has fantastic views of the surrounding area. The mountain is also home to a 13th century temple and replica of the Emerald Buddha.Take a stroll down San Kamphaeng Road, also known as the Handicraft Highway due its pottery, wood carving and silk products. This area is also well known for selling Celadon, a type of pottery that has a green glaze making it look almost like jade. Some of the finest silversmiths in Thailand also sell their work here, so keep an eye out for some unique jewellery.This morning we travel to our next destination, the ancient and golden city of Sukhothai.A UNESCO World Heritage City, Sukhothai is home to various temples and other historical sites. The Sukhothai Kingdom, which ruled from around the 12th to the 14th century, is known as the birthplace is Thai civilisation, and where Thai art and language have their origins.Tomorrow we will enjoy a bike tour of the Historical Park and it's sites, so the rest of today gives the perfect opportunity to relax and perhaps sample some of the food on offer. Check out the markets and try one of the beloved dishes, such as the Sukhothai noodles, a style of rice noodle soup which is popular in the area.Sukhothai is a wonderful place to soak up Thai history and tradition, and today we do just that in the Historical Park. It has over 200 ancient sites to be explored, including temples, ruins, statues and other religious symbols. We depart just after breakfast while the weather is still cooler, with the opportunity to stop for ice cream on route.A must see in the park is the Wat Si Chum, which is home to what is said to be Thailand's most beautiful Buddha statues. Wat Saphan Hin, due its elevated position, offers views of the surrounding area and the 11 meter tall Buddha found here was once a favourite spot for royalty to worship.This morning we hop on a local train and head for Bangkok. The following four days are free in Bangkok to soak up the city, take a day trip or two or simply relax and recharge before the next section of your trip!You could take your own street food walking tour, enjoying delicacies from the many vendors dotted around the city. Foods to look out for include green papaya salad, Thai fried rice, Pad thai and pork skewers. You could even take a Thai cookery course and learn more about the secrets behind these mouth watering foods.This morning we enjoy a short riverboat trip experiencing a different perspective of the Bangkok skyline. We disembark at Wat Pho and visit the famous reclining Buddha.If you have booked post tour accommodation, tomorrow you can also visit the famous Chatuchak Weekend Market, Bangkok's largest market which is also said to be the largest in the world. There are over 15,000 stalls offering anything and everything that you could dream of. Mingle with the locals and immerse yourself in the bustle of vendors and shoppers going about their daily lives.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}