{"title": "India in Depth", "link": "https://www.tucantravel.com/tour/india-in-depth/inid/", "dates": {"2020-07-18": "USD 280.00", "2020-08-29": "USD 280.00", "2020-10-03": "USD 280.00", "2020-11-07": "USD 280.00", "2020-12-19": "USD 280.00", "2021-01-16": "USD 300.00", "2021-02-20": "USD 300.00", "2021-03-27": "USD 300.00", "2021-05-01": "USD 300.00", "2021-06-12": "USD 300.00", "2021-07-24": "USD 300.00", "2021-09-04": "USD 300.00", "2021-10-09": "USD 300.00", "2021-11-13": "USD 300.00", "2021-12-18": "USD 300.00"}, "days": "22", "description": "F We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Delhi is India's bustling capital, political and cultural centre, with a population of almost 13 million and is bound to be a city that keeps you on your toes no matter what time of day it is!Many dynasties have ruled here and they have all left their own legacies in the architecture, culture and monuments. The city has been destroyed and rebuilt seven times in its long history. Distances are long in the city and walking to places can be futile. Take a bike rickshaw or a motorised rickshaw to get around some of the sites. You can visit the Gandhi Memorial Museum or the infamous Red Fort, maybe make your way to Humayun's Tomb in south Delhi, near Hazrat Nizamuddin station, one of Delhi's three UNESCO World Heritage Sites. A popular way to discover Delhi for many people is to take a bicycle rickshaw tour and check out the view from Jama Masjid, the largest mosque in India.Included on your tour is an orientation walk through the Karol Bagh area in Delhi.We visit Bikaner in the north, the home of the impressive Junagarh Fort surrounded by what was once an elaborate moat. Bikaner is also referred to as an 'oasis town'. Here you could visit Lalgarh Palace, which is a red sandstone building surrounded by sand dunes and rocks. Outside of Bikaneer lies one of the most unusual attractions, the Karni Mata Temple, where some 2000 rats reside. The rats are seen as holy and are revered and they protected because it is believed that they have souls of the followers of Karni Mata in them. Thousands of Hindu pilgrims visit the temple every year to pay their respects to Karni Mata and her followers.We venture deep into the desert to Jaisalmer, 'the golden city', where you'll see that there is no shortage of markets, each in fierce competition with each other! Jaisalmer's main attraction is its medieval mud fortress, which is the only fort in the whole of India that still has people living in it today.From Jaisalmer we take an overnight camel safari into the Thar Desert, which is a great way to unwind after experiencing the hustle and bustle of urban Indian life. From here we begin our journey into the photogenic Thar Desert by vehicle. This region is sparsely populated by some of India's most colourful and resourceful people, such as Bhati Rajputs, who are descended from an ancient warrior called Bhatti. We then reach the vast sand dunes where we will begin our overnight camel safari, which will give you the opportunity to experience desert life from a camel's back. Camel breeding is a common practice in this area. You will meet with your village herdsman and the camel which you will ride on the way to the camp. We venture out into the golden sea of sand and will have the chance to see nomadic herders, remote parts of the Thar Desert, rolling sand dunes and desert villages. We will camp under the stars and have a traditional meal cooked for us.The following day we continue our journey back to civilisation. The scenery becomes more fertile and densely populated as we head back Jaisalmer.Busy Jodhpur is Rajasthan's second largest city, dominated by its spectacular Mehrangarh fort. Located in Western Rajasthan you'll see endless golden dunes, camels slowly trekking into the distance and desert landscapes as far as the eye can see.You will have ample free time for sightseeing. If you take the option to visit the Majestic Fort, you will see why Jodphur is known as the 'Blue City'; many houses in the old city are painted blue and you can admire this amazing view from the fort. There are many optional excursions and activities that you can try if you feel like involving yourself with the local culture and tradition, why not try a cooking, art or Hindi class? You can also choose to visit the old city with its stone temples and lively markets. Or take a wander through the new city, which houses several palaces, such as the art-deco Umaid Bhawan Palace, museums, Kaman art gallery for contemporary Indian art, and a small exotic zoo in the gardens of the Government Museum.Set in the Girwa valley, Udaipur 'the city of lakes' is located in southern Rajasthan. It is one of the most popular cities in the region with its placid lakes and green gardens. This is a truly captivating city and as a result it has been dubbed 'the most romantic city in India'. Surrounded by beautiful lakes, marble palaces and stunning gardens, Udaipur will most likely offer a refreshing change to the desert surrounds you have seen so far. It provides an insight into the variety and geographical diversity that characterises India. Udaipur is also home to one of the most luxurious hotels in India, the Lake Palace, which is the former Maharajas Palace in the middle of the lake.Today is a free day. There are plenty of sightseeing options in Udaipur as well, including the City Palace, which is an impressive complex of several palaces.Jaipur is Rajasthan's capital and most visited city, and is a bustling, lively destination. It is known as the 'pink city' because of its pink wash buildings although time has faded some of this colour. Make sure you check out the Old City with its bazaars, palaces and havelis. There's also the popular Nahargarh (Tiger Fort) which is a small fort with towering walls. You may also wish to go on a group visit to Hawa Mahal (Palace of the Winds) which is one of Jaipur's most famous attractions - a five storey high Baroque- like structure built to enable the veiled ladies of the harem to observe the street scenes below, out of sight of the people below.Today there is free time to view the city independently. Try the fresh fruit juices from the street markets (remember to ask for no water or ice!). You could shop for souvenirs and look out for the Meenakaari (enamel work) and Kundankaari (inlay work with gems), which are the two styles of jewellery made by local artisans. Alternatively you could wander around the old city taking in the hustle and bustle of everyday life. Or why not visit the Amber Fort, which used to be the capital of the city.Today you will travel by train to the industrial city of Agra, steeped in history and tradition, and home to the world-famous Taj Mahal. The Taj Mahal never ceases to amaze all who visit to marvel at what is possibly the greatest testimonial to love and romance ever built. It was commissioned between 1631 and 1648 by order of the Mughal emperor Shah Jahan in memory of his favourite wife.There is more to Agra than monuments of love, and other popular attractions include the Agra Fort and Tomb of Itimad-Ud-Daulah. You will have free time in Agra to explore at your leisure or book some optional excursions. Your tour leader will offer suggestions and assist you with these.You have the option to watch the sun set over the Taj Mahal - a truly incredible sight (this will be organised with your tour leader). You might also like to visit Fatehpur Sikri - a complex of monuments and temples, all in a uniform architectural style. Built during the second half of the 16th century by the Emperor Akbar, Fatehpur Sikri (the City of Victory) was the capital of the Mughal Empire for 10 years. The day will be free to explore Agra further and admire some of Hinduism's most holy sights.In Orchha we will visit the Ram Temple as well as enjoying an heritage walk around the city. You can also visit the beautiful Fort. Built by the first King of Orchha in 1501, it was built on the banks of the Betwa River, surrounded by a battlement wall. It consists of intricate temples and a roof with eight domes on top. Along with the fort there are several other temples to enjoy or sit back and relax on the river.Today is a free day in Orchha.Get a feel for local life in the small village of Basari. Here we can enjoy a tour through Basari, discovering the makeshift religious shrines, the smell of incense wafting in the air. Visit a local school (except in school holidays), and discover the caste system that differentiates the houses.A perfect place to get off the beaten track with friendly locals, Basari Village will take you away from the hustle and bustle of the big Indian cities, for an authentic Indian experience.Khajuraho has been growing in popularity in recent years due to the nearby temple. Here exotic architecture has given the temple the nickname of the Kama Sutra temple. You will be able to view the sculptures here, watch the sound and light show in the evening and learn about the story behind the statues.After exploring Khajuraho we board an overnight train to the holy city of Varanasi.Varanasi is one of India's most holy cities and attracts many Hindu pilgrims. We join the crowds along the holy ghats (steps leading down to the water) lining the sacred Ganges where pilgrims take a purifying dip in the river. We also can enjoy an evening boat trip to view the river in all its glory and the significance it plays in the lives of the people. The rest of the day is free to wander through the old city with its maze of narrow alleyways, and visit the temples of one of the oldest and longest inhabited cities in the world.After spending the morning exploring more of Varanasi, we board an overnight train back to Delhi where there's time for some last minute souvenir shopping or to check out any sights you may have missed first time around.Enjoy free time making the most of Delhi before your adventure comes to an end.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/india_121/india_agra_fort_20161111_1283635284.jpg", "countries": "India"}