{"title": "Southern Japan", "link": "https://www.tucantravel.com/tour/southern-japan/jbr/", "dates": {"2020-04-09": "USD 260.00", "2020-04-23": "USD 260.00", "2020-10-16": "USD 260.00", "2020-10-30": "USD 260.00", "2020-11-13": "USD 260.00", "2020-11-27": "USD 260.00", "2020-12-25": "USD 260.00", "2021-01-08": "USD 280.00", "2021-03-26": "USD 280.00", "2021-04-09": "USD 280.00", "2021-04-23": "USD 280.00", "2021-10-15": "USD 280.00", "2021-10-29": "USD 280.00", "2021-11-12": "USD 280.00", "2021-11-26": "USD 280.00", "2021-12-24": "USD 280.00"}, "days": "10", "description": "C We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to the vibrant Imperial Capital of Kyoto. Kyoto was fortunate to be spared in the World War II bombings and has retained literally thousands of ancient shrines, temples and palaces, some dating back centuries.Kyoto is the jewel in the Imperial crown.  It boasts some two thousand mind-blowing temples, shrines, castles and palaces, making it one of the world's most visited cities. Some of these include the Golden & Silver Pavilions, the Kiyomizu Dera, the Ryoan-Ji and Nijo Castle, where the Shoguns used to stay whilst visiting the city.  It is also home to the Imperial Palace that has recently become much easier to visit.  You can also explore the Bamboo Forest and the Fushimi Inari shrine where many movie scenes have been shot, including Memoirs of a Geisha. Close to the city's famous Toji temple is an impressive 57 metre high Buddhist pagoda dating back to 794AD, the year the city was established as the Imperial Capital. Right next door, the monthly Kobo-san flea market offers a bargain hunter's paradise, where you can rummage through a range of items from second hand kimonos to war memorabilia, food and sculptures.If you are interested in Japanese cultural history, you may like to visit the Kamo Shrines, called the Shimogamo Shrine and Kamigamo Shrine, which are both recognised as UNESCO World Heritage Sites and are among the most important in Japan. Predating even the Toji temple, these shrines were traditionally visited by members of the Imperial court, who would worship Shinto gods called Kami, and ask them to protect the city and help it to prosper. The Shimogamo Shrine is surrounded by the Tadasu no Mori forest, which features trees that are up to 600 years old, while the nearby Kamigamo Shrine is known for sand cones at its entrance, which have been built and rebuilt since ancient times to help purify and protect the shrine.We will take a tour of the Geisha District. Keep an eye out for Gion Square where some scenes from the movie 'Memoirs of a Geisha' were filmed. If you haven't read the book it's a great insight into traditional Japanese life and the effects of the war on society. It may also be possible to see a geisha dance performance or tea ceremony demonstration.Today we take a morning train journey to visit one of Japan's most famous architectural wonders, Himeji Castle, which amazingly still remains intact despite the heavy bombing of the nearby town throughout World War II. Known as the 'White Heron' castle because of its brilliant white exterior, the castle features more than 80 buildings, and an intricately designed series of paths within the fortified complex which are designed to confuse any potential invaders. An optional guide can be hired or you are free to explore on foot yourself.We then head to Hiroshima, the first city in history to be hit by an atomic bomb, and as a result is now dedicated to promoting peace. Your tour leader will take you to The Peace Memorial Park which was built to promote a peaceful world. Here you will see where the bomb hit on August 6, 1945 at approximately 8:15 am. You will also have a chance to visit the outstanding but chilling museum with real images, video footage, various surviving objects, and true accounts left by the survivors. The Atomic Bomb Dome is one of the few buildings around the explosion's epicentre that partially survived the blast and the city's only remaining bomb damaged building. The former Industrial Promotion Hall is now an UNESCO World Heritage Site.From Hiroshima we enjoy a day trip to Miyajima, the holiest island in Japan, where you can watch sun setting over the famous floating torii gate, which is the entry place to the Shinto shrine Itsukushima, a UNESCO World Heritage Site. Passing underneath a torii gate on the way to visit a shrine is an act of sanctification and purification. The floating torii can be accessed only when the tide is out. It is common practice for visitors to place coins in the cracks of the legs of the gate and make a wish. As the island is considered a sacred place, the maple trees which cover the island cannot be cut down and deer and monkeys roam freely.This morning we board the train bound for Nagasaki. Nagasaki is an attractive port city on the island of Kyushu and the capital of Nagasaki Prefecture. Nagasaki has played a prominent role in foreign trade relations for many centuries and as a result it became the second city after Hiroshima to be targeted and destroyed by an atomic bomb towards the end of World War II. Your Tour Leader will take you on a tour to the memorial park site which is dedicated to the dark day of August 9, 1945 when the bomb struck and destroyed vast parts of the city, killing tens of thousands of people. There is also a Peace Statue and other memorials such as a black pillar which marks the atomic explosion's epicentre in the nearby Hypocenter Park.Today you are free to explore the area.Back on the train again, we head towards Fukuoka, a large city on the Japanese island of Kyushu. Fukuoka is a major city but it is also boasts a beautiful beach to enjoy. The rest of the day you will be free to explore on foot, or you may wish to rent bicycles.Today we have a day trip to Yufuen, a spa town famed for its natural hot water springs or 'onsens'. This a great place for you to rest in the springs surrounded by a naturally beautiful environment.Today we say Goodbye to Southern Japan and head north, back to the bright lights of Tokyo.  Making use of Japan's incredible high-speed trains one last time, we make the short 5-hour, direct journey into the heart of Tokyo in time to enjoy a final afternoon and a farewell meal to say a fond farewell to the Land of the Rising Sun.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Please note: At the present time we cannot offer post tour accommodation on this tour. Please speak to your Adventure Specialist who will be advise alternative accommodation options if you would like to stay longer in Japan.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}