{
  "title": "Google Trip",
  "link": "https://google.com/",
  "dates": {
    "2020-10-11": "USD 300.00"
  },
  "days": "11",
  "description": "This group tour ranges in size from 4 to 17 people, with an overall average of 10 people.\n\nThis tour is modular and made up of two sections. This means there will be people leaving and joining in Budapest.\n\nThis trip is 29 days long, spending an average of two nights in each location. While you will see a huge amount, it is fast paced and you should consider your fitness levels before booking.\n\nEurope is cobbled streets, winding staircases and lots of walking. You will need a decent fitness level to fully enjoy this trip.\n\nThis trip uses a range of public buses, trains and private vehicles. You will be responsible for carrying your luggage at all times, on and off transport and sometimes up stairs, or along cobbled streets. You MUST ensure you can comfortably carry it, and keep to one piece of luggage and one small bag.\n\nHotel rooms in Europe tend to be much smaller than in America, Canada or Australia. Double beds are sometimes two single beds pushed together.\n\nDepending on your nationality, you may also require a Schengen visa. It is your responsibility to research and arrange this.\n\nThis tour includes a compulsory Local Payment that needs to be paid to the Tour Leader on Day 1 of your tour. For more information on our Local Payments please click here.Welcome to Croatia! Your tour begins with the 'Pearl of the Adriatic', the UNESCO World Heritage listed walled city of Dubrovnik.\n\nWith a paved town centre enclosed in fortress-like 13th century stone walls, the city is easy to explore on foot and is full of character. A great start to your exploration of Dubrovnik could be with a walk around the city walls. Stretching almost 2 kilometres around the old town, the walls offer stunning rooftop and city views out to the turquoise blue Adriatic Sea. Founded in the 7th century, for a time in its glorious past the city was a serious rival for Venice in terms of maritime trade. It is hard to believe now but in 1991, two out of every three buildings were damaged during the bombardment of the Yugoslav War. Since then the buildings and walls have been painstakingly restored to pristine condition and represents one of the most beautiful and solid fortress systems on the Mediterranean. There are several other historic attractions worth a visit near the main street (Stradun), such as the 14th century Franciscan monastery which houses a treasury full of sacred art and artefacts, as well as one of the oldest continually working pharmacies in the world, dating back to 1317.\n\nWith a wealth of cultural and water based activities, Dubrovnik will not fail in keeping you entertained. Try out sea kayaking in the crystal waters, or browse the markets in the Old Town for some Mediterranean delicacies. For some of the most incredible city views, head up the cable car to Mount Srd where you can view the city walls from a different perspective.\n\nYou will start and end your tour in Dubrovnik, so we highly recommend arriving a day or two earlier, or staying extra days at the end of the tour. This way you get to experience all that the city has to offer! If you would like to book pre or post tour accommodation, please contact your Adventure Specialist.",
  "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/japan_123/japan__kinkakuji_temple_20161111_1615004224.jpg",
  "countries": "Spain, Slovakia"
}