{"title": "Japan Highlights", "link": "https://www.tucantravel.com/tour/japan-highlights/jjh/", "dates": {"2020-10-11": "USD 190.00", "2020-10-25": "USD 190.00", "2020-11-08": "USD 190.00", "2020-11-22": "USD 190.00", "2020-12-20": "USD 190.00", "2021-01-03": "USD 200.00", "2021-03-21": "USD 200.00", "2021-04-04": "USD 200.00", "2021-04-18": "USD 200.00", "2021-10-10": "USD 200.00", "2021-10-24": "USD 200.00", "2021-11-07": "USD 200.00", "2021-11-21": "USD 200.00", "2021-12-19": "USD 200.00"}, "days": "7", "description": "F We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.New and old collide in Tokyo, Japan's capital city that never sleeps. As you discover the city you will find there is no actual centre to Tokyo but a collection of impressive districts, all full of attractions. Shinjuku is the main cosmopolitan entertainment quarter for restaurants, shopping and Japans busiest rail station. Here huge plasma screens blast out bright, neon advertisements, while side streets house strip clubs and smoky jazz bars. A quieter option is to spend time in Ueno (Koen) Park where you can visit the Tokyo Zoological Gardens, National Museums, wander among the cherry trees and the see the historical Toshogu Shrine.Your tour leader will assist you in validating your rail pass which you will use on your tour, and then take you on a morning orientation walk via the metro to the Imperial Palace, the Emperor Meiji Shrine and the area of Harajuku, famous for its quirky youth fashion culture.We travel onwards to Odawara a lakeside resort town which offers fabulous views of Mt Fuji (weather permitting). There are other options you can do here such as boat on the lake with a stunning view of Mt Fuji, or take the rope way up the surrounding mountain for an equally impressive view, or take a bus out to Mt Fuji (depending on the time of the season) and although you won't be able to climb, you can still marvel at its presence.Mount Fuji (Fujisan) is Japan's highest mountain at 3776 metres and can be seen from Tokyo and Yokohama on clear days. This dormant volcano, which last erupted in 1708, has long been worshipped as a sacred mountain and has always experienced huge popularity.We take the Shinkansen Bullet train to Nagoya and change to a local train for the beautiful trip up through the Japanese Alps to Takayama.This afternoon you will enjoy an included sake tasting. 'Sake' is brewed using rice, water and white koji mold as the main ingredients.We begin our introduction to the traditional city of Takayama with an exploratory bike ride through the town to familiarise you with the famous sites. Takayama is located in the mountainous Hida region of Gifu Prefecture, which has retained a traditional feel unlike many other Japanese cities, especially in its beautifully preserved Old Town. The southern half of the Old Town, especially the Sannomachi Street, is particularly pretty with many old homes, shops, coffee houses and sake breweries, some of which have been in business for centuries. After our bike ride is over you can lose yourself in the back streets or venture out of town if you're feeling adventurous.Welcome to the vibrant Imperial Capital of Kyoto. Kyoto was fortunate to be spared in the World War II bombings and has retained literally thousands of ancient shrines, temples and palaces, some dating back centuries.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Please note: At the present time we cannot offer post tour accommodation on this tour. Please speak to your Adventure Specialist who will be advise alternative accommodation options if you would like to stay longer in Japan.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/japan_123/japan__kinkakuji_temple_20161111_1615004224.jpg", "countries": "Japan"}