{"title": "Journey to Jordan", "link": "https://www.tucantravel.com/tour/journey-to-jordan/mejj/", "dates": {"2020-07-19": "USD 210.00", "2020-08-23": "USD 210.00", "2020-08-30": "USD 210.00", "2020-09-06": "USD 210.00", "2020-09-13": "USD 210.00", "2020-09-20": "USD 210.00", "2020-09-27": "USD 210.00", "2020-10-04": "USD 210.00", "2020-10-11": "USD 210.00", "2020-10-18": "USD 210.00", "2020-10-25": "USD 210.00", "2020-11-01": "USD 210.00", "2020-11-15": "USD 210.00", "2020-11-29": "USD 210.00", "2020-12-13": "USD 210.00", "2020-12-27": "USD 210.00", "2021-01-10": "USD 220.00", "2021-01-24": "USD 220.00", "2021-02-07": "USD 220.00", "2021-02-21": "USD 220.00", "2021-03-07": "USD 220.00", "2021-03-14": "USD 220.00", "2021-03-21": "USD 220.00", "2021-03-28": "USD 220.00", "2021-04-04": "USD 220.00", "2021-04-11": "USD 220.00", "2021-04-18": "USD 220.00", "2021-04-25": "USD 220.00", "2021-05-02": "USD 220.00", "2021-05-09": "USD 220.00", "2021-05-16": "USD 220.00", "2021-05-23": "USD 220.00", "2021-05-30": "USD 220.00", "2021-06-06": "USD 220.00", "2021-06-20": "USD 220.00", "2021-07-04": "USD 220.00", "2021-08-01": "USD 220.00", "2021-08-29": "USD 220.00", "2021-09-12": "USD 220.00", "2021-09-26": "USD 220.00", "2021-10-03": "USD 220.00", "2021-10-10": "USD 220.00", "2021-10-17": "USD 220.00", "2021-10-24": "USD 220.00", "2021-10-31": "USD 220.00", "2021-11-07": "USD 220.00", "2021-11-14": "USD 220.00", "2021-11-21": "USD 220.00", "2021-11-28": "USD 220.00", "2021-12-05": "USD 220.00", "2021-12-19": "USD 220.00"}, "days": "8", "description": "F We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to the dazzling capital city of Jordan. This modern city also comes with its fair share of history dating back to the 13th Century B.C.The fascinating combination of old and new leaves plenty in the way of exploring. If you are arriving early in the day or have booked pre tour accommodation then we suggest that you make the most of your free time by taking a walk to the Jebel Al Weibdeh area and explore museums, mosques and galleries before perhaps heading to the iconic Citadel. The Citadel sits on the highest hill in Amman and consists of the grand temple of Hercules and the Umayyad Palace. This vantage point offers great views of the city.Please note you will meet your tour leader at breakfast tomorrow morning. Spend this evening relaxing and perhaps enjoy a traditional Jordanian dinner in one of the local restaurants.This morning you will meet your tour leader at breakfast before departing by private vehicle to visit the city of Umm Qais located in the northwest region of Jordan. Once known as the city of Gadara, the ancient Greco-Roman City of Umm Qais&#39; offers panoramic views over the Sea of Galilee, the Golan Heights and the Jordan Valley.  These well preserved ancient ruins will have you feeling like you have just stepped back into a part of history.After a morning of exploration, we journey towards the ancient city of Jerash. These ruins offer some of Jordan?s best examples of Greco-Roman architecture and are so well preserved that they are often referred to as the Pompeii of the Middle East. Wandering through its cobbled streets and marvelling at its magnificent monuments, temples and theatres it will not be difficult to imagine how life was for its former citizens. The only thing missing here are the roofs of the buildings and the Roman people! Admire Hadrian's Arch and explore the famous Hippodrome which hosted chariot races to thousands of spectators throughout a time of Roman rule. You can still see the tracks left by the chariots.Late afternoon we head back to modern Amman to sample some Jordanian cuisine with an included evening meal at a local restaurant with your group and tour leader.This morning we drive to the market city of Madaba which is also known as the ‘City of Mosaics’, most notably the city is home to the 6th century Mosaic map of Jerusalem and the Holy Land. We make a stop at the 19th Century Byzantine Greek Orthodox Church of St George where you will have time to view this famous, colourful mosaic which now forms part of the church's floor.Whilst in Madaba you will have the option to take part in a traditional Jordanian cooking experience. If you choose to do this then your guide will arrange for you to meet a local who will take you to buy produce from the local shops and market. After purchasing your fresh goods you will return to their home where they will share recipes and local traditions while you prepare and cook an authentic dish together. This will give you the unique opportunity to learn more about local culture and interact with a local family. If you opt not to join the cooking experience then you will have free time to explore Madaba and take lunch.We depart Madaba and drive along the historical King's Highway which dates back to biblical times - the winding roads will take us through mountainous scenery observing local life along the way.During our journey we will make a stop to experience a birds eye view of Wadi Mujib which is best known as ‘The Grand Canyon of Jordan’. Impressive for its grand scale, this gorge was known during biblical times as the River Arnon and was named after its noisy waterfalls. The river was important during this period as it formed a physical boundary between the Moabites and the Amorites. The canyon opens out to the Dead Sea at an altitude of 410m below sea level making it the lowest nature reserve on Earth.Following this we will visit Mount Nebo - a Holy site in Jordan said to have been the place where Moses saw the Promised Land before he died as mentioned in the Old Testament. Your group will also get the opportunity to catch spectacular panoramic views of the Dead Sea and the Jordan River from Mount Nebo before making our way to the ancient site of Umm ar-Rasas.In the late afternoon we arrive at our hotel situated just outside the ancient city of Petra. It is ideally located for tomorrow&#39;s activity where we will have a full day to explore the world famous UNESCO World Heritage Site, also known as the ‘Rose City’ due to its rose coloured rocks. Prepare to be mesmerised as you enter the city through the dramatic main entrance known as the Siq. Standing tall at an impressive 80m and over 1 km in length, this narrow and majestic gorge acts as a gateway to one of the most picturesque destinations you will ever visit.Today we start early in order to best experience Petra on our morning guided excursion. You will come face-to-face with this archaeological treasure which is very precious to the people of Jordan, so much so that it is considered a national symbol of the country. One of the Seven New Wonders of the World, this awe inspiring gem comprises of tombs, temples and its notable red-rose sandstone rock in which the city itself was carved inside. You will have the opportunity to continue exploring this in depth during your free afternoon.This evening you have the option to experience the magic of the city at night with a candlelight experience.If you are left wanting more then you will have the option to wake up early and head back into Petra where you can appreciate the magnificence of the treasury without the crowds!We will depart from Wadi Musa this morning and make our way to Little Petra where you can gain more of an insight into the immensity of this site.The adventure continues as we drive further south to the dramatic desert wilderness of Wadi Rum. Bask in the natural beauty of the red-sand desert and its bewildering rock formations. This afternoon you will be able to enjoy a jeep safari visiting sand dunes, petroglyphs and canyons. End your afternoon reflecting on your adventure as you watch the magnificent sunset over the desert.Tonight we stay in traditional Bedouin tents, complete with beds, private bathroom and communal seating area. This location is perfect for stargazing. You will enjoy a traditional dinner cooked by your Bedouin hosts and learn about how the Zarb is cooked using the earth oven.Today we head towards the city of Karak where you will find an ancient fortified castle perched high on top of a hill nestled within the heart of the local town. Built by the Crusaders in the 12th century its strategic position allows for views as far as the Dead Sea on a clear day.After exploring this fascinating crusader castle you will continue to the Dead Sea. Here you will have time to soak up the experiences you have had whilst in Jordan. You have the option to relax by the pool, float in the Dead Sea at the lowest point on earth, or perhaps even have a mud bath along the shoreline.This afternoon you will say goodbye to your tour leader as they will leave you in the safe and comfortable hands of the hotel customer service team.Today you have a full free day to enjoy the Dead Sea which is notable for its deep blue waters made up of Dead Sea salts and minerals. Make the most of your relaxation time while appreciating the magnificent surrounding views of the Jordanian East Coast. The hotel customer service team will be there to assist you with anything you may need.You will also have the opportunity to visit Bethany Beyond the Jordan - the archaeological site of Bethany which is believed to be the site where Jesus was baptised by John the Baptist. Only recently excavated you can see a number of different churches, baptismal pools and prayer hall which all date back to the Byzantine and Roman period. Not only can you visit the baptism site of Jesus but you will be able to touch the River Jordan and perhaps observe as people are also baptised in this holy river. Just metres over the river you will see people visiting the same spot from the Holy Land of Israel & Palestine.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.If you would like to arrange transfers back to Amman airport then you can pre-book this with Tucan Travel prior to travel. If you wish to book a transfer on the ground then the hotel will be able to assist.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/jordan_124/ancient_temple_in_petra-1_20180702_2016877925.jpg", "countries": "Jordan"}