{"title": "Nature Trails", "link": "https://www.tucantravel.com/tour/nature-trails/ncr/", "dates": {"2020-04-04": "USD 130.00", "2020-04-12": "USD 130.00", "2020-04-26": "USD 130.00", "2020-05-10": "USD 130.00", "2020-05-24": "USD 130.00", "2020-06-07": "USD 130.00", "2020-06-21": "USD 130.00", "2020-07-05": "USD 130.00", "2020-07-19": "USD 130.00", "2020-08-02": "USD 130.00", "2020-08-16": "USD 130.00", "2020-08-30": "USD 130.00", "2020-09-13": "USD 130.00", "2020-09-27": "USD 130.00", "2020-10-11": "USD 130.00", "2020-10-25": "USD 130.00", "2020-11-08": "USD 130.00", "2020-11-22": "USD 130.00", "2020-12-06": "USD 130.00", "2020-12-20": "USD 130.00", "2021-01-03": "USD 140.00", "2021-01-17": "USD 140.00", "2021-01-31": "USD 140.00", "2021-02-14": "USD 140.00", "2021-02-28": "USD 140.00", "2021-03-14": "USD 140.00", "2021-03-28": "USD 140.00", "2021-04-11": "USD 140.00", "2021-04-25": "USD 140.00", "2021-05-09": "USD 140.00", "2021-05-23": "USD 140.00", "2021-06-06": "USD 140.00", "2021-06-20": "USD 140.00", "2021-07-04": "USD 140.00", "2021-07-18": "USD 140.00", "2021-08-01": "USD 140.00", "2021-08-15": "USD 140.00", "2021-08-29": "USD 140.00", "2021-09-12": "USD 140.00", "2021-09-26": "USD 140.00", "2021-10-10": "USD 140.00", "2021-10-24": "USD 140.00", "2021-11-07": "USD 140.00", "2021-11-21": "USD 140.00", "2021-12-05": "USD 140.00", "2021-12-19": "USD 140.00"}, "days": "9", "description": "T We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.The capital city of Costa Rica, San José, is nestled in a fertile valley among coffee and sugar-cane farms. There is not much left of the colonial era architecture, due to the damage done by earthquakes, but it is certainly worth seeing the National Theatre, built in 1897. Maybe you'll be lucky enough to catch a performance whilst you're here. The Gold, Jade and National Museums are also particularly recommended for a visitIf you have booked pre-accommodation there are plenty of interesting optional day trips that can be undertaken within a close vicinity of San José such as visits to the Poás or Irazú volcano, white water rafting, the Turu Ba Ri Tropical Park or the Rain Forest Aerial Tram.Please note: If you are are travelling into Costa Rica from Peru, Bolivia, Brazil, Colombia, Ecuador and Panama then you will need a valid yellow fever certificate.Today we travel through lush green countryside to the small village of Manuel Antonio, the base for Manuel Antonio National Park. The journey takes around three hours by local bus and you will start to witness the tropical countryside. After check in the rest of the day is free to relax and recharge, wander the charming streets or beach front and start to experience the beauty of Costa Rica.Today we explore Costa Rica&#39;s most celebrated and beautiful nature reserve, Manuel Antonio National Park. The area consists of around 1,680 acres of rainforest containing lush vegetation and white sandy beaches. Even though Manuel Antonio National Park is one of the smallest in the country, it is considered the most biodiverse with more than 100 species of mammals and almost 200 species of birds. While exploring one of the many hiking trails you may come across the three toed sloth, pelicans, white-faced monkeys, anteaters and iguanas.Other activities in the area include horse riding, kayaking, hiking, guided tours and plenty other water sports such as white water rafting and sailing tours.We travel to the old town of Quepos, once a very important port for the exportation of bananas. We then ascend a steep and bumpy mountain road that offers great views over lush green hills that flatten to meet the Pacific Ocean. We reach the small town of Santa Elena, nestled up in the clouds and established by American Quakers in the 1950's.Santa Elena is the base for the Monteverde Cloud Forest Reserve which we will visit tomorrow.Today we visit Monteverde Cloud Forest Reserve on a private transfer. There are several paths to explore in this privately owned reserve, one of which takes you to the continental divide. On a clear day both the Atlantic and Pacific Oceans can be seen! We'll also stop at the Hummingbird Gallery where you can grab a drink and a slice of cake. Here you can watch dozens of these energetic birds buzz around sipping on nectar. The area around Santa Elena is famous for its ziplines and hosts the longest zip line in the world. Here you'll have the option to go flying over the cloud forest on a series of cables strung out between the giant trees. For the less courageous, you may opt for a sky walk along a series of suspension bridges above the forest canopy. Along with the lovely horse treks, nature-spotting twilight walks, visits to coffee and dairy farms, you may find it hard to choose between all of the exciting excursions!Our next journey takes us through the mountains of the cloud forest using a combination of minivans and boats. The first leg to Lake Arenal takes about one hour 30 minutes and the landscape is truly spectacular. Rolling hills eventually give way to the distant views of Arenal Volcano and we can stop for photos at some of the best lookouts. Stopping by the side of the road one last time, we walk down a dirt path to our boat on the shores of Lake Arenal. The scenery is truly stunning from the lake and we travel for approximately an hour slowly approaching Arenal Volcano. Once we reach the other side, where we board another minibus and travel for thirty minutes to La Fortuna.After checking in you have time for lunch and to explore the town. Kick back and relax, you then have two full days to enjoy all the wonderful excursions in the area! You are free to enjoy the hiking trails, horseback riding, butterfly gardens or zip-line tours.The main attraction in La Fortuna is the nearby Arenal Volcano, which was constantly erupting between 1968 and 2010. Although not erupting any more, the occasional puff of steam can be seen. The National Park consists of lush forests bursting with wildlife, gushing waterfalls and hanging bridges. You are free to enjoy the hiking trails, horseback riding, butterfly gardens or zip-line tours.You then return to San Jose for another night. In the evening there are plenty of world class restaurants to choose from and some great nightlife especially if you are here on the weekend.Please note:  The tour leader will not travel back with you. Instead a shuttle transfer will take you back to San Jose where a representative from the hotel will be on hand to welcome you.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}