{"title": "Incas and Amazon", "link": "https://www.tucantravel.com/tour/incas-and-amazon/peia/", "dates": {"2020-03-31": "USD 190.00", "2020-04-14": "USD 190.00", "2020-04-28": "USD 190.00", "2020-05-12": "USD 190.00", "2020-05-26": "USD 190.00", "2020-06-09": "USD 190.00", "2020-06-23": "USD 190.00", "2020-07-07": "USD 190.00", "2020-07-21": "USD 190.00", "2020-08-18": "USD 190.00", "2020-09-01": "USD 190.00", "2020-09-15": "USD 190.00", "2020-09-29": "USD 190.00", "2020-10-13": "USD 190.00", "2020-10-27": "USD 190.00", "2020-11-10": "USD 190.00", "2020-11-24": "USD 190.00", "2020-12-08": "USD 190.00", "2020-12-22": "USD 190.00", "2021-01-05": "USD 200.00", "2021-01-19": "USD 200.00", "2021-02-02": "USD 200.00", "2021-02-16": "USD 200.00", "2021-03-02": "USD 200.00", "2021-03-16": "USD 200.00", "2021-03-30": "USD 200.00", "2021-04-13": "USD 200.00", "2021-04-27": "USD 200.00", "2021-05-11": "USD 200.00", "2021-05-25": "USD 200.00", "2021-06-08": "USD 200.00", "2021-06-22": "USD 200.00", "2021-07-06": "USD 200.00", "2021-07-20": "USD 200.00", "2021-08-03": "USD 200.00", "2021-08-17": "USD 200.00", "2021-08-31": "USD 200.00", "2021-09-14": "USD 200.00", "2021-09-28": "USD 200.00", "2021-10-12": "USD 200.00", "2021-10-26": "USD 200.00", "2021-11-09": "USD 200.00", "2021-11-23": "USD 200.00", "2021-12-07": "USD 200.00", "2021-12-21": "USD 200.00"}, "days": "8", "description": "F We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Peru! Your adventure starts in Cusco, a city of beautiful Spanish colonial architecture and the once capital of the Inca Empire. While the city is usually seen as the gateway to the iconic Machu Picchu, Cusco is well worth exploring in itself.Discover the Plaza de Armas, the cultural centre of the city and where you can find many bars, restaurants and local coffee shops. Visit the Cathedral, which was built with blocks from the nearby Inca site of Sacsayhuaman and took almost a century to complete.We highly recommend arriving to Cusco a few days prior to the start of your tour to help with acclimatisation. If you would like to book pre-tour accommodation please contact your Adventure Specialist.Tonight you will have a briefing on what to expect over the next few days and your journey to Machu Picchu.A full day is spent visiting the Sacred Valley of the Incas. At an altitude of 3800m we take slow walks that take up to an hour, around each of the ruins in order to manage any effects the high altitude may have. Firstly we visit the Pisac ruins, perched on a hilltop with incredible views of the surrounding mountains. We then go down to the famous traditional market of the same name, which is full of colour and atmosphere. A great place for souvenirs! After lunch, we continue along the valley to the temple/fortress of Ollantaytambo with its enormous Inca terracing constructed on the side of a steep mountain.Tonight you will stay in the town of Ollantaytambo.Entry to Machu Picchu is split into a morning and afternoon shift in order to ease the flow of tourists to the site and aid conservation and preservation of the citadel. As a result, if you are scheduled to take the train to Machu Picchu, your guided tour will take place in the afternoon shift.Alternate options for getting to Machu Picchu:Taking the train: Waking early in Ollantaytambo you will take the train to Aguas Calientes, arriving at 10am. You will have time to get some food before entering Machu Picchu at approximately midday. Enjoy a guided tour around the site before getting the train back to Ollantaytambo and arriving back in Cusco at approximately 10pm.One day hike:Waking early in Ollantaytambo you will take the train to to Km104 (2100m) where you will start the trek heading towards the ruins of Chachabamba. From here you will follow the Inca Trail to the foot of the Wiñay-Wayna ruins (2700m), hiking until you reach Sun Gate and Machu Picchu in the late afternoon.  Enjoy a guided tour around the site before getting the train back to Ollantaytambo and arriving back in Cusco at approximately 10pm.The lost city of Machu Picchu (Old Mountain) was originally completely self -contained, surrounded by agricultural terraces sufficient to feed the population, and watered by natural springs. Located high above the fast flowing Urubamba River, the cloud shrouded ruins have palaces, baths, temples, storage rooms and some 150 houses, all in a remarkable state of preservation that will simply take your breath away. The ruins were only discovered by the outside world in 1911, when American explorer Hiram Bingham found them while looking for another “lost city” called Vilcabamba. Due to their isolation many of the buildings are still quite intact and you can't help but admire Huayna Picchu (Young Mountain), which towers above the ruins.Please note:  The one day hike generally can be booked more closer to departure unlike the Inca Trail however as it is still permit-regulated this is no guarantee. Please enquire with your Adventure Specialist for availability. It is a long day and can be quite challenging. Read more about it hereToday is free for you to explore Cusco.  Make the most of your free day to explore its amazing churches, colonial buildings and picturesque streets, many of which have Inca walls, arches and doorways. On a hill overlooking the city stands the ceremonial fortress of Sacsayhuaman, where some of the most spectacular Inca walls can be found, including a massive 130 ton stone.No trip to Peru would be complete without a visit to what is considered the most biodiverse place on earth, the lush and beautiful Amazon rainforest. Covering nearly two thirds of the country, the area is home to around 600 species of birds, 1200 types of butterflies and 300 reptiles, to name a few. As eco-tourism continues to grow, there are a number of eco lodges allowing you to experience the rainforest in the most responsible and authentic way possible.Our local representative will transfer you to the airport for your flight to the jungle community of Puerto Maldonado, the starting point for our visit to the Amazon rainforest. Here you can pick up last minute drinks and snacks before the group continue with a short bus ride followed by riverboat journey to reach the accommodation for the night. Sailing along the river, the trip takes around 2 hours and is an excellent chance to relax and start to take in the magic of the rainforest.Arriving at your riverside lodge, check in and have some time to relax before an afternoon of exploring. After lunch we will set off on a trek through the rainforest along wooden walkways. On the way our guide will stop to show you various species of bird and explain the medicinal plants and delicate ecological systems of the Amazon Jungle. The scenery is extremely varied incorporating dense jungle as well as marsh areas. You will see incredibly big trees, several metres in diameter and around 450 years old. We walk to Cochita Caiman (Caiman Pond) where we see wildlife along the way. We then return to the lodge for dinner.Please note: The eco-lodges in the Amazon jungle are designed to give travellers the most authentic jungle experience while limiting disruption to the animals and plantlife. The bungalows are built from local indigenous materials with the rooms sealed by mesh netting to keep mosquitoes out. All rooms have private bathroom facilities however these are basic and hot water can be limited. There is portable water available at the lodge therefore we recommend taking a reusable water bottle with you. Electricity is limited and it is advisable to bring portable chargers for your electronics and ensure they are fully charged. After dark, the walkways are lit by oil lamps. The lodges include a welcome area, dining room and bar, meaning there are plenty areas for your group to relax and socialise. Single supplements are not available in the bungalows. If you have further questions on what to expect, your tour leader will be happy to assist. All excursions in the jungle are led by an English speaking guide.After an early breakfast we hike deeper in to the jungle, enjoying the surroundings and exploring the delights and hidden wonders of the Amazon Rainforest. We may also catch a glimpse of the rare giant otter. Afterwards we will enjoy the view of the lake from our viewing point/observation platform, where you can experience the canopy wildlife such as parrots, guacamayos, toucans, camungos, shanshos, herons, turtles and caiman. We will return to the lodge for a well deserved lunch.After a break and some yummy food, we take a short boat trip across the Madre de Dios River to Monkey Island. On the way over you may spot caiman from the boat. Once on the island it is possible to see a great variety of monkeys such as the ‘maquisapa’, black and white ‘Martins’, ‘Leoncito de la Selva’ (Little Lions), ‘Frailes’ (Friars), ‘Achuñis’, ‘Ronsocos’ as well as an array of birdlife. In the evenings it is often possible to enjoy the wonderful sunset, one of the most impressive sights of the forest (weather permitting).Enjoy your final night in the heart of the jungle soaking up this magical and peaceful atmosphere.Waking up to the sounds of the jungle, take the boat back to Puerto Maldonado for your flight back to Cusco. You have the remainder of the day to pick up any last-minute souvenirs before your adventure comes to an end.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}