{"title": "Andes & Amazon", "link": "https://www.tucantravel.com/tour/andes-and-amazon/pell/", "dates": {"2020-04-06": "USD 290.00", "2020-04-20": "USD 290.00", "2020-05-04": "USD 290.00", "2020-05-18": "USD 290.00", "2020-06-01": "USD 290.00", "2020-06-15": "USD 290.00", "2020-06-29": "USD 290.00", "2020-07-13": "USD 290.00", "2020-08-10": "USD 290.00", "2020-08-24": "USD 290.00", "2020-09-21": "USD 290.00", "2020-10-05": "USD 290.00", "2020-10-19": "USD 290.00", "2020-11-02": "USD 290.00", "2020-11-16": "USD 290.00", "2020-11-30": "USD 290.00", "2020-12-14": "USD 290.00", "2020-12-28": "USD 290.00", "2021-01-11": "USD 310.00", "2021-01-25": "USD 310.00", "2021-02-08": "USD 310.00", "2021-02-22": "USD 310.00", "2021-03-08": "USD 310.00", "2021-03-22": "USD 310.00", "2021-04-05": "USD 310.00", "2021-04-19": "USD 310.00", "2021-05-03": "USD 310.00", "2021-05-17": "USD 310.00", "2021-05-31": "USD 310.00", "2021-06-14": "USD 310.00", "2021-06-28": "USD 310.00", "2021-07-12": "USD 310.00", "2021-07-26": "USD 310.00", "2021-08-09": "USD 310.00", "2021-08-23": "USD 310.00", "2021-09-06": "USD 310.00", "2021-09-20": "USD 310.00", "2021-10-04": "USD 310.00", "2021-10-18": "USD 310.00", "2021-11-01": "USD 310.00", "2021-11-15": "USD 310.00", "2021-11-29": "USD 310.00", "2021-12-13": "USD 310.00", "2021-12-27": "USD 310.00"}, "days": "16", "description": "D We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Peru! Your adventure starts here in Lima and you are free to arrive today at your leisure.Lima was founded by the Spanish Conquistador Francisco Pizarro in 1535 after he eradicated the Incas and made the city his capital. The city has many beautiful colonial buildings and some of the best museums in South America including the Gold Museum, Museum of the Inquisition and the Catacombs below the San Francisco Church.Peru's capital has much to offer and many of the sights, including the city's two main squares the Plaza de Armas and Plaza San Martin, boast some fantastic sightseeing opportunities. The Plaza de Armas houses the Cathedral, Municipal Palace and Presidential Palace where the changing of the guard can be seen every day at 12 noon.Another highlight of Lima is the Huaca Pucllana, ruins of a pre-Incan pyramid. The clay structure, built in seven staggered levels is one of the few that remain from the historic pre-Colombian period in Peru. It is thought to have been built around 500 AD and would have been used for spiritual ceremonies. Located in the Miraflores district, it's surprisingly very easy to get it!Of course you should also spend time sampling some delicious local Peruvian food. For a breakdown of the best food in Peru and where to eat in Lima, click hereToday we travel to the small and coastal town of Paracas. Using a comfortable tourist bus, the journey takes around 3 and a half hours giving you a free afternoon to enjoy the sites and fresh ocean air.Soak up the atmosphere tonight and dine at one of the many shorefront restaurants which serve various local dishes and great seafood.A visit to Paracas would not be complete without visiting the Ballestas Islands on a two hour boat trip.  The islands, sometimes known as the ‘poor man's Galapagos', are teeming with over 150 species of bird life (including penguins, cormorants, boobies and pelicans). They are also home to thousands of sea lions and boast some amazing rock formations. Although it is not possible to set foot on the islands, you will experience the magnificent sight and sounds of the vast array of wildlife and maybe even spot seals and dolphins playing around the boat. Our boat trip also takes us past the mysterious Candelabra figure etched on the side of a mountain. Best viewed from the sea, many believe the Candelabra is linked to the Nazca LinesLeave Paracas behind and journey towards Nazca in a private vehicle. On the way, the group will stop at the Huacachina Oasis, deep in the Huacachina Desert. Here you have the chance to get your adrenaline-pumping with the optional excursions available. Try sand-boarding down the vast dunes or cruise over them in a dune-buggy. After you have explored the desert, continue driving to Nazca.Today you have the option to visit the Nazca Lines. These strange parallel lines and geometrical figures are etched into the desert floor. Although there is a viewing tower, these strange designs can only be fully appreciated from the air. You can take a fascinating flight over the lines and shapes, which include a monkey, hummingbird, condor, spider and even a spaceman. The designs are thought to have been made by three different groups of people: the Paracas (900 -200 BC), the Nazca (200BC -600AD) and then new migrants from Ayacucho around 630AD. You can also take optional tours to visit the underground aqueducts, gold mines and ceramic shops.Pack up on snacks as we will take taxis to the bus station and embark on an overnight bus journey to Arequipa.A beautiful colonial city, Arequipa has a lovely central plaza dominated by a large cathedral. There are some fantastic restaurants in Arequipa and it is possible to enjoy many Peruvian delicacies here. Besides the stimulating architecture, one of the the main attractions is the Santa Catalina Convent, which is almost a city in itself with its maze of cobbled streets, cloisters and decorative buildings. Don't miss the nuns' café for excellent freshly baked treats! Another popular attraction is the acclaimed Museo Santuarios Andinos which houses many well preserved mummies. The most famous of the mummies is Juanita, a young Inca maiden who was sacrificed around the year AD 1450 atop the Nevado Ampato volcano to appease the gods and ask for a good harvest. Juanita was sacrificed then frozen by snowfall at the top of the mountain, hence her nickname ‘ice princess’. She was rediscovered in the 1990s when ash from the volcano melted the snow around her.Today you will visit the nearby Colca Canyon, said to be one of the deepest in the world. Take a private vehicle into the high, barren Andean landscape, reaching a maximum height of 4,910 metres above sea level. Along the way you will learn about the local fauna and flora of the region and spot the many vicuñas and alpacas. After checking in to our hotel in the town of Coporaque there is an option to visit the nearby hot springs.This morning we start early to visit the Cruz del Condor (Condor's Cross) lookout point in search of the giant condors soaring out of the canyon on thermal currents while taking a walk along the canyon's edge and admiring the spectacular views. The beautiful scenery continues as you take a combination of buses all the way to Puno on the shores of Lake Titicaca, which at 3,855 metres above sea level, is the highest navigable lake in the world.Today we take a day trip to the traditional and enthralling Lake Titicaca. Not only is it the largest lake in South America, it sits at 3,800 meters above sea level making it the highest navigable body of water on earth. Crystal blue waters compliment the bright yellow grass reeds used to construct the homes and boats floating upon it, while the traditional clothing simply adds to the beauty and colour of the place. While the lake tends to be overshadowed by its biodiverse and world famous neighbour the Amazon jungle, there exists over 500 aquatic species here and many various birds.First we visit the floating reed islands in the Bay of Puno to see the Uros islanders way of life and we will have the option to ride in a traditional reed boat.Next stop is Taquile Island, an island on Lake Titicaca still holding up many of the traditions values and customs it was built on. Learn about the way of life, from the reasons for why they do their hair the way they do and how they dress. Famous for their textiles and clothing, you will be able to pick up a homemade gift or two from the main square.We will return to Puno for the evening.Today you will journey towards Cusco on a tourist bus. Pass breathtaking Andean mountain scenery on this full day journey. Cusco, which means ‘navel of the earth' in the Inca language of Quechua, has a mostly indigenous population of around 300,000 and is centred around the Plaza de Armas, which is dominated by the Cathedral and La Compañia de Jesus Church. Its cloistered arcades house many fine restaurants, bars and shops which you have time to enjoy this evening.A full day is spent visiting the Sacred Valley of the Incas. At an altitude of 3800m we take slow walks that take up to an hour, around each of the ruins in order to manage any effects the high altitude may have. Firstly we visit the Pisac ruins, perched on a hilltop with incredible views of the surrounding mountains. We then go down to the famous traditional market of the same name, which is full of colour and atmosphere. A great place for souvenirs! After lunch, we continue along the valley to the temple/fortress of Ollantaytambo with its enormous Inca terracing constructed on the side of a steep mountain.Tonight you will stay in the town of Ollantaytambo.Entry to Machu Picchu is split into a morning and afternoon shift in order to ease the flow of tourists to the site and aid conservation and preservation of the citadel. As a result, if you are scheduled to take the train to Machu Picchu, your guided tour will take place in the afternoon shift.Alternate options for getting to Machu Picchu:Taking the train: Waking early in Ollantaytambo you will take the train to Aguas Calientes, arriving at 10am. You will have time to get some food before entering Machu Picchu at approximately midday. Enjoy a guided tour around the site before getting the train back to Ollantaytambo and arriving back in Cusco at approximately 10pm.One day hike:Waking early in Ollantaytambo you will take the train to to Km104 (2100m) where you will start the trek heading towards the ruins of Chachabamba. From here you will follow the Inca Trail to the foot of the Wiñay-Wayna ruins (2700m), hiking until you reach Sun Gate and Machu Picchu in the late afternoon.  Enjoy a guided tour around the site before getting the train back to Ollantaytambo and arriving back in Cusco at approximately 10pm.The lost city of Machu Picchu (Old Mountain) was originally completely self -contained, surrounded by agricultural terraces sufficient to feed the population, and watered by natural springs. Located high above the fast flowing Urubamba River, the cloud shrouded ruins have palaces, baths, temples, storage rooms and some 150 houses, all in a remarkable state of preservation that will simply take your breath away. The ruins were only discovered by the outside world in 1911, when American explorer Hiram Bingham found them while looking for another “lost city” called Vilcabamba. Due to their isolation many of the buildings are still quite intact and you can't help but admire Huayna Picchu (Young Mountain), which towers above the ruins.Please note:  The one day hike generally can be booked more closer to departure unlike the Inca Trail however as it is still permit-regulated this is no guarantee. Please enquire with your Adventure Specialist for availability. It is a long day and can be quite challenging. Read more about it hereToday is free for you to explore Cusco.  Make the most of your free day to explore its amazing churches, colonial buildings and picturesque streets, many of which have Inca walls, arches and doorways. On a hill overlooking the city stands the ceremonial fortress of Sacsayhuaman, where some of the most spectacular Inca walls can be found, including a massive 130 ton stone.No trip to Peru would be complete without a visit to what is considered the most biodiverse place on earth, the lush and beautiful Amazon rainforest. Covering nearly two thirds of the country, the area is home to around 600 species of birds, 1200 types of butterflies and 300 reptiles, to name a few. As eco-tourism continues to grow, there are a number of eco lodges allowing you to experience the rainforest in the most responsible and authentic way possible.Our local representative will transfer you to the airport for your flight to the jungle community of Puerto Maldonado, the starting point for our visit to the Amazon rainforest. Here you can pick up last minute drinks and snacks before the group continue with a short bus ride followed by riverboat journey to reach the accommodation for the night. Sailing along the river, the trip takes around 2 hours and is an excellent chance to relax and start to take in the magic of the rainforest.Arriving at your riverside lodge, check in and have some time to relax before an afternoon of exploring. After lunch we will set off on a trek through the rainforest along wooden walkways. On the way our guide will stop to show you various species of bird and explain the medicinal plants and delicate ecological systems of the Amazon Jungle. The scenery is extremely varied incorporating dense jungle as well as marsh areas. You will see incredibly big trees, several metres in diameter and around 450 years old. We walk to Cochita Caiman (Caiman Pond) where we see wildlife along the way. We then return to the lodge for dinner.Please note: The eco-lodges in the Amazon jungle are designed to give travellers the most authentic jungle experience while limiting disruption to the animals and plantlife. The bungalows are built from local indigenous materials with the rooms sealed by mesh netting to keep mosquitoes out. All rooms have private bathroom facilities however these are basic and hot water can be limited. There is portable water available at the lodge therefore we recommend taking a reusable water bottle with you. Electricity is limited and it is advisable to bring portable chargers for your electronics and ensure they are fully charged. After dark, the walkways are lit by oil lamps. The lodges include a welcome area, dining room and bar, meaning there are plenty areas for your group to relax and socialise. Single supplements are not available in the bungalows. If you have further questions on what to expect, your tour leader will be happy to assist. All excursions in the jungle are led by an English speaking guide.After an early breakfast we hike deeper in to the jungle, enjoying the surroundings and exploring the delights and hidden wonders of the Amazon Rainforest. We may also catch a glimpse of the rare giant otter. Afterwards we will enjoy the view of the lake from our viewing point/observation platform, where you can experience the canopy wildlife such as parrots, guacamayos, toucans, camungos, shanshos, herons, turtles and caiman. We will return to the lodge for a well deserved lunch.After a break and some yummy food, we take a short boat trip across the Madre de Dios River to Monkey Island. On the way over you may spot caiman from the boat. Once on the island it is possible to see a great variety of monkeys such as the ‘maquisapa’, black and white ‘Martins’, ‘Leoncito de la Selva’ (Little Lions), ‘Frailes’ (Friars), ‘Achuñis’, ‘Ronsocos’ as well as an array of birdlife. In the evenings it is often possible to enjoy the wonderful sunset, one of the most impressive sights of the forest (weather permitting).Enjoy your final night in the heart of the jungle soaking up this magical and peaceful atmosphere.Waking up to the sounds of the jungle, take the boat back to Puerto Maldonado for your flight back to Lima. You have the remainder of the day to enjoy Lima before your tour comes to an end.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}