{"title": "Peru & Galapagos", "link": "https://www.tucantravel.com/tour/peru-and-galapagos/pepg/", "dates": {"2020-04-13": "USD 340.00", "2020-04-27": "USD 340.00", "2020-05-11": "USD 340.00", "2020-05-25": "USD 340.00", "2020-06-08": "USD 340.00", "2020-06-22": "USD 340.00", "2020-07-06": "USD 340.00", "2020-07-20": "USD 340.00", "2020-08-03": "USD 340.00", "2020-08-31": "USD 340.00", "2020-09-14": "USD 340.00", "2020-09-28": "USD 340.00", "2020-10-12": "USD 340.00", "2020-10-26": "USD 340.00", "2020-11-23": "USD 340.00", "2020-12-07": "USD 340.00", "2020-12-21": "USD 340.00", "2021-01-04": "USD 360.00", "2021-01-18": "USD 360.00", "2021-02-01": "USD 360.00", "2021-02-15": "USD 360.00", "2021-03-01": "USD 360.00", "2021-03-29": "USD 360.00", "2021-04-12": "USD 360.00", "2021-04-26": "USD 360.00", "2021-05-10": "USD 360.00", "2021-05-24": "USD 360.00", "2021-06-07": "USD 360.00", "2021-06-21": "USD 360.00", "2021-07-05": "USD 360.00", "2021-07-19": "USD 360.00", "2021-08-02": "USD 360.00", "2021-08-16": "USD 360.00", "2021-08-30": "USD 360.00", "2021-09-13": "USD 360.00", "2021-09-27": "USD 360.00", "2021-10-11": "USD 360.00", "2021-10-25": "USD 360.00", "2021-11-08": "USD 360.00", "2021-11-22": "USD 360.00", "2021-12-06": "USD 360.00", "2021-12-20": "USD 360.00"}, "days": "26", "description": "E We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Upon arrival at Quito airport you will be collected by a Tucan Travel representative and transferred to your hotel.Spend today discovering more about the history of Ecuador on an included colonial city tour. Visit the Bas&#237;lica del Voto Nacional towers, a Roman Catholic church and largest neo Gothic basilica in the world, or the Iglesia de la Compa&#241;ia de Jesus church which is considered one of the most beautiful landmarks in the city. Drive through the traditional neighbourhood of San Juan, a historical district which dates back to the Inca times. We visit the Middle of the World Museum and the Ecuador Monument, where you can place each foot on different sides of the equator! Marvel at the clever tricks of the equator, such as balancing an egg on a nail or watching water swirl in different directions depending which side you are on.We finish the day at the Panecillo hillside with its breathtaking views of the old and modern city.Relax tonight and get ready for the wildlife adventure of a lifetime. Your Tucan Travel rep will be available to prepare you for the days ahead and answer any questions you may have about the cruise and what to expect.Today you will be transferred to the airport in Quito to depart for the Galápagos Islands. Arrive at the airport on Baltra Island where you will meet your naturist guide and be transferred to the pier to board the M/Y Coral I or II.  You can find a 360 Virtual Tour of your ship hereThis afternoon we will visit the Highlands Tortoise Reserve where you will come face to face with these gentle giants. Walk amongst these incredible 600lb reptiles and learn all about their activity on the island. Next we visit the collapsed sinkholes, also known as Los Gemelos. These fascinating formations were created from tectonic shifts and erosion and has quite different scenery to the rest of the island. Enjoy the beautiful forested area as your guide explains all about the endemic tree-forming scalesia. The habitat here is home to various bird species including finches, short-eared owls and the vermillion flycatcher.Difficulty Level: EasyType of Terrain: Flat (sometimes muddy depending on season)This morning we head to Vicente Roca Point on Isabela Island. This point is a headland with two protected turquoise coves on either side, making it a great place for deep-water snorkelling thanks to its location in one of the richest marine ecosystems on Earth, the Bolivar Channel. A wide variety of marine life can be seen underwater including sea horses, Frogfish and Octopi. Groups of dolphins, Sea Lions and tunas can sometimes be spotted in this area too. You will then take an hour-long dinghy ride along the sheer cliffs to observe a great diversity of sea and coastal birds including Brown pelicans and Galapagos penguins.In the afternoon we cross the Bolivar Channel. In the cold season (from May to December), this stretch of the cruise offers spectacular whale-watching opportunities. We have a dry landing at Espinosa Point on Fernandina Island, the youngest of the Galápagos and one of the most volcanically-active islands, as eruptions occur every few years. You will see the biggest, most primitive-looking race of marine iguanas mingling with Sally Lightfoot Crabs, as well as Flightless Cormorants resting at their nesting sites. Galápagos penguins, Galápagos Hawks and Sea Lions can also be seen here.Among the flora and volcanic formations observers will spot brachycereus cactus, \"pa-hoe-hoe\" lava and \"AA\" lava formations. Numerous mangrove beds extend into the sea.Difficulty Level: IntermediateType of Terrain: Rocky at Espinosa PointThis morning we return to Isabela Island to make a wet landing on a volcanic black beach, before hiking around Urbina Bay, which features a wide variety of plant life that attract different insects, birds and reptiles. We'll also explore the uplifted coral reef that resulted from the volcanic activity of 1954, with a spectacular view of Alcedo Volcano. You will also go snorkelling around the bay, giving you the chance to swim with Sea turtles, Sea lions and countless varieties of tropical fish.Difficulty Level: IntermediateType of Terrain: flat & rockyIn the afternoon, we have our final stop on Isabela, Tagus Cove (dry landing) where we will learn about the eruption of five volcanoes that formed this island, the largest of the Galapagos archipelago. We will walk along a trail that leads to the Darwin salt-water Crater Lake, passing spectacular lava fields and volcanic formations. We will take a dinghy to observe marine life - Galápagos penguins can frequently be seen here. Tagus Cove, named for the British naval vessel that moored here in 1814, was used historically as an anchorage for pirates and whalers. Graffiti carved into the rocks near the landing point believed to have been made by 19th century pirates helps passengers better appreciate the relationship between the islands and tourism today. We will also have an opportunity to snorkel in deep water.Difficulty Level: Intermediate/DifficultType of Terrain: SteepWe begin the day with a wet landing on the black volcanic sand of Santiago Island, visited by Darwin in 1835. From here we visit the Salt Mines before walking along the Egas Port trail that takes us around the shoreline and to the best tidal pool areas in the Galapagos, populated by Fur Seals and Sally Lightfoot crabs. The unique terrain of Santiago's shores is home to a variety of resident and migrant birds. There is another opportunity to go snorkelling or swimming, and you may see lobsters, starfish, marine iguanas grazing on algae beds under the sea.Difficulty Level: IntermediateType of Terrain: flat & rockyIn the afternoon we have a wet landing at Sullivan Bay, on the other side of Santiago Island. This area is geologically significant, as it features extensive Pahoehoe lava flows which look as if they have just been formed.Difficulty Level: DifficultType of Terrain: Flat volcanic lavaThis morning we will make our way to Bachas Beach on Santa Cruz Island. The sand here is made of powdered coral, which makes it white and soft and a favourite site for nesting sea turtles. Sally Lightfoot crabs are abundant on the lava rocks along the water's edge. Flamingoes, hermit crabs, black necked stilts, and whimbrels can also be observed.Disembark at Baltra Island to meet your flight back to the continent. After a nature packed few days it is time to say goodbye to this beautiful corner of the globe and return to Peru to continue the adventure.You will fly from Santa Cruz Island to Guayaquil where you will have a layover before your connecting flight to Lima. The flights and layover will be unaccompanied however you will be met by a representative at Lima airport and transferred to your hotel.Today you will have a full day to enjoy Lima.Founded by the Spanish Conquistador Francisco Pizarro in 1535 after he eradicated the Incas and made the city his capital, Lima lies on the coast of Peru and is home to some 8.8 million people.Home to beautiful colonial buildings and some of the best museums in South America including the Gold Museum, Museum of the Inquisition and the Catacombs below the San Francisco Church. Peru's capital has much to offer and many of the sights, including the city's two main squares Plaza de Armas and Plaza San Martin, boast some fantastic sightseeing opportunities. The Plaza de Armas houses the Cathedral, Municipal Palace and Presidential Palace where the changing of the guard can be seen every day at 12 noon. There are also many markets in Lima, possibly the best being in the central district.Today we travel to the small and coastal town of Paracas. Using a comfortable tourist bus, the journey takes around 3 and a half hours giving you a free afternoon to enjoy the sites and fresh ocean air.Soak up the atmosphere tonight and dine at one of the many shorefront restaurants which serve various local dishes and great seafood.A visit to Paracas would not be complete without visiting the Ballestas Islands on a two hour boat trip. The islands are teeming with over 150 species of bird life (including penguins, cormorants, boobies and pelicans) and are home to thousands of sea lions and boast some amazing rock formations. Although it is not possible to set foot on the islands, you will experience the magnificent sights and sounds of the vast array of wildlife and maybe even spot seals and dolphins playing around the boat. Our boat trip also takes us past the mysterious Candelabra figure etched on the side of a mountain. Best viewed from the sea, many believe the Candelabra is linked to the Nazca Lines.This afternoon we leave Paracas behind and journey towards Nazca in a private vehicle. On the way, the group will stop at the Huacachina Oasis, deep in the Huacachina Desert. Here you have the chance to get your adrenaline pumping with the optional excursions available. Try sand-boarding down the vast dunes or cruise over them in a dune-buggy. After you have explored the desert, continue driving to Nazca.Today you have the option to visit the Nazca Lines. These strange parallel lines and geometrical figures are etched into the desert floor. Although there is a viewing tower, these strange designs can only be fully appreciated from the air. You can take a fascinating flight over the lines and shapes, which include a monkey, hummingbird, condor, spider and even a spaceman. The designs are thought to have been made by three different groups of people: the Paracas (900 -200 BC), the Nazca (200BC -600AD) and then new migrants from Ayacucho around 630AD. You can also take optional tours to visit the underground aqueducts, gold mines and ceramic shops.Pack up on snacks as we will take taxis to the bus station and embark on an overnight bus journey to Arequipa.A beautiful colonial city, Arequipa has a lovely central plaza dominated by a large cathedral. There are some fantastic restaurants in Arequipa and it is possible to enjoy many Peruvian delicacies here. Besides the stimulating architecture, one of the the main attractions is the Santa Catalina Convent, which is almost a city in itself with its maze of cobbled streets, cloisters and decorative buildings. Don't miss the nuns' café for excellent freshly baked treats! Another popular attraction is the acclaimed Museo Santuarios Andinos which houses many well preserved mummies. The most famous of the mummies is Juanita, a young Inca maiden who was sacrificed around the year AD 1450 atop the Nevado Ampato volcano to appease the gods and ask for a good harvest. Juanita was sacrificed then frozen by snowfall at the top of the mountain, hence her nickname ‘ice princess’. She was rediscovered in the 1990s when ash from the volcano melted the snow around her.Today you will visit the nearby Colca Canyon, said to be one of the deepest in the world. Take a private vehicle into the high, barren Andean landscape, reaching a maximum height of 4,910 metres above sea level. Along the way you will learn about the local fauna and flora of the region and spot the many vicuñas and alpacas. After checking in to our hotel in the town of Coporaque there is an option to visit the nearby hot springs.This morning we start early to visit the Cruz del Condor (Condor's Cross) lookout point in search of the giant condors soaring out of the canyon on thermal currents while taking a walk along the canyon's edge and admiring the spectacular views. The beautiful scenery continues as you take a combination of buses all the way to Puno on the shores of Lake Titicaca, which at 3,855 metres above sea level, is the highest navigable lake in the world.Up next is the beautiful Lake Titicaca itself. We visit the floating reed islands in the Bay of Puno to see the Uros islanders way of life and we will have the option to ride in a traditional reed boat.Next stop is Taquile Island, an island on Lake Titicaca still holding up many of the traditions values and customs it was built on. Learn about the way of life, from the reasons for why they do their hair the way they do and how they dress. Famous for their textiles and clothing, you will be able to pick up a homemade gift or two from the main square.Today you will journey towards Cusco on a tourist bus. Pass breathtaking Andean mountain scenery on this full day journey. Cusco, which means ‘navel of the earth' in the Inca language of Quechua, has a mostly indigenous population of around 300,000 and is centred around the Plaza de Armas, which is dominated by the Cathedral and La Compañia de Jesus Church. Its cloistered arcades house many fine restaurants, bars and shops which you have time to enjoy this evening.A full day is spent visiting the Sacred Valley of the Incas. At an altitude of 3800m we take slow walks that take up to an hour, around each of the ruins in order to manage any effects the high altitude may have. Firstly we visit the Pisac ruins, perched on a hilltop with incredible views of the surrounding mountains. We then go down to the famous traditional market of the same name, which is full of colour and atmosphere. A great place for souvenirs! After lunch, we continue along the valley to the temple/fortress of Ollantaytambo with its enormous Inca terracing constructed on the side of a steep mountain.Tonight you will stay in the town of Ollantaytambo.Having stayed overnight in Ollantaytambo, it means we have a short bus ride to the starting point of the trek. The first day is a relatively easy 4½ hour and 13 kilometre walk. With mostly flat and light climbs, you start to witness the lush scenery of Peru. Walking slowly, you will have plenty of short breaks to ensure the group are acclimatising to the altitude.The Inca Trail Trek can be demanding but can be completed by anyone who leads a reasonably active life - you certainly don’t need to be an athlete. Everyone is able to walk at their own pace and there is no rush to finish. The trekking group is led by an expert local guide and supported by a team of porters and cooks, leaving you with only a small day pack to carry. If you are in any doubt or if you have any condition that may affect your ability to trek, we advise that you consult your doctor.Please Note: Due to a limited number of people being allowed on the trail a day, permits are limited and can sell out far in advance. If you wish to book the Inca Trail, please provide your Reservations Agent with your passport details by email as soon as possible so that we can secure your permit. Without your passport details, we are unable to arrange your Inca Trail Trek. Alternatively you can opt to participate in the challenging but rewarding 1 day Inca trek. Please speak to one of our travel consultants for more information or you can read more about it here. If you are not participating in either trek then you will visit Machu Picchu by train and then have plenty of free time to enjoy the activities available in and around Cusco. Meals are included for those doing the Inca Trail Trek. If you are choosing not to do the Inca Trail Trek, you will have 2-3 days to spend exploring Cusco.Today is the biggest challenge on the trek as you reach the highest pass at Warmiwañusca, also known as Dead Woman’s Pass! Sitting at 4,200 metres, it is nearly 1,800 metres higher than Machu Picchu itself. The terrain here is slightly more rockier and due to open area, trekkers are more exposed to the elements, whether it’s the rain lashing down or the sun blazing down! However it can be said that traversing this part of the trail is the second most rewarding part, just after seeing Machu Picchu itself.You will cover approximately nine kilometres in about 5-7 hours and after the high pass it's all downhill as the trail winds its way along old Inca stairs to our campsite.Today you will cover the most distance, at 15 kilometres you will walk for around 7 hours. While being the longest day, it is also the most interesting as you pass more ruins and unique sites. After roughly one hour of trekking you will come to the ruins of Runkurakay, a small circular shaped archaeological site. It has been said this site was most likely used as resting point for the Inca messengers, who maintained communication across the Inca Empire.From this point, it is mostly downhill, and we have four more ruin sites to be discovered, with the next being Sayacmarca. Also known to historians as the “inaccessible town” due to it being barricaded on three sides with steep mountain drop offs, archaeologists remain baffled as to what the site was used for. Some say it was a viewing and control point for those headed to Machu Picchu.We continue onto Phuyupatamarca where you can enjoy some amazing views from the top. The Quechua translation being “town in the clouds” it offers some great photo opportunities and is often used as a lunch spot for groups.On the last morning of the Inca Trail Trek, after an overnight stop at Wiñay-Wayna, you will rise early for the final walk to Machu Picchu and greet daybreak over the famous “Sun Gate”. There will then be time to explore on your own or simply take in the magnificence of the place after your guided tour.The Lost City of Machu Picchu was originally completely self-contained, surrounded by agricultural terraces sufficient to feed the population, and watered by natural springs. Located high above the fast flowing Urubamba River, the cloud shrouded ruins have palaces, baths, temples, storage rooms and some 150 houses, all in a remarkable state of preservation that will simply take your breath away.The ruins were only discovered by the outside world in 1911, when American explorer Hiram Bingham found them while looking for another “lost city” called Vilcabamba. Due to their isolation many of the buildings are still quite intact and you can't help but admire Huayna Picchu (“Young Mountain”), which towers above the ruins.After spending most of the day at Machu Picchu you have the chance to meander through the markets of Aguas Calientes before enjoying a scenic train ride back to the Sacred Valley where our transfer to Cusco will be waiting.Today is free to relax and explore some more of Cusco. Take a walking tour and admire the colonial buildings or wander the colourful San Pedro Market, where you can find fruits and vegetables in abundance as well as other local delicacies.A 45 minute walk from the centre lies Sacsayhuaman, another ancient Inca site that is well worth the journey for both the incredible views of Cusco and the interesting stonework. You can also catch a glimpse of Cristo Blanco, the large statue of Christ that towers above the city.Spend the evening back at Plaza de Armas and experience Cusco after dark. With plenty quaint restaurants and vibrant bars around, the plaza is as lively as during the day.No trip to Peru would be complete without a visit to what is considered the most biodiverse place on earth, the lush and beautiful Amazon rainforest. Covering nearly two thirds of the country, the area is home to around 600 species of birds, 1200 types of butterflies and 300 reptiles, to name a few. As eco-tourism continues to grow, there are a number of eco lodges allowing you to experience the rainforest in the most responsible and authentic way possible.Our local representative will transfer you to the airport for your flight to the jungle community of Puerto Maldonado, the starting point for our visit to the Amazon rainforest. Here you can pick up last minute drinks and snacks before the group continue with a short bus ride followed by riverboat journey to reach the accommodation for the night. Sailing along the river, the trip takes around 2 hours and is an excellent chance to relax and start to take in the magic of the rainforest.Arriving at your riverside lodge, check in and have some time to relax before an afternoon of exploring. After lunch we will set off on a trek through the rainforest along wooden walkways. On the way our guide will stop to show you various species of bird and explain the medicinal plants and delicate ecological systems of the Amazon Jungle. The scenery is extremely varied incorporating dense jungle as well as marsh areas. You will see incredibly big trees, several metres in diameter and around 450 years old. We walk to Cochita Caiman (Caiman Pond) where we see wildlife along the way. We then return to the lodge for dinner.Please note: The eco-lodges in the Amazon jungle are designed to give travellers the most authentic jungle experience while limiting disruption to the animals and plantlife. The bungalows are built from local indigenous materials with the rooms sealed by mesh netting to keep mosquitoes out. All rooms have private bathroom facilities however these are basic and hot water can be limited. There is portable water available at the lodge therefore we recommend taking a reusable water bottle with you. Electricity is limited and it is advisable to bring portable chargers for your electronics and ensure they are fully charged. After dark, the walkways are lit by oil lamps. The lodges include a welcome area, dining room and bar, meaning there are plenty areas for your group to relax and socialise. Single supplements are not available in the bungalows. If you have further questions on what to expect, your tour leader will be happy to assist. All excursions in the jungle are led by an English speaking guide.After an early breakfast we hike deeper in to the jungle, enjoying the surroundings and exploring the delights and hidden wonders of the Amazon Rainforest. We may also catch a glimpse of the rare giant otter. Afterwards we will enjoy the view of the lake from our viewing point/observation platform, where you can experience the canopy wildlife such as parrots, guacamayos, toucans, camungos, shanshos, herons, turtles and caiman. We will return to the lodge for a well deserved lunch.After a break and some yummy food, we take a short boat trip across the Madre de Dios River to Monkey Island. On the way over you may spot caiman from the boat. Once on the island it is possible to see a great variety of monkeys such as the ‘maquisapa’, black and white ‘Martins’, ‘Leoncito de la Selva’ (Little Lions), ‘Frailes’ (Friars), ‘Achuñis’, ‘Ronsocos’ as well as an array of birdlife. In the evenings it is often possible to enjoy the wonderful sunset, one of the most impressive sights of the forest (weather permitting).Enjoy your final night in the heart of the jungle soaking up this magical and peaceful atmosphere.This morning after breakfast we make our way to Lima. After a boat back to Puerto Maldonado, followed by a two hour flight you are met by our local representative and transferred to your hotel for the evening.Lima was founded by the Spanish Conquistador Francisco Pizarro in 1535 after he eradicated the Incas and made the city his capital. Lima has many fine colonial buildings and some of the best museums in South America including the Gold Museum, Museum of the Inquisition and the Catacombs below the San Francisco Church. Peru's capital has much to offer and many of the sights, including the city's two main squares the Plaza de Armas and Plaza San Martin, boast some fantastic sightseeing opportunities. The Plaza de Armas houses the Cathedral, Municipal Palace and Presidential Palace where the changing of the guard can be seen every day at 12 noon. There are also many markets in Lima, possibly the best being in the central district.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}