{"title": "Morocco in Two Weeks", "link": "https://www.tucantravel.com/tour/best-of-morocco-casablanca-start/rmobmc/", "dates": {"2020-04-05": "USD 60.00", "2020-04-19": "USD 60.00", "2020-05-03": "USD 60.00", "2020-05-17": "USD 60.00", "2020-05-31": "USD 60.00", "2020-06-14": "USD 60.00", "2020-06-26": "USD 60.00", "2020-07-12": "USD 60.00", "2020-07-26": "USD 60.00", "2020-08-09": "USD 60.00", "2020-08-23": "USD 60.00", "2020-09-06": "USD 60.00", "2020-09-20": "USD 60.00", "2020-10-04": "USD 60.00", "2020-10-18": "USD 60.00", "2020-11-01": "USD 60.00", "2020-11-15": "USD 60.00", "2020-11-29": "USD 60.00", "2020-12-07": "USD 60.00", "2020-12-23": "USD 60.00", "2021-01-17": "USD 60.00", "2021-01-31": "USD 60.00", "2021-02-14": "USD 60.00", "2021-02-28": "USD 60.00", "2021-03-14": "USD 60.00", "2021-03-28": "USD 60.00", "2021-04-11": "USD 60.00", "2021-04-25": "USD 60.00", "2021-05-09": "USD 60.00", "2021-05-23": "USD 60.00", "2021-06-06": "USD 60.00", "2021-06-20": "USD 60.00", "2021-07-04": "USD 60.00", "2021-07-18": "USD 60.00", "2021-08-01": "USD 60.00", "2021-08-15": "USD 60.00", "2021-08-29": "USD 60.00", "2021-09-12": "USD 60.00", "2021-09-26": "USD 60.00", "2021-10-10": "USD 60.00", "2021-10-24": "USD 60.00", "2021-11-07": "USD 60.00", "2021-11-21": "USD 60.00", "2021-12-07": "USD 60.00", "2021-12-23": "USD 60.00"}, "days": "14", "description": "Experience the highlights of Morocco on this small group tour. We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Morocco! You will be transferred from the airport to your hotel where you have the remainder of the day to relax or explore.Casablanca is the largest city in Morocco and is considered the economic and business centre of the country. From the fascinating architecture to the immense art and culture scene, there are many hidden gems in this populous city. Parts of the city are designated UNESCO World Heritage Sites and walking the streets is the perfect way to immerse yourself in the history. In the heart of old Casablanca you will find the palm-lined Boulevard Mohammed V, a striking reminder of the French influence in the city.You will have a pre departure meeting at 6pm tonight to meet your tour leader and group.Spend the morning in Rabat visiting Oudaia Kasbah, Hassan tower and the Royal palace. After lunch we head to the imperial city of Meknes where you can enjoy some free time to relax.On the way to Chefchaouen, we visit the Roman ruins of Volubilis, the largest site in Morocco dating back to AD40. A UNESCO listed site, the Roman settlement once ruled the province of Mauritania.We then head to Chefchaouen where we will spend the night. Nestled in the Rif mountains, the town is a picture of delight. Here there is a busy market and tourist face and a beautiful main square at the town’s heart. Admire and marvel at the picturesque painted blue streets and narrow lanes.After spending a leisurely morning in Chefchaouen we head to Fes in the afternoon. After check in you are free to relax or start exploring before your guided city tour tomorrow.Rich in culture and tradition, Fes is the second largest city in Morocco and it's medina is one of the largest intact in the world.Today we enjoy a guided tour to see the highlights and learn more about this medieval city. It is the oldest medieval city in the world, heavy in history and powerful stories. The souk’s are an intense mix of spices, sounds and colourful sights. Outside of the souks there are plenty of medieval mosques and palaces to visit. A full day city tour is included and we visit the famous leather tanneries and dye pits. That night you have the option to soak up traditional Moroccan entertainment and food at a local restaurant which comes highly recommended.Today we head over the Moyen Atlas and stop at Midelt. Soak up the beautiful alpine setting and enjoy some relaxation after the hustle and bustle of Fes.On route, we will visit a local Berber family to learn about their way of life. Through the financial support that we provide the family with this excursion they have been able to build a new toilet block for the extended family. Upon arrival to Midelt we enjoy a short hike soaking up the beauty of the area.Please note that for tours from 2021, lunch will not be included on this day.Today we can enjoy a scenic drive heading towards the great Sahara Desert. We stop for a delicious Moroccan lunch (optional) before continuing to the desert. During the summer months we may also have time for a relaxing swim.Once we are fully refreshed we travel to Merzouga, where we board our desert transport- camels! Ride through the sand, reaching the Berber Camp where we will stay the night.Enjoy local food, music and an incredible night star-gazing under the desert sky.With vertical cliffs surrounding it, Todra Gorge is Morocco's answer to the Grand Canyon.Breathtakingly beautiful, we have time to explore the gorge, taking hikes around the rim and into the basin or even trying out rock climbing. As the day progresses, the colours of the canyon change turning a magnificent golden colour.Today we say goodbye to Todra Gorge.On the way, we stop off at Ouarzazate, a resting point traditionally used by African traders. Today it has been used as the set of many great films like Alexander the Great and The Last Temptation of Christ.Arriving at Ait Benhaddou we can enjoy a guided tour of the city known for its ancient and well preserved Kasbahs that are still occupied by a handful of families today. The city sits between the Sahara and Marrakech and has been a UNESCO World Heritage Site for a number of years.Located on the South Atlantic Coast, Essaouira (pronounced esa-wera) is a peaceful seaside town with a UNESCO World Heritage-listed medina. Previously known as Mogador, the city is a beautiful example of an 18th century fortified maritime citadel and is a popular artists’ town with many cultural influences including Arab, Berber, Jewish, African and European.The mild climate invites you to rest and relax, however, with its narrow streets lined by workshops and art galleries this pretty blue and white washed city has plenty to keep you busy during your stay. Essaouira also has a long, wild ribbon of beach which is a great place to watch windsurfers, kitesurfers and sand-yachters show off their talents in the brisk sea breeze. In the evening you can enjoy a fresh fish dinner at the harbour or take a sunset stroll along the ramparts, a popular local activity.Today is a free day to explore the sights and activities of Essaouira.We return to Marrakech where you have free time to enjoy and tick off any further sights you want to explore. Relax by the pool and haggle in the markets for any last minute gifts.Today you are free to enjoy the city – speak to your guide about booking an optional guided city tour.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}