{"title": "Northern Morocco", "link": "https://www.tucantravel.com/tour/northern-morocco/rmonm/", "dates": {"2020-05-16": "USD 60.00", "2020-06-13": "USD 60.00", "2020-07-11": "USD 60.00", "2020-08-08": "USD 60.00", "2020-09-12": "USD 60.00", "2020-10-10": "USD 60.00", "2020-11-07": "USD 60.00", "2020-12-23": "USD 60.00", "2021-01-23": "USD 60.00", "2021-02-06": "USD 60.00", "2021-02-20": "USD 60.00", "2021-03-06": "USD 60.00", "2021-03-20": "USD 60.00", "2021-04-03": "USD 60.00", "2021-04-17": "USD 60.00", "2021-05-01": "USD 60.00", "2021-05-15": "USD 60.00", "2021-05-29": "USD 60.00", "2021-06-12": "USD 60.00", "2021-06-26": "USD 60.00", "2021-07-10": "USD 60.00", "2021-07-24": "USD 60.00", "2021-08-07": "USD 60.00", "2021-08-21": "USD 60.00", "2021-09-04": "USD 60.00", "2021-09-18": "USD 60.00", "2021-10-02": "USD 60.00", "2021-10-16": "USD 60.00", "2021-10-30": "USD 60.00", "2021-11-13": "USD 60.00", "2021-11-27": "USD 60.00", "2021-12-11": "USD 60.00", "2021-12-21": "USD 60.00"}, "days": "10", "description": "Experience the very best of Northern Morocco on this 10 day adventure. Starting in the vibrant Marrakech, visit four Imperial cities as you journey to Rabat, Meknes and Fes. Lose yourself in the hustle and bustle of local souks, tick off some of Morocco's finest UNESCO World Heritage Sites and compare delicious local dishes. From the picture perfect Chefchaouen to the Holy City of Moulay Idriss, this tour is perfect for getting off the beaten track and experiencing the authentic Northern Morocco. We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Morocco! You will be transferred from the airport to your hotel where you have the remainder of the day to relax or explore.Marrakech is one of the most captivating and unique cities in North Africa, encompassed by the incredible peaks of the Atlas Mountain range. Founded around 1062 by the Almoravids, Marrakech went on to become the capital city of the Almohad caliphate during the 12th century, which covered most of Spain and Africa. It flourished for centuries until during a period of unrest in the early 20th century, the French went on to colonise Morocco. While their influence lives on in the architecture and language, the country holds strong traditions and culture, with beautiful mosques and medinas found in the cities.Take a step back in time and lose yourself in the maze of souks and spice markets in the ancient medina, wander the labyrinthine of stalls with colourful skeins of wool drying above your head against bright blue skies or pick your way through alleys lined with elaborately decorated brass lamps while dodging donkeys.Let all your troubles float away as you unwind in a traditional hammam, sample the delicious food such as hummus, couscous, tagine and zaalouk and of course relax with a Moroccan mint tea.You will have a pre departure meeting at 6pm tonight to meet your tour leader and group.This morning we travel to Casablanca where we collect the rest of the group joining this tour. If you would prefer to start in Casablanca please speak to one of our Adventure Specialists.Upon arrival you are free to explore. Casablanca is the largest city in Morocco and is considered the economic and business center of the country. From the fascinating architecture to the immense art and culture scene, there are many hidden gems in this populous city. Parts of the city are designated UNESCO World Heritage Sites and walking the streets is the perfect way to immerse yourself in the history. In the heart of old Casablanca you will find the palm-lined Boulevard Mohammed V, a striking reminder of the French influence in the city.Come evening be sure to indulge in some local food at one of the many restaurants or food vendors found down every street.Today we depart for Fes, stopping off at various highlights along the way. Our first visit is to Meknes, one of the Imperial cities and where we enjoy a guided tour. Experience the beauty of the 12th century Grande Mosque and visit the Mausoleum of Moulay Ismail where we see the tomb and learn about the interesting history.After lunch we depart for the ancient Roman settlement of Volubilis. Sitting on a fertile plain surrounded by wheat fields, Volubilis is Morocco's best-preserved Roman ruins which date back to 40 A.D. A UNESCO World Heritage Site, it is believed the settlement was once home to some 20,000 people.Our next stop is the Holy City of Moulay Idriss, which opened its doors to non-muslims 14 years ago. One of the country's most important pilgrimage sites, the town is where Moulay Idriss I arrived in 789 with the religion of Shiism, starting a new dynasty. It sits in a cradle of mountains and is one of the most picturesque towns in Morocco, as well as holding plenty of historical significance.We then depart for Fes which is our final destination of the day.Rich in culture and tradition, Fes is the second largest city in Morocco and it's medina is one of the largest intact in the world.Today we enjoy a guided tour to see the highlights and learn more about this medieval city. It is the oldest medieval city in the world, heavy in history and powerful stories. The souk’s are an intense mix of spices, sounds and colourful sights. Outside of the souks there are plenty of medieval mosques and palaces to visit. A full day city tour is included and we visit the famous leather tanneries and dye pits. That night you have the option to soak up traditional Moroccan entertainment and food at a local restaurant which comes highly recommended.After breakfast we travel towards Chefchaouen, stopping off for a visit to Ouazzane on the way. This little town is a hidden gem in Morocco, known by the Islamic world as the Spiritual Capital since many Moroccan Saints have their memorials and graves laid here. After lunch we continue to the final destination of Chefchaouen.Coated in hues of stunning blue, the town of Chefchaouen is every photo lovers dream. Founded in 1471, Chefchaouen has a beautiful old medina and offers a range of restaurants, markets and stalls. There are many stories about the colour of the city, some say the Jewish people painted the buildings blue after fleeing Hitler, some say the striking colour keeps mosquitos away and others say it simply represents the colour of the ocean. Whatever the reason, it makes for a beautiful and unique city!You will have a free afternoon to wander the hidden streets and start sampling some tasty authentic cuisine.Today is free to enjoy at your leisure. Wander the cobbled lanes, explore the markets or visit the Andalusian Gardens which stand in the centre of the medina.A highlight for many is a day trip to the magical Akchour Falls. A two hour drive away, you can enjoy a leisurely hike to the top where you will be rewarded with amazing views of the surrounding scenery. Don't forget to take your swimsuit as the waters here are perfect for a dip!We say goodbye to the quaint blue city and head towards Tangier, largely considered the gateway to both Africa and Europe. Exploring Tangier will give you a glimpse of the past and present all at once. A mix of tradition, stunning architecture and old and new medinas, Tangier is fast developing into a modern and vibrant city.Visit the Dar el Makhzen to see unique artefacts from Morocco, stroll the narrow streets to find the Kasbah Museum and former Royal Palace or take in the sounds and smells of the Grand Socco market.Located 14 kilometres outside the city, you could also visit the Caves of Hercules, an archaeological cave complex where it is said Hercules slept before doing his 11th labour, getting golden apples from the Hesperides Garden.Today we make our way south and back to Casablanca, but first we stop at the capital city of Rabat. Built in the 10th century, Rabat is located on the shores of the Atlantic Ocean and is known for it's fort and Islamic/French Colonial heritage. We enjoy a guided tour to learn more about the history and culture of this fascinating city.We visit the Oudaia Kasbah, Hassan Tower, Royal Palace and Chellah, the walled ruins located a short walk from the medina.After lunchtime we continue back to Casablanca where we arrive early evening and in plenty of time to enjoy dinner and the vibrant nightlife.This morning you are free to tick off any last highlights of Casablanca. We highly recommend a guided tour of Hassan II Mosque, the largest in Morocco and second largest in the whole of Africa. At 210 metres, the mosque holds the title for the world's tallest minaret. Up to 25,000 people can fit inside the walls with space for a further 80,000 outside, making it one of the most magical places you will visit in Morocco!Late morning we travel back to Marrakech. The afternoon is free to enjoy and you have the option to book a guided tour of the city. You could also enjoy an authentic hammam experience, browse crafts and spices in the souks or wander the UNESCO listed medina.Tonight we will meet for a last group dinner before the tour comes to an end.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/morocco_137/morocco_marrakech_night_souk_20161111_1841153872.jpg", "countries": "Morocco"}