{"title": "Inca Trail Trek", "link": "https://www.tucantravel.com/tour/inca-trail-trek/rpitt/", "dates": {"2020-03-31": "USD 160.00", "2020-04-07": "USD 160.00", "2020-04-14": "USD 160.00", "2020-04-21": "USD 160.00", "2020-04-28": "USD 160.00", "2020-05-05": "USD 160.00", "2020-05-12": "USD 160.00", "2020-05-19": "USD 160.00", "2020-05-26": "USD 160.00", "2020-06-02": "USD 160.00", "2020-06-09": "USD 160.00", "2020-06-16": "USD 160.00", "2020-06-23": "USD 160.00", "2020-06-30": "USD 160.00", "2020-07-07": "USD 160.00", "2020-08-11": "USD 160.00", "2020-08-25": "USD 160.00", "2020-09-08": "USD 160.00", "2020-09-15": "USD 160.00", "2020-09-29": "USD 160.00", "2021-01-05": "USD 170.00", "2021-01-15": "USD 170.00", "2021-01-19": "USD 170.00", "2021-01-26": "USD 170.00", "2021-03-02": "USD 170.00", "2021-03-09": "USD 170.00", "2021-03-16": "USD 170.00", "2021-03-23": "USD 170.00", "2021-03-30": "USD 170.00", "2021-04-06": "USD 170.00", "2021-04-13": "USD 170.00", "2021-04-20": "USD 170.00", "2021-04-27": "USD 170.00", "2021-05-04": "USD 170.00", "2021-05-11": "USD 170.00", "2021-05-18": "USD 170.00", "2021-05-25": "USD 170.00", "2021-06-01": "USD 170.00", "2021-06-08": "USD 170.00", "2021-06-15": "USD 170.00", "2021-06-22": "USD 170.00", "2021-06-29": "USD 170.00", "2021-07-06": "USD 170.00", "2021-07-13": "USD 170.00", "2021-07-20": "USD 170.00", "2021-07-27": "USD 170.00", "2021-08-03": "USD 170.00", "2021-08-10": "USD 170.00", "2021-08-17": "USD 170.00", "2021-08-24": "USD 170.00", "2021-08-31": "USD 170.00", "2021-09-07": "USD 170.00", "2021-09-14": "USD 170.00", "2021-09-21": "USD 170.00", "2021-09-28": "USD 170.00", "2021-10-05": "USD 170.00", "2021-10-12": "USD 170.00", "2021-10-19": "USD 170.00", "2021-10-26": "USD 170.00", "2021-11-02": "USD 170.00", "2021-11-09": "USD 170.00", "2021-11-16": "USD 170.00", "2021-11-23": "USD 170.00", "2021-12-07": "USD 170.00", "2021-12-14": "USD 170.00", "2021-12-21": "USD 170.00", "2021-12-28": "USD 170.00"}, "days": "7", "description": "Approach the awe-inspiring ruins that are Machu Picchu in the most authentic way possible trekking through the land of the Incas. The Inca Trail Trek will take you over high Andean passes and across original Inca stone pathways before you arrive at the Lost City of the Incas. We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Peru! Your adventure starts in Cusco, a city of beautiful Spanish colonial architecture and the once capital of the Inca Empire. While the city is usually seen as the gateway to the iconic Machu Picchu, Cusco is well worth exploring in itself.Discover the Plaza de Armas, the cultural centre of the city and where you can find many bars, restaurants and local coffee shops. Visit the Cathedral, which was built with blocks from the nearby Inca site of Sacsayhuaman and took almost a century to complete.We highly recommend arriving to Cusco a few days prior to the start of your tour to help with acclimatisation. If you would like to book pre-tour accommodation please contact your Adventure Specialist.Tonight you will have a briefing on what to expect over the next few days and your journey to Machu Picchu.A full day is spent visiting the Sacred Valley of the Incas. At an altitude of 3800m we take slow walks that take up to an hour, around each of the ruins in order to manage any effects the high altitude may have. Firstly we visit the Pisac ruins, perched on a hilltop with incredible views of the surrounding mountains. We then go down to the famous traditional market of the same name, which is full of colour and atmosphere. A great place for souvenirs! After lunch, we continue along the valley to the temple/fortress of Ollantaytambo with its enormous Inca terracing constructed on the side of a steep mountain.Tonight you will stay in Ollantaytambo.Having stayed overnight in Ollantaytambo, it means we have a short bus ride to the starting point of the trek. The first day is a relatively easy 4½ hour and 13 kilometre walk. With mostly flat and light climbs, you start to witness the lush scenery of Peru. Walking slowly, you will have plenty of short breaks to ensure the group are acclimatising to the altitude.The Inca Trail Trek can be demanding but can be completed by anyone who leads a reasonably active life - you certainly don’t need to be an athlete. Everyone is able to walk at their own pace and there is no rush to finish. The trekking group is led by an expert local guide and supported by a team of porters and cooks, leaving you with only a small day pack to carry. If you are in any doubt or if you have any condition that may affect your ability to trek, we advise that you consult your doctor.Please Note: Due to a limited number of people being allowed on the trail a day, permits are limited and can sell out far in advance. If you wish to book the Inca Trail, please provide your Reservations Agent with your passport details by email as soon as possible so that we can secure your permit. Without your passport details, we are unable to arrange your Inca Trail Trek. Alternatively you can opt to participate in the challenging but rewarding 1 day Inca trek. Please speak to one of our travel consultants for more information or you can read more about it here. If you are not participating in either trek then you will visit Machu Picchu by train and then have plenty of free time to enjoy the activities available in and around Cusco. Meals are included for those doing the Inca Trail Trek. If you are choosing not to do the Inca Trail Trek, you will have 2-3 days to spend exploring Cusco.Today is the biggest challenge on the trek as you reach the highest pass at Warmiwañusca, also known as Dead Woman’s Pass! Sitting at 4,200 metres, it is nearly 1,800 metres higher than Machu Picchu itself. The terrain here is slightly more rockier and due to open area, trekkers are more exposed to the elements, whether it’s the rain lashing down or the sun blazing down! However it can be said that traversing this part of the trail is the second most rewarding part, just after seeing Machu Picchu itself.You will cover approximately nine kilometres in about 5-7 hours and after the high pass it's all downhill as the trail winds its way along old Inca stairs to our campsite.Today you will cover the most distance, at 15 kilometres you will walk for around 7 hours. While being the longest day, it is also the most interesting as you pass more ruins and unique sites. After roughly one hour of trekking you will come to the ruins of Runkurakay, a small circular shaped archaeological site. It has been said this site was most likely used as resting point for the Inca messengers, who maintained communication across the Inca Empire.From this point, it is mostly downhill, and we have four more ruin sites to be discovered, with the next being Sayacmarca. Also known to historians as the “inaccessible town” due to it being barricaded on three sides with steep mountain drop offs, archaeologists remain baffled as to what the site was used for. Some say it was a viewing and control point for those headed to Machu Picchu.We continue onto Phuyupatamarca where you can enjoy some amazing views from the top. The Quechua translation being “town in the clouds” it offers some great photo opportunities and is often used as a lunch spot for groups.On the last morning of the Inca Trail Trek, after an overnight stop at Wiñay-Wayna, you will rise early for the final walk to Machu Picchu and greet daybreak over the famous “Sun Gate”. There will then be time to explore on your own or simply take in the magnificence of the place after your guided tour.The Lost City of Machu Picchu was originally completely self-contained, surrounded by agricultural terraces sufficient to feed the population, and watered by natural springs. Located high above the fast flowing Urubamba River, the cloud shrouded ruins have palaces, baths, temples, storage rooms and some 150 houses, all in a remarkable state of preservation that will simply take your breath away.The ruins were only discovered by the outside world in 1911, when American explorer Hiram Bingham found them while looking for another “lost city” called Vilcabamba. Due to their isolation many of the buildings are still quite intact and you can't help but admire Huayna Picchu (“Young Mountain”), which towers above the ruins.After spending most of the day at Machu Picchu you have the chance to meander through the markets of Aguas Calientes before enjoying a scenic train ride back to the Sacred Valley where our transfer to Cusco will be waiting.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}