{"title": "Southern Sri Lanka", "link": "https://www.tucantravel.com/tour/southern-sri-lanka/srs/", "dates": {"2020-04-10": "USD 140.00", "2020-05-08": "USD 140.00", "2020-06-05": "USD 140.00", "2020-07-03": "USD 140.00", "2020-07-31": "USD 140.00", "2020-08-28": "USD 140.00", "2020-09-25": "USD 140.00", "2020-10-16": "USD 140.00", "2020-11-06": "USD 140.00", "2020-11-27": "USD 140.00", "2020-12-11": "USD 140.00", "2020-12-25": "USD 140.00", "2021-01-15": "USD 150.00", "2021-02-05": "USD 150.00", "2021-02-26": "USD 150.00", "2021-03-19": "USD 150.00", "2021-04-09": "USD 150.00", "2021-04-30": "USD 150.00", "2021-05-28": "USD 150.00", "2021-06-25": "USD 150.00", "2021-07-23": "USD 150.00", "2021-08-20": "USD 150.00", "2021-09-17": "USD 150.00", "2021-10-15": "USD 150.00", "2021-11-05": "USD 150.00", "2021-11-26": "USD 150.00", "2021-12-17": "USD 150.00", "2021-12-31": "USD 150.00"}, "days": "9", "description": "V We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.Welcome to Sri Lanka! You are free to arrive today at your leisure.Negombo is situated by the shores of a lagoon by the same name. Once a Portuguese and Dutch trading port, popular attractions here include the Old Dutch fort gate built in 1672, the Dutch Canal, and the old churches and fishing villages which surround the area. In fact, due to the many ornate Roman Catholic churches scattered throughout, Negombo is sometimes known as &#34;The Little Rome&#34;. It also has a huge and rather inviting white sandy beach!Around 6 pm you will meet the local Tucan Travel representative for your pre-departure meeting and if not too tired after your flight you can join him for an evening meal.After breakfast, we head inland away from the coast towards Nuwara Eliya, located in the heart of Sri Lankan hill country where the higher altitudes and cooler climate offers the perfect environment to grow the world-renowned Sri Lanka tea. Also today we may meet some new faces as we combine with other Tucan Travel customers arriving from the North of the island.Today we enjoy an included tour to enjoy the velvety green tea plantations carpeting the rolling hills and to visit one of the local plantations and tea factory. The rest of the day offers time to be spent at your leisure, and a chance to relax and enjoy the cooler climes.Early in the morning we leave the hotel and head towards the impressive Horton Plains National Park. The park is home to many species of wildlife, including the sambar deer, macaques, leopards, wild boar and mongooses. The area is surrounded by the country's highest mountains, shrouded in cloud and rivers. This is the only National Park in Sri Lanka in which visitors are allowed to walk around freely so we will take the opportunity for a trek through the high mountain vegetation and lakes.Our goal is &#39;Worlds End&#39; where the 2000 metre plateau comes to an abrupt end, plunging 700-1000 meters to the valley floor. On the way we will visit Baker's Falls for panoramic views of the waterfalls, see a great deal of wildlife, including with purple­faced langurs, wild boar and barking deer as well as a small number of leopards.We board a train from Nuwara Eliya and enjoy the slow pace through the mountain scenery as we head to Ella. Ella is a sleepy village in Sri Lanka's Hill Country. Please note that seating is non-reserved on the train.This morning we enjoy a short 5km trek to Little Adam's Peak. After watching the sunrise we will visit Nine Arch bridge breakfast, followed by the Ravana Waterfalls.We then continue to Yala National Park where we will spend a night just outside of the park. We will take a game drive for your best chances to see elephants, leopards and bears. Yala National Park was established in 1900 and has one of the densest populations of wildlife in Asia. The park has two important pilgrimage sites, Sithulpahuwa and Magul Vilhara and has been the center of past civilisations.We depart this morning heading towards Unawatuna. On the way we visit the Udawalawe Elephant Transit Home, an important sanctuary that aims to rehabilitate orphaned elephant calves for release back into the wild.Upon arrival you are free to explore or relax on some of the most beautiful beaches in Sri Lanka. Off the coast, there are excellent diving opportunities, with a number of coral reefs and shipwrecks to be explored. There are a number of optional activities here to enjoy, and with two nights in Unawatuna, there is plenty of time to make the most of the surroundings.Today we include a city tour of nearby Galle, an old fortified city founded by Portuguese colonists in the 16th century, and later expanded by the Dutch.There are also a number of optional activities to enjoy in and around Unawatuna, and with two nights here, there's plenty of time to explore or simply take the opportunity to enjoy the surroundings and relax at the end of your enjoyable, activity-packed adventure.Upon arrival to Colombo, expect a busy and vibrant city with a mixture of modern life and colonial buildings. Enjoy driving through the Commercial area or the 'Fort', so named because both the Portuguese and Dutch had a fort here. We drive past 'Pettah', a hectic bazaar full of ancient vehicles, bargains, mosques and temples, then visit a Hindu temple and drive past Jumi-UL Alfar Jumma Mosque. We continue through the Wolvendaal Dutch Church, Hultsdorf Law courts, to the residential area of Cinnamon Gardens and on to Independence Square and Bandaranayake Memorial International Conference Hall.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights."}