{"title": "Tortuguero Costa", "link": "https://www.tucantravel.com/tour/tortuguero-costa/tcs/", "dates": {"2020-05-01": "USD 130.00", "2020-05-15": "USD 130.00", "2020-05-29": "USD 130.00", "2020-06-12": "USD 130.00", "2020-06-26": "USD 130.00", "2020-07-10": "USD 130.00", "2020-07-24": "USD 130.00", "2020-08-07": "USD 130.00", "2020-08-21": "USD 130.00", "2020-09-04": "USD 130.00", "2020-09-18": "USD 130.00", "2020-10-02": "USD 130.00", "2020-10-16": "USD 130.00", "2020-10-30": "USD 130.00", "2020-11-13": "USD 130.00", "2020-11-27": "USD 130.00", "2020-12-11": "USD 130.00", "2020-12-25": "USD 130.00", "2021-01-08": "USD 140.00", "2021-01-22": "USD 140.00", "2021-02-05": "USD 140.00", "2021-02-19": "USD 140.00", "2021-03-05": "USD 140.00", "2021-03-19": "USD 140.00", "2021-04-02": "USD 140.00", "2021-04-16": "USD 140.00", "2021-04-30": "USD 140.00", "2021-05-14": "USD 140.00", "2021-05-28": "USD 140.00", "2021-06-11": "USD 140.00", "2021-06-25": "USD 140.00", "2021-07-09": "USD 140.00", "2021-07-23": "USD 140.00", "2021-08-06": "USD 140.00", "2021-08-20": "USD 140.00", "2021-09-03": "USD 140.00", "2021-09-17": "USD 140.00", "2021-10-01": "USD 140.00", "2021-10-15": "USD 140.00", "2021-10-29": "USD 140.00", "2021-11-12": "USD 140.00", "2021-11-26": "USD 140.00", "2021-12-10": "USD 140.00", "2021-12-24": "USD 140.00"}, "days": "9", "description": "S We will try to run your tour as close to the itinerary as conditions will allow. On very rare occasions, local events may affect the way your itinerary operates. We ask for your flexibility and understanding in these situations.The capital city of Costa Rica, San José, is nestled in a fertile valley among coffee and sugar-cane farms. There is not much left of the colonial era architecture, due to the damage done by earthquakes, but it is certainly worth seeing the National Theatre, built in 1897. Maybe you'll be lucky enough to catch a performance whilst you're here. The Gold, Jade and National Museums are also particularly recommended for a visitPlease note:  A hotel representative will be on hand to welcome you. You will meet your tour leader the next day in La Fortuna.Please note: If you are are travelling into Costa Rica from Peru, Bolivia, Brazil, Colombia, Ecuador and Panama then you will need a valid yellow fever certificate.Today your group will travel through the Central Valley to La Fortuna.After checking in you have time for lunch and to explore the town. Kick back and relax, you then have two full days to enjoy all the wonderful excursions in the area! You are free to enjoy the hiking trails, white water rafting, butterfly gardens or zip-line tours.Today you are free to partake in a variety of spectacular and exhilarating optional excursions while in La Fortuna; a visit to the some local waterfalls, caving, rappelling, white water rafting, canoeing, kayaking, horse-riding, trekking, biking, and wild-life spotting.Continuing our Costa Rica adventure we board a private vehicle and head to Tortuguero. After travelling for around 4 and a half hours through more beautiful scenery, we enjoy a 2 and a half hour boat journey to reach our destination. Tortuguero National Park is located on the Atlantic/Caribbean coast and we spend two nights in a remote jungle lodge, surrounded by wildlife. Look out for more monkeys and sloths as well as crocodiles, turtles and numerous bird species. If we are lucky we might even spot the unique Jesus Lizard, aptly named because it can walk on water!Spend today further enjoying the beach and wildlife of the area. If you are travelling between July and October, there is a chance of witnessing the Green sea turtles who arrive at the beach to lay eggs. During the period seven to ten weeks after nesting the turtles hatch which, to witness, is one of life's most inspiring events. There is an interesting visitor's centre in the tiny village where you can watch videos and learn all about the turtles. During our excursions around Tortuguero we may also have the chance to see the tiny but brightly coloured poison arrow frogs.We continue on to the small beachside town of Cahuita close to Cahuita National Park. Arriving at lunch time, there is plenty of time to explore one of the Caribbean coasts best national parks. Aside from one of the most beautiful beaches in Costa Rica, there are also walkways and trails going out to lookout points. Watch out for monkeys, sloths, lizards, frogs and tonnes of other wildlife. Cahuita is also home to the only coral reefs in the country. The only way to snorkel on the reef is on a guided tour so you can hire a guide locally to take you out onto the reef.Today is free to explore more of the national park or venture out of the town for a day. A great option is to take a short bus journey down the coast to Puerto Viejo de Talamanca. This laid-back Caribbean village has some of the best surf in the country and you can hire a bike and cycle to secluded beaches for a spot of sunbathing. From Puerto Viejo you can also visit the Jaguar Centre, a place of rescue and rehabilitation of animals native to Costa Rica. The animals are all nursed back to full health and released back into the wild as soon as possible.We then return to San Jose for another night. In the evening there are plenty of world class restaurants to choose from and some great nightlife especially if you are here on the weekend.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.", "image": "https://www.tucantravel.com/images/joomgallery/originals/large_385/costa_rica_108/costa_rica_cahuita_national_park_20161111_1727318999.jpg", "countries": "Costa Rica"}